Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <module id="00343" name="BA414E" version="">
          <instance name="BA414E">
            <register-group address-space="crypto1SCM" name="BA414E" name-in-module="BA414E" offset="0x1f900000"/>
          </instance>
          <instance name="BA414E_PK">
            <register-group address-space="periph_indep_b" name="BA414E_PK" name-in-module="BA414E_PK" offset="0x1f920000"/>
          </instance>
        </module>
        <module id="01152" name="CAN" version="">
          <instance name="CAN1">
            <register-group address-space="periph_pb2" name="CAN" name-in-module="CAN" offset="0x1f822000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03247" name="CAN" version="">
          <instance name="CAN2">
            <register-group address-space="periph_pb2" name="CAN" name-in-module="CAN" offset="0x1f823000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03337" name="CFG" version="">
          <instance name="CFG">
            <register-group address-space="configSfr0" name="CFG" name-in-module="CFG" offset="0x1f800000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03100" name="CRU" version="">
          <instance name="CRU">
            <register-group address-space="periph_pb1a" name="CRU" name-in-module="CRU" offset="0x1f801200"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03100" name="RCON" version="">
          <instance name="RCON">
            <register-group address-space="periph_pb1a" name="RCON" name-in-module="RCON" offset="0x1f801200"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="00158" name="CRYPTO" version="">
          <instance name="CRYPTO">
            <register-group address-space="periph_indep_a" name="CRYPTO" name-in-module="CRYPTO" offset="0x1f8e4000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03367" name="CVD" version="">
          <instance name="CVD">
            <register-group address-space="periph_pb2" name="CVD" name-in-module="CVD" offset="0x1f824000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="01500" name="DMAC" version="">
          <instance name="DMAC">
            <register-group address-space="periph_pb1b" name="DMAC" name-in-module="DMAC" offset="0x1f811000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="01520" name="DMT" version="">
          <instance name="DMT">
            <register-group address-space="periph_pb1a" name="DMT" name-in-module="DMT" offset="0x1f800a00"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="01348" name="DSCON" version="">
          <instance name="DSCON">
            <register-group address-space="periph_pb4" name="DSCON" name-in-module="DSCON" offset="0x1f871000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="01114" name="ETH" version="">
          <instance name="ETH">
            <register-group address-space="periph_pb3" name="ETH" name-in-module="ETH" offset="0x1f843000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03337" name="FUSECONFIG" version="">
          <instance name="FUSECONFIG">
            <register-group address-space="" name="FUSECONFIG" name-in-module="FUSECONFIG" offset="0x0"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="02467" name="GPIO" version="">
          <instance name="GPIO">
            <register-group address-space="periph_pb2" name="GPIO" name-in-module="GPIO" offset="0x1f820000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="01441" name="I2C" version="">
          <instance name="I2C1">
            <register-group address-space="periph_pb2" name="I2C" name-in-module="I2C" offset="0x1f820400"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
          <instance name="I2C2">
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="00740" name="ICAP" version="">
          <instance name="ICAP1">
            <register-group address-space="periph_pb3" name="ICAP" name-in-module="ICAP" offset="0x1f841000"/>
            <parameters>
              <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
              <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
              <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
              <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
            </parameters>
          </instance>
          <instance name="ICAP2">
            <parameters>
              <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
              <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
              <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 5"/>
              <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 4"/>
            </parameters>
          </instance>
          <instance name="ICAP3">
            <parameters>
              <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
              <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
              <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
              <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
            </parameters>
          </instance>
          <instance name="ICAP4">
            <parameters>
              <param name="TMR_SRC_0" value="0" caption="Timer 3"/>
              <param name="TMR_SRC_1" value="1" caption="Timer 2"/>
              <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 7"/>
              <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 6"/>
            </parameters>
          </instance>
        </module>
        <module id="02907" name="INT" version="">
          <instance name="INT">
            <register-group address-space="periph_pb1b" name="INT" name-in-module="INT" offset="0x1f810000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="02869" name="JTAG" version="">
          <instance name="JTAG">
            <register-group address-space="periph_pb1b" name="JTAG" name-in-module="JTAG" offset="0x1f812000"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="01471" name="LVD" version="">
          <instance name="LVD">
            <register-group address-space="periph_pb1a" name="LVD" name-in-module="LVD" offset="0x1f801400"/>
            <parameters>
              <param name=""/>
            </parameters>
          </instance>
        </module>
        <module id="03140" name="NVM" version="">
          <instance name="NVM">
            <register-group address-space="periph_pb1a" name="NVM" name-in-module="NVM" offset="0x1f800600"/>
            <parameters>
              <param name="PAGE_SIZE" value="4096"/>
              <param name="ROW_SIZE" value="1024"/>
            </parameters>
          </instance>
        </module>
        <module id="00749" name="OCMP" version="">
          <instance name="OCMP1">
            <register-group address-space="periph_pb3" name="OCMP" name-in-module="OCMP" offset="0x1f842000"/>
            <parameters>
              <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
              <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
              <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
              <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
            </parameters>
          </instance>
          <instance name="OCMP2">
            <parameters>
              <param name="TMR_SRC_0" value="0" caption="Timer 2"/>
              <param name="TMR_SRC_1" value="1" caption="Timer 3"/>
              <param name="TMR_ALTERNATE_SRC_0" value="0" caption="Timer 4"/>
              <param name="TMR_ALTERNATE_SRC_1" value="1" caption="Timer 5"/>
            </parameters>
          </instance>
