Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="ADC Control Register 3" name="ADCCON3" offset="0x20" rw="RW" size="4">
          <bitfield caption="Analog Input Select bits" mask="0x0000003F" name="ADINSEL" values="ADCCON3__ADINSEL"/>
          <bitfield caption="Global Software Trigger bit" mask="0x00000040" name="GSWTRG" values="ADCCON3__GSWTRG"/>
          <bitfield caption="Global Level Software Trigger bit" mask="0x00000080" name="GLSWTRG" values="ADCCON3__GLSWTRG"/>
          <bitfield caption="Individual ADC Input Conversion Request bit" mask="0x00000100" name="RQCNVRT" values="ADCCON3__RQCNVRT"/>
          <bitfield caption="Class 2 and Class 3 Analog Input Sampling Enable bit" mask="0x00000200" name="SAMP" values="ADCCON3__SAMP"/>
          <bitfield caption="ADC Update Ready Status bit" mask="0x00000400" name="UPDRDY" values="ADCCON3__UPDRDY"/>
          <bitfield caption="Update Ready Interrupt Enable bit" mask="0x00000800" name="UPDIEN" values="ADCCON3__UPDIEN"/>
          <bitfield caption="Trigger Suspend bit" mask="0x00001000" name="TRGSUSP" values="ADCCON3__TRGSUSP"/>
          <bitfield caption="Voltage Reference Input Selection bits" mask="0x0000E000" name="VREFSEL" values="ADCCON3__VREFSEL"/>
          <bitfield caption="ADC0 Digital Enable bit" mask="0x00010000" name="DIGEN0" values="ADCCON3__DIGEN0"/>
          <bitfield caption="Shared ADC Digital Enable bit" mask="0x00800000" name="DIGEN7" values="ADCCON3__DIGEN7"/>
          <bitfield caption="Analog-to-Digital Control Clock Divider bits" mask="0x3F000000" name="CONCLKDIV" values="ADCCON3__CONCLKDIV"/>
          <bitfield caption="Analog-to-Digital Clock Source bits" mask="0xC0000000" name="ADCSEL" values="ADCCON3__ADCSEL"/>
        </register>
        <register caption="ADC Triggering Mode for Dedicated ADC Register" name="ADCTRGMODE" offset="0x30" rw="RW" size="4">
          <bitfield caption="ADC0 Synchronous Sampling bit" mask="0x00000001" name="SSAMPEN0" values="ADCTRGMODE__SSAMPEN0"/>
          <bitfield caption="ADC0 Presynchronized Triggers bit" mask="0x00000100" name="STRGEN0" values="ADCTRGMODE__STRGEN0"/>
          <bitfield caption="ADC0 Analog Input Select bit" mask="0x00030000" name="SH0ALT" values="ADCTRGMODE__SH0ALT"/>
        </register>
        <register caption="ADC Input Mode Control Register 1" name="ADCIMCON1" offset="0x40" rw="RW" size="4">
          <bitfield caption="AN0 Signed Data Mode bit" mask="0x00000001" name="SIGN0" values="ADCIMCON1__SIGN0"/>
          <bitfield caption="AN0 Mode bit" mask="0x00000002" name="DIFF0" values="ADCIMCON1__DIFF0"/>
          <bitfield caption="AN1 Signed Data Mode bit" mask="0x00000004" name="SIGN1" values="ADCIMCON1__SIGN1"/>
          <bitfield caption="AN1 Mode bit" mask="0x00000008" name="DIFF1" values="ADCIMCON1__DIFF1"/>
          <bitfield caption="AN2 Signed Data Mode bit" mask="0x00000010" name="SIGN2" values="ADCIMCON1__SIGN2"/>
          <bitfield caption="AN2 Mode bit" mask="0x00000020" name="DIFF2" values="ADCIMCON1__DIFF2"/>
          <bitfield caption="AN3 Signed Data Mode bit" mask="0x00000040" name="SIGN3" values="ADCIMCON1__SIGN3"/>
          <bitfield caption="AN3 Mode bit" mask="0x00000080" name="DIFF3" values="ADCIMCON1__DIFF3"/>
          <bitfield caption="AN4 Signed Data Mode bit" mask="0x00000100" name="SIGN4" values="ADCIMCON1__SIGN4"/>
          <bitfield caption="AN4 Mode bit" mask="0x00000200" name="DIFF4" values="ADCIMCON1__DIFF4"/>
          <bitfield caption="AN5 Signed Data Mode bit" mask="0x00000400" name="SIGN5" values="ADCIMCON1__SIGN5"/>
          <bitfield caption="AN5 Mode bit" mask="0x00000800" name="DIFF5" values="ADCIMCON1__DIFF5"/>
          <bitfield caption="AN6 Signed Data Mode bit" mask="0x00001000" name="SIGN6" values="ADCIMCON1__SIGN6"/>
          <bitfield caption="AN6 Mode bit" mask="0x00002000" name="DIFF6" values="ADCIMCON1__DIFF6"/>
          <bitfield caption="AN7 Signed Data Mode bit" mask="0x00004000" name="SIGN7" values="ADCIMCON1__SIGN7"/>
          <bitfield caption="AN7 Mode bit" mask="0x00008000" name="DIFF7" values="ADCIMCON1__DIFF7"/>
          <bitfield caption="AN8 Signed Data Mode bit" mask="0x00010000" name="SIGN8" values="ADCIMCON1__SIGN8"/>
          <bitfield caption="AN 8 Mode bit" mask="0x00020000" name="DIFF8" values="ADCIMCON1__DIFF8"/>
          <bitfield caption="AN9 Signed Data Mode bit" mask="0x00040000" name="SIGN9" values="ADCIMCON1__SIGN9"/>
          <bitfield caption="AN9 Mode bit" mask="0x00080000" name="DIFF9" values="ADCIMCON1__DIFF9"/>
          <bitfield caption="AN10 Signed Data Mode bit" mask="0x00100000" name="SIGN10" values="ADCIMCON1__SIGN10"/>
          <bitfield caption="AN10 Mode bit" mask="0x00200000" name="DIFF10" values="ADCIMCON1__DIFF10"/>
          <bitfield caption="AN11 Signed Data Mode bit" mask="0x00400000" name="SIGN11" values="ADCIMCON1__SIGN11"/>
          <bitfield caption="AN11 Mode bit" mask="0x00800000" name="DIFF11" values="ADCIMCON1__DIFF11"/>
          <bitfield caption="AN12 Signed Data Mode bit" mask="0x01000000" name="SIGN12" values="ADCIMCON1__SIGN12"/>
          <bitfield caption="AN12 Mode bit" mask="0x02000000" name="DIFF12" values="ADCIMCON1__DIFF12"/>
          <bitfield caption="AN13 Signed Data Mode bit" mask="0x04000000" name="SIGN13" values="ADCIMCON1__SIGN13"/>
          <bitfield caption="AN13 Mode bit" mask="0x08000000" name="DIFF13" values="ADCIMCON1__DIFF13"/>
          <bitfield caption="AN14 Signed Data Mode bit" mask="0x10000000" name="SIGN14" values="ADCIMCON1__SIGN14"/>
          <bitfield caption="AN14 Mode bit" mask="0x20000000" name="DIFF14" values="ADCIMCON1__DIFF14"/>
          <bitfield caption="AN15 Signed Data Mode bit" mask="0x40000000" name="SIGN15" values="ADCIMCON1__SIGN15"/>
          <bitfield caption="AN15 Mode bit" mask="0x80000000" name="DIFF15" values="ADCIMCON1__DIFF15"/>
        </register>
        <register caption="ADC Input Mode Control Register 2" name="ADCIMCON2" offset="0x50" rw="RW" size="4">
          <bitfield caption="AN16 Signed Data Mode bit" mask="0x00000001" name="SIGN16" values="ADCIMCON2__SIGN16"/>
          <bitfield caption="AN16 Mode bit" mask="0x00000002" name="DIFF16" values="ADCIMCON2__DIFF16"/>
          <bitfield caption="AN17 Signed Data Mode bit" mask="0x00000004" name="SIGN17" values="ADCIMCON2__SIGN17"/>
          <bitfield caption="AN17 Mode bit" mask="0x00000008" name="DIFF17" values="ADCIMCON2__DIFF17"/>
          <bitfield caption="AN18 Signed Data Mode bit" mask="0x00000010" name="SIGN18" values="ADCIMCON2__SIGN18"/>
          <bitfield caption="AN18 Mode bit" mask="0x00000020" name="DIFF18" values="ADCIMCON2__DIFF18"/>
          <bitfield caption="AN19 Signed Data Mode bit" mask="0x00000040" name="SIGN19" values="ADCIMCON2__SIGN19"/>
          <bitfield caption="AN19 Mode bit" mask="0x00000080" name="DIFF19" values="ADCIMCON2__DIFF19"/>
        </register>
        <register caption="ADC Global Interrupt Enable Register 1" name="ADCGIRQEN1" offset="0x80" rw="RW" size="4">
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 0" mask="0x00000001" name="AGIEN0" values="ADCGIRQEN1__AGIEN0"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 1" mask="0x00000002" name="AGIEN1" values="ADCGIRQEN1__AGIEN1"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 2" mask="0x00000004" name="AGIEN2" values="ADCGIRQEN1__AGIEN2"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 3" mask="0x00000008" name="AGIEN3" values="ADCGIRQEN1__AGIEN3"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 4" mask="0x00000010" name="AGIEN4" values="ADCGIRQEN1__AGIEN4"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 5" mask="0x00000020" name="AGIEN5" values="ADCGIRQEN1__AGIEN5"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 6" mask="0x00000040" name="AGIEN6" values="ADCGIRQEN1__AGIEN6"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 7" mask="0x00000080" name="AGIEN7" values="ADCGIRQEN1__AGIEN7"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 8" mask="0x00000100" name="AGIEN8" values="ADCGIRQEN1__AGIEN8"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 9" mask="0x00000200" name="AGIEN9" values="ADCGIRQEN1__AGIEN9"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 10" mask="0x00000400" name="AGIEN10" values="ADCGIRQEN1__AGIEN10"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 11" mask="0x00000800" name="AGIEN11" values="ADCGIRQEN1__AGIEN11"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 12" mask="0x00001000" name="AGIEN12" values="ADCGIRQEN1__AGIEN12"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 13" mask="0x00002000" name="AGIEN13" values="ADCGIRQEN1__AGIEN13"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 14" mask="0x00004000" name="AGIEN14" values="ADCGIRQEN1__AGIEN14"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 15" mask="0x00008000" name="AGIEN15" values="ADCGIRQEN1__AGIEN15"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 16" mask="0x00010000" name="AGIEN16" values="ADCGIRQEN1__AGIEN16"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 17" mask="0x00020000" name="AGIEN17" values="ADCGIRQEN1__AGIEN17"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 18" mask="0x00040000" name="AGIEN18" values="ADCGIRQEN1__AGIEN18"/>
          <bitfield caption="ADC Global Interrupt Enable bits for analog input 19" mask="0x00080000" name="AGIEN19" values="ADCGIRQEN1__AGIEN19"/>
        </register>
