Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Capacitor Voltage Divider Setting bit" name="ADCCON2__CVDCPL">
        <value caption="7 * 2.5 pF = 17.5 pF" name="" value="0x7"/>
        <value caption="6 * 2.5 pF = 15 pF" name="" value="0x6"/>
        <value caption="5 * 2.5 pF = 12.5 pF" name="" value="0x5"/>
        <value caption="4 * 2.5 pF = 10 pF" name="" value="0x4"/>
        <value caption="3 * 2.5 pF = 7.5 pF" name="" value="0x3"/>
        <value caption="2 * 2.5 pF = 5 pF" name="" value="0x2"/>
        <value caption="1 * 2.5 pF = 2.5 pF" name="" value="0x1"/>
        <value caption="0 * 2.5 pF = 0 pF" name="" value="0x0"/>
      </value-group>
      <value-group caption="End of Scan Interrupt Status bit" name="ADCCON2__EOSRDY">
        <value caption="All analog inputs are considered for scanning through the scan trigger (all analog inputs specified in the ADCCSS1 and ADCCSS2 registers) have completed scanning" name="" value="0x1"/>
        <value caption="Scanning has not completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Band Gap/ Vref / AVdd BOR Fault Status bit" name="ADCCON2__REFFLT">
        <value caption="Fault in band gap or the Vref voltage while the ON bit (ADCCON1) was set. Most likely a band gap orVref fault will be caused by a BOR of the analog Vdd supply." name="" value="0x1"/>
        <value caption="Band gap and Vref voltage are working properly" name="" value="0x0"/>
      </value-group>
      <value-group caption="Band Gap Voltage/ADC Reference Voltage Status bit" name="ADCCON2__BGVRRDY">
        <value caption="Both band gap voltage and ADC reference voltages (Vref) are ready" name="" value="0x1"/>
        <value caption="Either or both band gap voltage and ADC reference voltages (Vref) are not ready" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Input Select bits" name="ADCCON3__ADINSEL">
        <value caption="Reserved" name="" value="0x3f"/>
        <value caption="Reserved" name="" value="0x2d"/>
        <value caption="MAX_AN_INPUT + 2 = IVTEMP" name="" value="0x2c"/>
        <value caption="MAX_AN_INPUT + 1 = IVREF" name="" value="0x2b"/>
        <value caption="MAX_AN_INPUT = AN[MAX_AN_INPUT]" name="" value="0x2a"/>
        <value caption="AN1" name="" value="0x1"/>
        <value caption="AN0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Global Software Trigger bit" name="ADCCON3__GSWTRG">
        <value caption="Trigger conversion for ADC inputs that have selected the GSWTRG bit as the trigger signal" name="" value="0x1"/>
        <value caption="Do not trigger an analog-to-digital conversion" name="" value="0x0"/>
      </value-group>
      <value-group caption="Global Level Software Trigger bit" name="ADCCON3__GLSWTRG">
        <value caption="Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal" name="" value="0x1"/>
        <value caption="Do not trigger an analog-to-digital conversion" name="" value="0x0"/>
      </value-group>
      <value-group caption="Individual ADC Input Conversion Request bit" name="ADCCON3__RQCNVRT">
        <value caption="Trigger the conversion of the selected ADC input as specified by the ADINSEL bits" name="" value="0x1"/>
        <value caption="Do not trigger the conversion" name="" value="0x0"/>
      </value-group>
      <value-group caption="Class 2 and Class 3 Analog Input Sampling Enable bit" name="ADCCON3__SAMP">
        <value caption="The ADC S&amp;H amplifier is sampling" name="" value="0x1"/>
        <value caption="The ADC S&amp;H amplifier is holding" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Update Ready Status bit" name="ADCCON3__UPDRDY">
        <value caption="ADC SFRs can be updated" name="" value="0x1"/>
        <value caption="ADC SFRs cannot be updated" name="" value="0x0"/>
      </value-group>
      <value-group caption="Update Ready Interrupt Enable bit" name="ADCCON3__UPDIEN">
        <value caption="Interrupt will be generated when the UPDRDY bit is set by hardware" name="" value="0x1"/>
        <value caption="No interrupt is generated" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trigger Suspend bit" name="ADCCON3__TRGSUSP">
        <value caption="Triggers are blocked from starting a new analog-to-digital conversion" name="" value="0x1"/>
        <value caption="Triggers are not blocked" name="" value="0x0"/>
      </value-group>
      <value-group caption="Voltage Reference Input Selection bits" name="ADCCON3__VREFSEL">
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="Reserved" name="" value="0x6"/>
        <value caption="Reserved" name="" value="0x5"/>
        <value caption="Reserved" name="" value="0x4"/>
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="Reserved" name="" value="0x2"/>
        <value caption="Reserved" name="" value="0x1"/>
        <value caption="External AVDD and AVSS" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Digital Enable bit" name="ADCCON3__DIGEN0">
        <value caption="ADC0 is digital enabled" name="" value="0x1"/>
        <value caption="ADC0 is digital disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shared ADC Digital Enable bit" name="ADCCON3__DIGEN7">
        <value caption="ADC7 is digital enabled" name="" value="0x1"/>
        <value caption="ADC7 is digital disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog-to-Digital Control Clock Divider bits" name="ADCCON3__CONCLKDIV">
        <value caption="64 * Tclk = Tq" name="" value="0x3f"/>
        <value caption="4 * Tclk = Tq" name="" value="0x3"/>
        <value caption="3 * Tclk = Tq" name="" value="0x2"/>
        <value caption="2 * Tclk = Tq" name="" value="0x1"/>
        <value caption="Tclk = Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog-to-Digital Clock Source bits" name="ADCCON3__ADCSEL">
        <value caption="System Clock (Tcy)" name="" value="0x3"/>
        <value caption="REFCLK3" name="" value="0x2"/>
        <value caption="FRC" name="" value="0x1"/>
        <value caption="PBCLK2" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Synchronous Sampling bit" name="ADCTRGMODE__SSAMPEN0">
        <value caption="ADC0 uses synchronous sampling for the first sample after being idle or disabled" name="" value="0x1"/>
        <value caption="ADC0 does not use synchronous sampling" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC0 Presynchronized Triggers bit" name="ADCTRGMODE__STRGEN0">
        <value caption="ADC0 uses presynchronized triggers" name="" value="0x1"/>
        <value caption="ADC0 does not use presynchronized triggers" name="" value="0x0"/>
      </value-group>
