Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="ADC0 Analog Input Select bit" name="ADCTRGMODE__SH0ALT">
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="ANB0" name="" value="0x2"/>
        <value caption="ANA0" name="" value="0x1"/>
        <value caption="AN0" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN0 Signed Data Mode bit" name="ADCIMCON1__SIGN0">
        <value caption="AN0 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN0 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN0 Mode bit" name="ADCIMCON1__DIFF0">
        <value caption="AN0 is using Differential mode" name="" value="0x1"/>
        <value caption="AN0 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN1 Signed Data Mode bit" name="ADCIMCON1__SIGN1">
        <value caption="AN1 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN1 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN1 Mode bit" name="ADCIMCON1__DIFF1">
        <value caption="AN1 is using Differential mode" name="" value="0x1"/>
        <value caption="AN1 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN2 Signed Data Mode bit" name="ADCIMCON1__SIGN2">
        <value caption="AN2 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN2 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN2 Mode bit" name="ADCIMCON1__DIFF2">
        <value caption="AN2 is using Differential mode" name="" value="0x1"/>
        <value caption="AN2 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN3 Signed Data Mode bit" name="ADCIMCON1__SIGN3">
        <value caption="AN3 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN3 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN3 Mode bit" name="ADCIMCON1__DIFF3">
        <value caption="AN3 is using Differential mode" name="" value="0x1"/>
        <value caption="AN3 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN4 Signed Data Mode bit" name="ADCIMCON1__SIGN4">
        <value caption="AN4 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN4 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN4 Mode bit" name="ADCIMCON1__DIFF4">
        <value caption="AN4 is using Differential mode" name="" value="0x1"/>
        <value caption="AN4 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN5 Signed Data Mode bit" name="ADCIMCON1__SIGN5">
        <value caption="AN5 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN5 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN5 Mode bit" name="ADCIMCON1__DIFF5">
        <value caption="AN5 is using Differential mode" name="" value="0x1"/>
        <value caption="AN5 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN6 Signed Data Mode bit" name="ADCIMCON1__SIGN6">
        <value caption="AN6 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN6 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN6 Mode bit" name="ADCIMCON1__DIFF6">
        <value caption="AN6 is using Differential mode" name="" value="0x1"/>
        <value caption="AN6 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN7 Signed Data Mode bit" name="ADCIMCON1__SIGN7">
        <value caption="AN7 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN7 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN7 Mode bit" name="ADCIMCON1__DIFF7">
        <value caption="AN7 is using Differential mode" name="" value="0x1"/>
        <value caption="AN7 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN8 Signed Data Mode bit" name="ADCIMCON1__SIGN8">
        <value caption="AN8 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN8 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN 8 Mode bit" name="ADCIMCON1__DIFF8">
        <value caption="AN8 is using Differential mode" name="" value="0x1"/>
        <value caption="AN8 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN9 Signed Data Mode bit" name="ADCIMCON1__SIGN9">
        <value caption="AN9 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN9 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN9 Mode bit" name="ADCIMCON1__DIFF9">
        <value caption="AN9 is using Differential mode" name="" value="0x1"/>
        <value caption="AN9 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN10 Signed Data Mode bit" name="ADCIMCON1__SIGN10">
        <value caption="AN10 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN10 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN10 Mode bit" name="ADCIMCON1__DIFF10">
        <value caption="AN10 is using Differential mode" name="" value="0x1"/>
        <value caption="AN10 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN11 Signed Data Mode bit" name="ADCIMCON1__SIGN11">
        <value caption="AN11 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN11 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN11 Mode bit" name="ADCIMCON1__DIFF11">
        <value caption="AN11 is using Differential mode" name="" value="0x1"/>
        <value caption="AN11 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
