Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="AN12 Signed Data Mode bit" name="ADCIMCON1__SIGN12">
        <value caption="AN12 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN12 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN12 Mode bit" name="ADCIMCON1__DIFF12">
        <value caption="AN12 is using Differential mode" name="" value="0x1"/>
        <value caption="AN12 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN13 Signed Data Mode bit" name="ADCIMCON1__SIGN13">
        <value caption="AN13 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN13 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN13 Mode bit" name="ADCIMCON1__DIFF13">
        <value caption="AN13 is using Differential mode" name="" value="0x1"/>
        <value caption="AN13 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN14 Signed Data Mode bit" name="ADCIMCON1__SIGN14">
        <value caption="AN14 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN14 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN14 Mode bit" name="ADCIMCON1__DIFF14">
        <value caption="AN14 is using Differential mode" name="" value="0x1"/>
        <value caption="AN14 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN15 Signed Data Mode bit" name="ADCIMCON1__SIGN15">
        <value caption="AN15 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN15 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN15 Mode bit" name="ADCIMCON1__DIFF15">
        <value caption="AN15 is using Differential mode" name="" value="0x1"/>
        <value caption="AN15 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN16 Signed Data Mode bit" name="ADCIMCON2__SIGN16">
        <value caption="AN16 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN16 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN16 Mode bit" name="ADCIMCON2__DIFF16">
        <value caption="AN16 is using Differential mode" name="" value="0x1"/>
        <value caption="AN16 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN17 Signed Data Mode bit" name="ADCIMCON2__SIGN17">
        <value caption="AN17 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN17 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN17 Mode bit" name="ADCIMCON2__DIFF17">
        <value caption="AN17 is using Differential mode" name="" value="0x1"/>
        <value caption="AN17 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN18 Signed Data Mode bit" name="ADCIMCON2__SIGN18">
        <value caption="AN18 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN18 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN18 Mode bit" name="ADCIMCON2__DIFF18">
        <value caption="AN18 is using Differential mode" name="" value="0x1"/>
        <value caption="AN18 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN19 Signed Data Mode bit" name="ADCIMCON2__SIGN19">
        <value caption="AN19 is using Signed Data mode" name="" value="0x1"/>
        <value caption="AN19 is using Unsigned Data mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="AN19 Mode bit" name="ADCIMCON2__DIFF19">
        <value caption="AN19 is using Differential mode" name="" value="0x1"/>
        <value caption="AN19 is using Single-ended mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 0" name="ADCGIRQEN1__AGIEN0">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 1" name="ADCGIRQEN1__AGIEN1">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 2" name="ADCGIRQEN1__AGIEN2">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 3" name="ADCGIRQEN1__AGIEN3">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 4" name="ADCGIRQEN1__AGIEN4">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 5" name="ADCGIRQEN1__AGIEN5">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
