Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="ADC Global Interrupt Enable bits for analog input 6" name="ADCGIRQEN1__AGIEN6">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 7" name="ADCGIRQEN1__AGIEN7">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 8" name="ADCGIRQEN1__AGIEN8">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 9" name="ADCGIRQEN1__AGIEN9">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 10" name="ADCGIRQEN1__AGIEN10">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 11" name="ADCGIRQEN1__AGIEN11">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 12" name="ADCGIRQEN1__AGIEN12">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 13" name="ADCGIRQEN1__AGIEN13">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 14" name="ADCGIRQEN1__AGIEN14">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 15" name="ADCGIRQEN1__AGIEN15">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 16" name="ADCGIRQEN1__AGIEN16">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 17" name="ADCGIRQEN1__AGIEN17">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 18" name="ADCGIRQEN1__AGIEN18">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ADC Global Interrupt Enable bits for analog input 19" name="ADCGIRQEN1__AGIEN19">
        <value caption="Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the ARDYx bit (x = 31-0) of the ADCDSTAT1 register)" name="" value="0x1"/>
        <value caption="Interrupts are disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 0" name="ADCCSS1__CSS0">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 1" name="ADCCSS1__CSS1">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 2" name="ADCCSS1__CSS2">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 3" name="ADCCSS1__CSS3">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
