Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Analog Common Scan Select bits 4" name="ADCCSS1__CSS4">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 5" name="ADCCSS1__CSS5">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 6" name="ADCCSS1__CSS6">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 7" name="ADCCSS1__CSS7">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 8" name="ADCCSS1__CSS8">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 9" name="ADCCSS1__CSS9">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 10" name="ADCCSS1__CSS10">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 11" name="ADCCSS1__CSS11">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 12" name="ADCCSS1__CSS12">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 13" name="ADCCSS1__CSS13">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 14" name="ADCCSS1__CSS14">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 15" name="ADCCSS1__CSS15">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 16" name="ADCCSS1__CSS16">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 17" name="ADCCSS1__CSS17">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 18" name="ADCCSS1__CSS18">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Analog Common Scan Select bits 19" name="ADCCSS1__CSS19">
        <value caption="Select ANx for input scan" name="" value="0x1"/>
        <value caption="Skip ANx for input scan" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 0" name="ADCDSTAT1__ARDY0">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 1" name="ADCDSTAT1__ARDY1">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 2" name="ADCDSTAT1__ARDY2">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 3" name="ADCDSTAT1__ARDY3">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 4" name="ADCDSTAT1__ARDY4">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 5" name="ADCDSTAT1__ARDY5">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
      <value-group caption="Conversion Data Ready for Corresponding Analog Input Ready bit 6" name="ADCDSTAT1__ARDY6">
        <value caption="This bit is set when converted data is ready in the data register" name="" value="0x1"/>
        <value caption="This bit is cleared when the associated data register is read" name="" value="0x0"/>
      </value-group>
