Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="CAN Acceptance Filter " name="C1RXF0" offset="0x140" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF0__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF0__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF0__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF1" offset="0x150" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF1__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF1__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF1__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF2" offset="0x160" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF2__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF2__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF2__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF3" offset="0x170" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF3__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF3__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF3__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF4" offset="0x180" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF4__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF4__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF4__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF5" offset="0x190" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF5__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF5__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF5__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF6" offset="0x1a0" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF6__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF6__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF6__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF7" offset="0x1b0" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF7__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF7__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF7__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF8" offset="0x1c0" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF8__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF8__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF8__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF9" offset="0x1d0" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF9__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF9__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF9__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF10" offset="0x1e0" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF10__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF10__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF10__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF11" offset="0x1f0" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF11__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF11__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF11__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF12" offset="0x200" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF12__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF12__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF12__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF13" offset="0x210" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF13__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF13__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF13__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF14" offset="0x220" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF14__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF14__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF14__SID"/>
        </register>
        <register caption="CAN Acceptance Filter " name="C1RXF15" offset="0x230" rw="RW" size="4">
          <bitfield caption="Extended Identifier bits" mask="0x0003FFFF" name="EID" values="C1RXF15__EID"/>
          <bitfield caption="Extended Identifier Enable bits" mask="0x00080000" name="EXID" values="C1RXF15__EXID"/>
          <bitfield caption="Standard Identifier bits" mask="0xFFE00000" name="SID" values="C1RXF15__SID"/>
        </register>
        <register caption="CAN Message Buffer Base Address Register" name="C1FIFOBA" offset="0x340" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOBA"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON0" offset="0x350" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON0__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON0__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON0__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON0__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON0__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON0__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON0__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON0__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON0__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON0__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON0__FSIZE"/>
        </register>
