Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="CAN Module Message Index Register " name="C1FIFOCI5" offset="0x4c0" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON6" offset="0x4d0" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON6__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON6__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON6__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON6__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON6__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON6__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON6__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON6__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON6__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON6__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON6__FSIZE"/>
        </register>
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT6" offset="0x4e0" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT6__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT6__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT6__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT6__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT6__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT6__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT6__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT6__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT6__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT6__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT6__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT6__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT6__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT6__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA6" offset="0x4f0" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
        <register caption="CAN Module Message Index Register " name="C1FIFOCI6" offset="0x500" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON7" offset="0x510" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON7__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON7__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON7__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON7__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON7__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON7__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON7__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON7__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON7__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON7__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON7__FSIZE"/>
        </register>
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT7" offset="0x520" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT7__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT7__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT7__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT7__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT7__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT7__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT7__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT7__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT7__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT7__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT7__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT7__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT7__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT7__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA7" offset="0x530" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
        <register caption="CAN Module Message Index Register " name="C1FIFOCI7" offset="0x540" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON8" offset="0x550" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON8__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON8__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON8__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON8__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON8__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON8__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON8__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON8__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON8__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON8__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON8__FSIZE"/>
        </register>
        <register caption="CAN FIFO Interrupt Register " name="C1FIFOINT8" offset="0x560" rw="RW" size="4">
          <bitfield caption="Receive Buffer Not Empty Interrupt Flag bit" mask="0x00000001" name="RXNEMPTYIF" values="C1FIFOINT8__RXNEMPTYIF"/>
          <bitfield caption="Receive FIFO Half Full Interrupt Flag bit" mask="0x00000002" name="RXHALFIF" values="C1FIFOINT8__RXHALFIF"/>
          <bitfield caption="Receive FIFO Full Interrupt Flag bit" mask="0x00000004" name="RXFULLIF" values="C1FIFOINT8__RXFULLIF"/>
          <bitfield caption="Receive FIFO Overflow Interrupt Flag bit" mask="0x00000008" name="RXOVFLIF" values="C1FIFOINT8__RXOVFLIF"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Flag bit" mask="0x00000100" name="TXEMPTYIF" values="C1FIFOINT8__TXEMPTYIF"/>
          <bitfield caption="FIFO Transmit FIFO Half Empty Interrupt Flag bit" mask="0x00000200" name="TXHALFIF" values="C1FIFOINT8__TXHALFIF"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Flag bit" mask="0x00000400" name="TXNFULLIF" values="C1FIFOINT8__TXNFULLIF"/>
          <bitfield caption="Empty Interrupt Enable bit" mask="0x00010000" name="RXNEMPTYIE" values="C1FIFOINT8__RXNEMPTYIE"/>
          <bitfield caption="FIFO Half Full Interrupt Enable bit" mask="0x00020000" name="RXHALFIE" values="C1FIFOINT8__RXHALFIE"/>
          <bitfield caption="Full Interrupt Enable bit" mask="0x00040000" name="RXFULLIE" values="C1FIFOINT8__RXFULLIE"/>
          <bitfield caption="Overflow Interrupt Enable bit" mask="0x00080000" name="RXOVFLIE" values="C1FIFOINT8__RXOVFLIE"/>
          <bitfield caption="Transmit FIFO Empty Interrupt Enable bit" mask="0x01000000" name="TXEMPTYIE" values="C1FIFOINT8__TXEMPTYIE"/>
          <bitfield caption="Transmit FIFO Half Full Interrupt Enable bit" mask="0x02000000" name="TXHALFIE" values="C1FIFOINT8__TXHALFIE"/>
          <bitfield caption="Transmit FIFO Not Full Interrupt Enable bit" mask="0x04000000" name="TXNFULLIE" values="C1FIFOINT8__TXNFULLIE"/>
        </register>
        <register caption="CAN FIFO User Address Register " name="C1FIFOUA8" offset="0x570" rw="R" size="4">
          <bitfield mask="0xFFFFFFFC" name="FIFOUA"/>
        </register>
        <register caption="CAN Module Message Index Register " name="C1FIFOCI8" offset="0x580" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CFIFOCI"/>
        </register>
        <register caption="CAN FIFO Control Register " name="C1FIFOCON9" offset="0x590" rw="RW" size="4">
          <bitfield caption="Message Transmit Priority bits" mask="0x00000003" name="TXPRI" values="C1FIFOCON9__TXPRI"/>
          <bitfield caption="Auto RTR Enable bit" mask="0x00000004" name="RTREN" values="C1FIFOCON9__RTREN"/>
          <bitfield caption="Message Send Request" mask="0x00000008" name="TXREQ" values="C1FIFOCON9__TXREQ"/>
          <bitfield caption="Error Detected During Transmission bit" mask="0x00000010" name="TXERR" values="C1FIFOCON9__TXERR"/>
          <bitfield caption="Message Lost Arbitration bit" mask="0x00000020" name="TXLARB" values="C1FIFOCON9__TXLARB"/>
          <bitfield caption="Message Aborted bit" mask="0x00000040" name="TXABAT" values="C1FIFOCON9__TXABAT"/>
          <bitfield caption="TX/RX Buffer Selection bit" mask="0x00000080" name="TXEN" values="C1FIFOCON9__TXEN"/>
          <bitfield caption="Store Message Data Only bit" mask="0x00001000" name="DONLY" values="C1FIFOCON9__DONLY"/>
          <bitfield caption="Increment Head/Tail bit" mask="0x00002000" name="UINC" values="C1FIFOCON9__UINC"/>
          <bitfield caption="FIFO Reset bits" mask="0x00004000" name="FRESET" values="C1FIFOCON9__FRESET"/>
          <bitfield caption="FIFO Size bits" mask="0x001F0000" name="FSIZE" values="C1FIFOCON9__FSIZE"/>
        </register>
