Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Filter 11 Mask Select bits" name="C1FLTCON2__MSEL11">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 11 Enable bit" name="C1FLTCON2__FLTEN11">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON3__FSEL12">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 12 Mask Select bits" name="C1FLTCON3__MSEL12">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 12 Enable bit" name="C1FLTCON3__FLTEN12">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON3__FSEL13">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 13 Mask Select bits" name="C1FLTCON3__MSEL13">
        <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
        <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
        <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
        <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 13 Enable bit" name="C1FLTCON3__FLTEN13">
        <value caption="Filter is enabled" name="" value="0x1"/>
        <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON3__FSEL14">
        <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
        <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
        <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
        <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
        <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
        <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
        <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
        <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
        <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
        <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
        <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
        <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
        <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
        <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
        <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
        <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
