Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="CAN Time Stamp Control Register" name="CFD2TSCON" offset="0x14" rw="RW" size="4">
          <bitfield caption="CAN Time Base Counter Prescaler bits" mask="0x000003FF" name="TBCPRE" values="CFD2TSCON__TBCPRE"/>
          <bitfield caption="Time Base Counter Enable bit" mask="0x00010000" name="TBCEN" values="CFD2TSCON__TBCEN"/>
          <bitfield caption="Time Stamp EOF bit" mask="0x00020000" name="TSEOF" values="CFD2TSCON__TSEOF"/>
          <bitfield caption="Time Stamp Resolution bit" mask="0x00040000" name="TSRES" values="CFD2TSCON__TSRES"/>
        </register>
        <register caption="Interrupt Code Register" name="CFD2VEC" offset="0x18" rw="RW" size="4">
          <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="CFD2VEC__ICODE"/>
          <bitfield caption="Filter Hit Number bits" mask="0x00001F00" name="FILHIT" values="CFD2VEC__FILHIT"/>
          <bitfield caption="Transmit Interrupt Flag Code bits" mask="0x007F0000" name="TXCODE" values="CFD2VEC__TXCODE"/>
          <bitfield caption="Receive Interrupt Flag Code bits" mask="0x7F000000" name="RXCODE" values="CFD2VEC__RXCODE"/>
        </register>
        <register caption="Interrupt Register" name="CFD2INT" offset="0x1c" rw="RW" size="4">
          <bitfield caption="Transmit Object Interrupt Flag bit" mask="0x00000001" name="TXIF" values="CFD2INT__TXIF"/>
          <bitfield caption="Receive Object Interrupt Flag bit" mask="0x00000002" name="RXIF" values="CFD2INT__RXIF"/>
          <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="TBCIF" values="CFD2INT__TBCIF"/>
          <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="CFD2INT__MODIF"/>
          <bitfield caption="Transmit Event FIFO Interrupt Flag bit" mask="0x00000010" name="TEFIF" values="CFD2INT__TEFIF"/>
          <bitfield mask="0x00000100" name="ECCIF"/>
          <bitfield mask="0x00000200" name="SPICRCIF"/>
          <bitfield caption="Transmit Attempt Interrupt Flag bit" mask="0x00000400" name="TXATIF" values="CFD2INT__TXATIF"/>
          <bitfield caption="Receive Object Overflow Interrupt Flag bit" mask="0x00000800" name="RXOVIF" values="CFD2INT__RXOVIF"/>
          <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="CFD2INT__SERRIF"/>
          <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="CFD2INT__CERRIF"/>
          <bitfield caption="Bus Wake Up Activity Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="CFD2INT__WAKIF"/>
          <bitfield caption="Invalid Message Interrupt Flag bit" mask="0x00008000" name="IVMIF" values="CFD2INT__IVMIF"/>
          <bitfield caption="Transmit Object Interrupt Enable bit" mask="0x00010000" name="TXIE" values="CFD2INT__TXIE"/>
          <bitfield caption="Receive Object Interrupt Enable bit" mask="0x00020000" name="RXIE" values="CFD2INT__RXIE"/>
          <bitfield caption="CAN Timer Interrupt Enable bit" mask="0x00040000" name="TBCIE" values="CFD2INT__TBCIE"/>
          <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="CFD2INT__MODIE"/>
          <bitfield caption="Transmit Event FIFO Interrupt Enable bit" mask="0x00100000" name="TEFIE" values="CFD2INT__TEFIE"/>
          <bitfield mask="0x01000000" name="ECCIE"/>
          <bitfield mask="0x02000000" name="SPICRCIE"/>
          <bitfield caption="Transmit Attempt Interrupt Enable bit" mask="0x04000000" name="TXATIE" values="CFD2INT__TXATIE"/>
          <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RXOVIE" values="CFD2INT__RXOVIE"/>
          <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="CFD2INT__SERRIE"/>
          <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="CFD2INT__CERRIE"/>
          <bitfield caption="Bus Wake Up Activity Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="CFD2INT__WAKIE"/>
          <bitfield caption="Invalid Message Interrupt Enable bit" mask="0x80000000" name="IVMIE" values="CFD2INT__IVMIE"/>
        </register>
        <register caption="Receive Interrupt Status Register" name="CFD2RXIF" offset="0x20" rw="RW" size="4">
          <bitfield caption="Receive FIFO Interrupt Pending bits" mask="0xFFFFFFFE" name="RFIF" values="CFD2RXIF__RFIF"/>
        </register>
        <register caption="Transmit Interrupt Status Register" name="CFD2TXIF" offset="0x24" rw="RW" size="4">
          <bitfield caption="Transmit FIFO/Transmit Queue Interrupt Pending bits" mask="0xFFFFFFFF" name="TFIF" values="CFD2TXIF__TFIF"/>
        </register>
        <register caption="Receive Overflow Interrupt Status Register" name="CFD2RXOVIF" offset="0x28" rw="RW" size="4">
          <bitfield caption="Receive FIFO Overflow Interrupt Pending bits" mask="0xFFFFFFFE" name="RFOVIF" values="CFD2RXOVIF__RFOVIF"/>
        </register>
        <register caption="Transmit Attempt Interrupt Status Register" name="CFD2TXATIF" offset="0x2c" rw="RW" size="4">
          <bitfield caption="Transmit FIFO/Transmit Queue Attempt Interrupt Pending bits" mask="0xFFFFFFFF" name="TFATIF" values="CFD2TXATIF__TFATIF"/>
        </register>
        <register caption="Transmit Request Register" name="CFD2TXREQ" offset="0x30" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="TXREQ"/>
        </register>
        <register caption="Transmit/Receive Error Count Register" name="CFD2TREC" offset="0x34" rw="R" size="4">
          <bitfield caption="Receive Error Counter bits" mask="0x000000FF" name="RERRCNT" values="CFD2TREC__RERRCNT"/>
          <bitfield caption="Transmit Error Counter bits" mask="0x0000FF00" name="TERRCNT" values="CFD2TREC__TERRCNT"/>
          <bitfield caption="Transmitter or Receiver is in Error State Warning bit" mask="0x00010000" name="EWARN" values="CFD2TREC__EWARN"/>
          <bitfield caption="Receiver in Error State Warning bit (128 &gt; RERRCNT &gt; 95)" mask="0x00020000" name="RXWARN" values="CFD2TREC__RXWARN"/>
          <bitfield caption="Transmitter in Error State Warning bit (128 &gt; TERRCNT &gt; 95)" mask="0x00040000" name="TXWARN" values="CFD2TREC__TXWARN"/>
          <bitfield caption="Receiver in Error State Bus Passive bit (RERRCNT &gt; 127)" mask="0x00080000" name="RXBP" values="CFD2TREC__RXBP"/>
          <bitfield caption="Transmitter in Error State Bus Passive bit (TERRCNT &gt; 127)" mask="0x00100000" name="TXBP" values="CFD2TREC__TXBP"/>
          <bitfield caption="Transmitter in Error State Bus Off bit (TERRCNT &gt; 255)" mask="0x00200000" name="TXBO" values="CFD2TREC__TXBO"/>
        </register>
        <register caption="Bus Diagnostics Register 0" name="CFD2BDIAG0" offset="0x38" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="NRERRCNT"/>
          <bitfield mask="0x0000FF00" name="NTERRCNT"/>
          <bitfield mask="0x00FF0000" name="DRERRCNT"/>
          <bitfield mask="0xFF000000" name="DTERRCNT"/>
        </register>
        <register caption="Bus Diagnostics Register " name="CFD2BDIAG1" offset="0x3c" rw="RW" size="4">
          <bitfield caption="Error Free Message Counter Status bits" mask="0x0000FFFF" name="EFMSGCNT" values="CFD2BDIAG1__EFMSGCNT"/>
          <bitfield caption="Nominal Bit Logical 0 Error Status bit" mask="0x00010000" name="NBIT0ERR" values="CFD2BDIAG1__NBIT0ERR"/>
          <bitfield caption="Nominal Bit Logical 1 Error Status bit" mask="0x00020000" name="NBIT1ERR" values="CFD2BDIAG1__NBIT1ERR"/>
          <bitfield caption="Not Acknowledged Error Status bit" mask="0x00040000" name="NACKERR" values="CFD2BDIAG1__NACKERR"/>
          <bitfield caption="Nominal Format Error Status bit" mask="0x00080000" name="NFORMERR" values="CFD2BDIAG1__NFORMERR"/>
          <bitfield caption="Nominal Stuffing Error Status bit" mask="0x00100000" name="NSTUFERR" values="CFD2BDIAG1__NSTUFERR"/>
          <bitfield caption="Nominal CRC Error Status bit" mask="0x00200000" name="NCRCERR" values="CFD2BDIAG1__NCRCERR"/>
          <bitfield caption="Transmit Bus Off Error Status bit" mask="0x00800000" name="TXBOERR" values="CFD2BDIAG1__TXBOERR"/>
          <bitfield caption="Data Bit Logical 0 Error Status bit" mask="0x01000000" name="DBIT0ERR" values="CFD2BDIAG1__DBIT0ERR"/>
          <bitfield caption="Data Bit Logical 1 Error Status bit" mask="0x02000000" name="DBIT1ERR" values="CFD2BDIAG1__DBIT1ERR"/>
          <bitfield caption="Data Format Error Status bit" mask="0x08000000" name="DFORMERR" values="CFD2BDIAG1__DFORMERR"/>
          <bitfield caption="Data Stuffing Error Status bit" mask="0x10000000" name="DSTUFERR" values="CFD2BDIAG1__DSTUFERR"/>
          <bitfield caption="Data CRC Error Status bit" mask="0x20000000" name="DCRCERR" values="CFD2BDIAG1__DCRCERR"/>
          <bitfield caption="Error State Indicator (ESI) Flag Status bit" mask="0x40000000" name="ESI" values="CFD2BDIAG1__ESI"/>
          <bitfield caption="Data Length Code (DLC) Mismatch Status bit" mask="0x80000000" name="DLCMM" values="CFD2BDIAG1__DLCMM"/>
        </register>
