Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="Filter Control Registe" name="CFD2FLTCON1" offset="0x114" rw="RW" size="4">
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F4BP" values="CFD2FLTCON1__F4BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN4" values="CFD2FLTCON1__FLTEN4"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F5BP" values="CFD2FLTCON1__F5BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN5" values="CFD2FLTCON1__FLTEN5"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F6BP" values="CFD2FLTCON1__F6BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN6" values="CFD2FLTCON1__FLTEN6"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F7BP" values="CFD2FLTCON1__F7BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN7" values="CFD2FLTCON1__FLTEN7"/>
        </register>
        <register caption="Filter Control Register" name="CFD2FLTCON2" offset="0x118" rw="RW" size="4">
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F8BP" values="CFD2FLTCON2__F8BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN8" values="CFD2FLTCON2__FLTEN8"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F9BP" values="CFD2FLTCON2__F9BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN9" values="CFD2FLTCON2__FLTEN9"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F10BP" values="CFD2FLTCON2__F10BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN10" values="CFD2FLTCON2__FLTEN10"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F11BP" values="CFD2FLTCON2__F11BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN11" values="CFD2FLTCON2__FLTEN11"/>
        </register>
        <register caption="Filter Control Register" name="CFD2FLTCON3" offset="0x11c" rw="RW" size="4">
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F12BP" values="CFD2FLTCON3__F12BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN12" values="CFD2FLTCON3__FLTEN12"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F13BP" values="CFD2FLTCON3__F13BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN13" values="CFD2FLTCON3__FLTEN13"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F14BP" values="CFD2FLTCON3__F14BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN14" values="CFD2FLTCON3__FLTEN14"/>
          <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F15BP" values="CFD2FLTCON3__F15BP"/>
          <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN15" values="CFD2FLTCON3__FLTEN15"/>
        </register>
        <register caption="" name="CFD2FLTOBJ0" offset="0x120" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ0__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ0__EXIDE"/>
        </register>
        <register caption="" name="CFD2MASK0" offset="0x124" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK0__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK0__MIDE"/>
        </register>
        <register caption="Filter Object Registe" name="CFD2FLTOBJ1" offset="0x128" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ1__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ1__EXIDE"/>
        </register>
        <register caption="Filter Object Registe" name="CFD2MASK1" offset="0x12c" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK1__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK1__MIDE"/>
        </register>
        <register caption="Filter Object Register" name="CFD2FLTOBJ2" offset="0x130" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="SID"/>
          <bitfield mask="0x1FFFF800" name="EID"/>
          <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD2FLTOBJ2__SID11"/>
          <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD2FLTOBJ2__EXIDE"/>
        </register>
        <register caption="" name="CFD2MASK2" offset="0x134" rw="RW" size="4">
          <bitfield mask="0x000007FF" name="MSID"/>
          <bitfield mask="0x1FFFF800" name="MEID"/>
          <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD2MASK2__MSID11"/>
          <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD2MASK2__MIDE"/>
        </register>
