Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="FIFO Size bits" name="CFD2FIFOCON6__FSIZE">
        <value caption="FIFO is 32 Messages deep" name="" value="0x1f"/>
        <value caption="FIFO is 31 Messages deep" name="" value="0x1e"/>
        <value caption="FIFO is 30 Messages deep" name="" value="0x1d"/>
        <value caption="FIFO is 29 Messages deep" name="" value="0x1c"/>
        <value caption="FIFO is 28 Messages deep" name="" value="0x1b"/>
        <value caption="FIFO is 27 Messages deep" name="" value="0x1a"/>
        <value caption="FIFO is 26 Messages deep" name="" value="0x19"/>
        <value caption="FIFO is 25 Messages deep" name="" value="0x18"/>
        <value caption="FIFO is 24 Messages deep" name="" value="0x17"/>
        <value caption="FIFO is 23 Messages deep" name="" value="0x16"/>
        <value caption="FIFO is 22 Messages deep" name="" value="0x15"/>
        <value caption="FIFO is 21 Messages deep" name="" value="0x14"/>
        <value caption="FIFO is 20 Messages deep" name="" value="0x13"/>
        <value caption="FIFO is 19 Messages deep" name="" value="0x12"/>
        <value caption="FIFO is 18 Messages deep" name="" value="0x11"/>
        <value caption="FIFO is 17 Messages deep" name="" value="0x10"/>
        <value caption="FIFO is 16 Messages deep" name="" value="0xf"/>
        <value caption="FIFO is 15 Messages deep" name="" value="0xe"/>
        <value caption="FIFO is 14 Messages deep" name="" value="0xd"/>
        <value caption="FIFO is 13 Messages deep" name="" value="0xc"/>
        <value caption="FIFO is 12 Messages deep" name="" value="0xb"/>
        <value caption="FIFO is 11 Messages deep" name="" value="0xa"/>
        <value caption="FIFO is 10 Messages deep" name="" value="0x9"/>
        <value caption="FIFO is 9 Messages deep" name="" value="0x8"/>
        <value caption="FIFO is 8 Messages deep" name="" value="0x7"/>
        <value caption="FIFO is 7 Messages deep" name="" value="0x6"/>
        <value caption="FIFO is 6 Messages deep" name="" value="0x5"/>
        <value caption="FIFO is 5 Messages deep" name="" value="0x4"/>
        <value caption="FIFO is 4 Messages deep" name="" value="0x3"/>
        <value caption="FIFO is 3 Messages deep" name="" value="0x2"/>
        <value caption="FIFO is 2 Messages deep" name="" value="0x1"/>
        <value caption="FIFO is 1 Message deep" name="" value="0x0"/>
      </value-group>
      <value-group caption="Payload Size bits" name="CFD2FIFOCON6__PLSIZE">
        <value caption="64 data bytes" name="" value="0x7"/>
        <value caption="48 data bytes" name="" value="0x6"/>
        <value caption="32 data bytes" name="" value="0x5"/>
        <value caption="24 data bytes" name="" value="0x4"/>
        <value caption="20 data bytes" name="" value="0x3"/>
        <value caption="16 data bytes" name="" value="0x2"/>
        <value caption="12 data bytes" name="" value="0x1"/>
        <value caption="8 data bytes" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" name="CFD2FIFOCON7__TFNRFNIE">
        <value caption="(TXEN is 1) Interrupt enabled for FIFO not full / (TXEN is 0) Interrupt enabled for FIFO not empty" name="" value="0x1"/>
        <value caption="(TXEN is 1) Interrupt disabled for FIFO not full / (TXEN is 0) Interrupt disabled for FIFO not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" name="CFD2FIFOCON7__TFHRFHIE">
        <value caption="(TXEN is 1) Interrupt enabled for FIFO half empty / (TXEN is 0) Interrupt enabled for FIFO half full" name="" value="0x1"/>
        <value caption="(TXEN is 1) Interrupt disabled for FIFO half empty / (TXEN is 0) Interrupt disabled for FIFO half full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit/Receive FIFO Empty/Full Interrupt Enable bit" name="CFD2FIFOCON7__TFERFFIE">
        <value caption="(TXEN is 1) Interrupt enabled for FIFO empty / (TXEN is 0) Interrupt enabled for FIFO full" name="" value="0x1"/>
        <value caption="(TXEN is 1) Interrupt disabled for FIFO empty / (TXEN is 0) Interrupt disabled for FIFO full" name="" value="0x0"/>
      </value-group>
      <value-group caption="Overflow Interrupt Enable bit" name="CFD2FIFOCON7__RXOVIE">
        <value caption="Interrupt enabled for overflow event" name="" value="0x1"/>
        <value caption="Interrupt disabled for overflow event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Attempts Exhausted Interrupt Enable bit" name="CFD2FIFOCON7__TXATIE">
        <value caption="Enable interrupt" name="" value="0x1"/>
        <value caption="Disable interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Received Message Time Stamp Enable bit" name="CFD2FIFOCON7__RXTSEN">
        <value caption="Capture time stamp in received message object in RAM." name="" value="0x1"/>
        <value caption="Dont capture time stamp." name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="CFD2FIFOCON7__RTREN">
        <value caption="When a remote transmit is received" name="" value="0x1"/>
        <value caption="When a remote transmit is received" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX / RX Buffer Selection bit" name="CFD2FIFOCON7__TXEN">
        <value caption="Transmit Message Object" name="" value="0x1"/>
        <value caption="Receive Message Object" name="" value="0x0"/>
      </value-group>
      <value-group caption="Increment Head / Tail bit" name="CFD2FIFOCON7__UINC">
        <value caption="(TXEN is 1) The FIFO head will increment by a single message / (TXEN is 0) The FIFO tail will increment by a single message" name="" value="0x1"/>
        <value caption="(TXEN is 1) The FIFO head will not increment by a single message / (TXEN is 0) The FIFO tail will not increment by a single message" name="" value="0x0"/>
      </value-group>
