Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Exclusive Ethernet PYHY reference clock Enable" name="CFGCON1__ETHEXEREF">
        <value caption="ETH_CLK_OUT will be used as PHY reference clock if needed (Refer IOM)" name="ETH_CLK_OUT" value="0x0"/>
        <value caption="PHY reference clock is made available on ETH_EXCLK_OUT (Refer IOM)" name="PHY" value="0x1"/>
      </value-group>
      <value-group caption="Disable CLASSB Device Functionality" name="CFGCON1__CLASSBDIS">
        <value caption="CLASSB functions enabled" name="ENABLED" value="0x0"/>
        <value caption="CLASSB functions disabled" name="DISABLED" value="0x1"/>
      </value-group>
      <value-group caption="USB USBID Selection bit" name="CFGCON1__USBIDIO">
        <value caption="USBID pin is controlled by the USB Module" name="USB" value="0x1"/>
        <value caption="USBID pin is controlled by the Port Function" name="PORT" value="0x0"/>
      </value-group>
      <value-group caption="USB VBUS_ON Selection bit" name="CFGCON1__VBUSIO">
        <value caption="VBUS_ON pin is controlled by the USB Module" name="USB" value="0x1"/>
        <value caption="VBUS_ON pin is controlled by the Port Function" name="PORT" value="0x0"/>
      </value-group>
      <value-group caption="High Speed Mode Enable (SPI-1)" name="CFGCON1__HSSPIEN">
        <value caption="SPI1 is driven from/to dedicated pins resulting in the highest interface speed" name="DEDICATED_PINS" value="0x1"/>
        <value caption="SPI1 is driven through PPS (I/O remap) resulting in a lower interface speed" name="PPS_PINS" value="0x0"/>
      </value-group>
      <value-group caption="Selects CRU handling of MCLR Control" name="CFGCON1__SMCLR">
        <value caption="Legacy mode (system clear does not reset all state of device)" name="MCLR_NORM" value="0x1"/>
        <value caption="MCLR causes a faux POR" name="MCLR_POR" value="0x0"/>
      </value-group>
      <value-group caption="UART1 High Speed Mode Enable" name="CFGCON1__HSUARTEN">
        <value caption="UART1 is driven from/to dedicated pins resulting in the highest possible maximum baud rate" name="DEDICATED_PINS" value="0x1"/>
        <value caption="UART1 is driven through PPS (I/O remap) resulting in a lower maximum baud rate" name="PPS_PINS" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Post-scale Select Sleep bits" name="CFGCON1__WDTPSS">
        <value caption="1:1048576" name="DIV_1048576" value="0x14"/>
        <value caption="1:524288" name="DIV_524288" value="0x13"/>
        <value caption="1:262144" name="DIV_262144" value="0x12"/>
        <value caption="1:131072" name="DIV_131072" value="0x11"/>
        <value caption="1:65536" name="DIV_65536" value="0x10"/>
        <value caption="1:32768" name="DIV_32768" value="0xf"/>
        <value caption="1:16384" name="DIV_16384" value="0xe"/>
        <value caption="1:8192" name="DIV_8192" value="0xd"/>
        <value caption="1:4096" name="DIV_4096" value="0xc"/>
        <value caption="1:2048" name="DIV_2048" value="0xb"/>
        <value caption="1:1024" name="DIV_1024" value="0xa"/>
        <value caption="1:512" name="DIV_512" value="0x9"/>
        <value caption="1:256" name="DIV_256" value="0x8"/>
        <value caption="1:128" name="DIV_128" value="0x7"/>
        <value caption="1:64" name="DIV_64" value="0x6"/>
        <value caption="1:32" name="DIV_32" value="0x5"/>
        <value caption="1:16" name="DIV_16" value="0x4"/>
        <value caption="1:8" name="DIV_8" value="0x3"/>
        <value caption="1:4" name="DIV_4" value="0x2"/>
        <value caption="1:2" name="DIV_2" value="0x1"/>
        <value caption="1:1" name="DIV_1" value="0x0"/>
      </value-group>
      <value-group caption="Dead Man Timer Count Window Interval bits" name="CFGCON2__DMTINTV">
        <value caption="Window/Interval value is Counter value for cfg_dmt_intv[31-0]" name="DIV1" value="0x0"/>
        <value caption="Window/Interval value is 1/2 Counter value for cfg_dmt_intv[31-0]" name="DIV2" value="0x1"/>
        <value caption="Window/Interval value is 1/4 Counter value for cfg_dmt_intv[31-0]" name="DIV4" value="0x2"/>
        <value caption="Window/Interval value is 1/8 Counter value for cfg_dmt_intv[31-0]" name="DIV8" value="0x3"/>
        <value caption="Window/Interval value is 1/16 Counter value for cfg_dmt_intv[31-0]" name="DIV16" value="0x4"/>
        <value caption="Window/Interval value is 1/32 Counter value for cfg_dmt_intv[31-0]" name="DIV32" value="0x5"/>
        <value caption="Window/Interval value is 1/64 Counter value for cfg_dmt_intv[31-0]" name="DIV64" value="0x6"/>
        <value caption="Window/Interval value is 1/128 Counter value for cfg_dmt_intv[31-0]" name="DIV128" value="0x7"/>
      </value-group>
      <value-group caption="Primary Oscillator Configuration bits" name="CFGCON2__POSCMOD">
        <value caption="Primary oscillator disabled" name="PRI_DISABLED" value="0x3"/>
        <value caption="HS oscillator mode selected" name="HS_OSC" value="0x2"/>
      </value-group>
      <value-group caption="WDT RUN Mode Clock Select" name="CFGCON2__WDTRMCS">
        <value caption="LPRC" name="LPRC" value="0x3"/>
        <value caption="Module PB Clock" name="PB_CLK" value="0x0"/>
      </value-group>
      <value-group caption="SOSC Selection Configuration bit" name="CFGCON2__SOSCSEL">
        <value caption="Crystal (SOSCI/SOSCO) mode" name="SOSCx" value="0x1"/>
        <value caption="Digital (SCLKI) mode" name="SCLKI" value="0x0"/>
      </value-group>
      <value-group caption="2-Speed startup enabled in Sleep mode bit" name="CFGCON2__WAKE2SPD">
        <value caption="When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready" name="FRC" value="0x1"/>
        <value caption="When the device EXITS Sleep Mode, the sys_clk will be from the selected clock." name="SELECTED_CLK" value="0x0"/>
      </value-group>
      <value-group caption="Software Clock Switching Enable" name="CFGCON2__CKSWEN">
        <value caption="Software Clock Switching Enabled" name="ENABLED" value="0x1"/>
        <value caption="Software Clock Switching Disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="Fail-Safe Clock Monitor Enable" name="CFGCON2__FSCMEN">
        <value caption="FSCM Enabled" name="ENABLED" value="0x1"/>
        <value caption="FSCM Disabled" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Post-scale Select Run bits" name="CFGCON2__WDTPSR">
        <value caption="1:1048576" name="DIV_1048576" value="0x14"/>
        <value caption="1:524288" name="DIV_524288" value="0x13"/>
        <value caption="1:262144" name="DIV_262144" value="0x12"/>
        <value caption="1:131072" name="DIV_131072" value="0x11"/>
        <value caption="1:65536" name="DIV_65536" value="0x10"/>
        <value caption="1:32768" name="DIV_32768" value="0xf"/>
        <value caption="1:16384" name="DIV_16384" value="0xe"/>
        <value caption="1:8192" name="DIV_8192" value="0xd"/>
        <value caption="1:4096" name="DIV_4096" value="0xc"/>
        <value caption="1:2048" name="DIV_2048" value="0xb"/>
        <value caption="1:1024" name="DIV_1024" value="0xa"/>
        <value caption="1:512" name="DIV_512" value="0x9"/>
        <value caption="1:256" name="DIV_256" value="0x8"/>
        <value caption="1:128" name="DIV_128" value="0x7"/>
        <value caption="1:64" name="DIV_64" value="0x6"/>
        <value caption="1:32" name="DIV_32" value="0x5"/>
        <value caption="1:16" name="DIV_16" value="0x4"/>
        <value caption="1:8" name="DIV_8" value="0x3"/>
        <value caption="1:4" name="DIV_4" value="0x2"/>
        <value caption="1:2" name="DIV_2" value="0x1"/>
        <value caption="1:1" name="DIV_1" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Stop during Flash Programming bit" name="CFGCON2__WDTSPGM">
        <value caption="The WDT stops during NVR programming (legacy)" name="STOP" value="0x1"/>
        <value caption="The WDT runs during NVR programming (for read/execute while programming flash systems)" name="RUN" value="0x0"/>
      </value-group>
