Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Windowed Watchdog Timer Disable bit" name="CFGCON2__WINDIS">
        <value caption="Standard WDT selected; windowed WDT disabled" name="STANDARD" value="0x1"/>
        <value caption="Windowed WDT enabled" name="WINDOWED" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Enable bit" name="CFGCON2__WDTEN">
        <value caption="WDT enabled" name="ENABLED" value="0x1"/>
        <value caption="WDT disabled (control is placed on the SWDTEN bit)" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Window Size bits" name="CFGCON2__WDTWINSZ">
        <value caption="Window size is 75%" name="75_PERCENT" value="0x0"/>
        <value caption="Window size is 50%" name="50_PERCENT" value="0x1"/>
        <value caption="Window size is 37.5%" name="37.5_PERCENT" value="0x2"/>
        <value caption="Window size is 25%" name="25_PERCENT" value="0x3"/>
      </value-group>
      <value-group caption="Dead Man Timer Count Select bits" name="CFGCON2__DMTCNT">
        <value caption="Counter value is 2^8 for cfg_dmt_cnt[31-0]" name="2^8" value="0x0"/>
        <value caption="Counter value is 2^9 for cfg_dmt_cnt[31-0]" name="2^9" value="0x1"/>
        <value caption="Counter value is 2^10 for cfg_dmt_cnt[31-0]" name="2^10" value="0x2"/>
        <value caption="Counter value is 2^11 for cfg_dmt_cnt[31-0]" name="2^11" value="0x3"/>
        <value caption="Counter value is 2^12 for cfg_dmt_cnt[31-0]" name="2^12" value="0x4"/>
        <value caption="Counter value is 2^13 for cfg_dmt_cnt[31-0]" name="2^13" value="0x5"/>
        <value caption="Counter value is 2^14 for cfg_dmt_cnt[31-0]" name="2^14" value="0x6"/>
        <value caption="Counter value is 2^15 for cfg_dmt_cnt[31-0]" name="2^15" value="0x7"/>
        <value caption="Counter value is 2^16 for cfg_dmt_cnt[31-0]" name="2^16" value="0x8"/>
        <value caption="Counter value is 2^17 for cfg_dmt_cnt[31-0]" name="2^17" value="0x9"/>
        <value caption="Counter value is 2^18 for cfg_dmt_cnt[31-0]" name="2^18" value="0xA"/>
        <value caption="Counter value is 2^19 for cfg_dmt_cnt[31-0]" name="2^19" value="0xB"/>
        <value caption="Counter value is 2^20 for cfg_dmt_cnt[31-0]" name="2^20" value="0xC"/>
        <value caption="Counter value is 2^21 for cfg_dmt_cnt[31-0]" name="2^21" value="0xD"/>
        <value caption="Counter value is 2^22 for cfg_dmt_cnt[31-0]" name="2^22" value="0xE"/>
        <value caption="Counter value is 2^23 for cfg_dmt_cnt[31-0]" name="2^23" value="0xF"/>
        <value caption="Counter value is 2^24 for cfg_dmt_cnt[31-0]" name="2^24" value="0x10"/>
        <value caption="Counter value is 2^25 for cfg_dmt_cnt[31-0]" name="2^25" value="0x11"/>
        <value caption="Counter value is 2^26 for cfg_dmt_cnt[31-0]" name="2^26" value="0x12"/>
        <value caption="Counter value is 2^27 for cfg_dmt_cnt[31-0]" name="2^27" value="0x13"/>
        <value caption="Counter value is 2^28 for cfg_dmt_cnt[31-0]" name="2^28" value="0x14"/>
        <value caption="Counter value is 2^29 for cfg_dmt_cnt[31-0]" name="2^29" value="0x15"/>
        <value caption="Counter value is 2^30 for cfg_dmt_cnt[31-0]" name="2^30" value="0x16"/>
        <value caption="Counter value is 2^31 for cfg_dmt_cnt[31-0]" name="2^31" value="0x17"/>
      </value-group>
      <value-group caption="Dead Man Timer Enable bit" name="CFGCON2__DMTEN">
        <value caption="DMT enabled" name="ENABLED" value="0x1"/>
        <value caption="DMT disabled (control is placed on the DMTCON.ON bit)" name="DISABLED" value="0x0"/>
      </value-group>
      <value-group caption="EWPLL Post Divider bits for controlling second PLL clock output for WiFI" name="CFGCON3__ETHPLLPOSTDIV2">
        <value caption="Divide by 1" name="DIV1" value="0x1"/>
        <value caption="Divide by 2" name="DIV2" value="0x2"/>
        <value caption="Divide by 3" name="DIV3" value="0x3"/>
        <value caption="Divide by 4" name="DIV4" value="0x4"/>
        <value caption="Divide by 5" name="DIV5" value="0x5"/>
        <value caption="Divide by 6" name="DIV6" value="0x6"/>
        <value caption="Divide by 7" name="DIV7" value="0x7"/>
        <value caption="Divide by 8" name="DIV8" value="0x8"/>
        <value caption="Divide by 9" name="DIV9" value="0x9"/>
        <value caption="Divide by 10" name="DIV10" value="0xA"/>
        <value caption="Divide by 11" name="DIV11" value="0xB"/>
        <value caption="Divide by 12" name="DIV12" value="0xC"/>
        <value caption="Divide by 13" name="DIV13" value="0xD"/>
        <value caption="Divide by 14" name="DIV14" value="0xE"/>
        <value caption="Divide by 15" name="DIV15" value="0xF"/>
        <value caption="Divide by 16" name="DIV16" value="0x10"/>
        <value caption="Divide by 17" name="DIV17" value="0x11"/>
        <value caption="Divide by 18" name="DIV18" value="0x12"/>
        <value caption="Divide by 19" name="DIV19" value="0x13"/>
        <value caption="Divide by 20" name="DIV20" value="0x14"/>
        <value caption="Divide by 21" name="DIV21" value="0x15"/>
        <value caption="Divide by 22" name="DIV22" value="0x16"/>
        <value caption="Divide by 23" name="DIV23" value="0x17"/>
        <value caption="Divide by 24" name="DIV24" value="0x18"/>
        <value caption="Divide by 25" name="DIV25" value="0x19"/>
        <value caption="Divide by 26" name="DIV26" value="0x1A"/>
        <value caption="Divide by 27" name="DIV27" value="0x1B"/>
        <value caption="Divide by 28" name="DIV28" value="0x1C"/>
        <value caption="Divide by 29" name="DIV29" value="0x1D"/>
        <value caption="Divide by 30" name="DIV30" value="0x1E"/>
        <value caption="Divide by 31" name="DIV31" value="0x1F"/>
        <value caption="Divide by 32" name="DIV32" value="0x20"/>
        <value caption="Divide by 33" name="DIV33" value="0x21"/>
        <value caption="Divide by 34" name="DIV34" value="0x22"/>
        <value caption="Divide by 35" name="DIV35" value="0x23"/>
        <value caption="Divide by 36" name="DIV36" value="0x24"/>
        <value caption="Divide by 37" name="DIV37" value="0x25"/>
        <value caption="Divide by 38" name="DIV38" value="0x26"/>
        <value caption="Divide by 39" name="DIV39" value="0x27"/>
        <value caption="Divide by 40" name="DIV40" value="0x28"/>
        <value caption="Divide by 41" name="DIV41" value="0x29"/>
        <value caption="Divide by 42" name="DIV42" value="0x2A"/>
        <value caption="Divide by 43" name="DIV43" value="0x2B"/>
        <value caption="Divide by 44" name="DIV44" value="0x2C"/>
        <value caption="Divide by 45" name="DIV45" value="0x2D"/>
        <value caption="Divide by 46" name="DIV46" value="0x2E"/>
        <value caption="Divide by 47" name="DIV47" value="0x2F"/>
        <value caption="Divide by 48" name="DIV48" value="0x30"/>
        <value caption="Divide by 49" name="DIV49" value="0x31"/>
        <value caption="Divide by 50" name="DIV50" value="0x32"/>
        <value caption="Divide by 51" name="DIV51" value="0x33"/>
        <value caption="Divide by 52" name="DIV52" value="0x34"/>
        <value caption="Divide by 53" name="DIV53" value="0x35"/>
        <value caption="Divide by 54" name="DIV54" value="0x36"/>
        <value caption="Divide by 55" name="DIV55" value="0x37"/>
        <value caption="Divide by 56" name="DIV56" value="0x38"/>
        <value caption="Divide by 57" name="DIV57" value="0x39"/>
        <value caption="Divide by 58" name="DIV58" value="0x3A"/>
        <value caption="Divide by 59" name="DIV59" value="0x3B"/>
        <value caption="Divide by 60" name="DIV60" value="0x3C"/>
        <value caption="Divide by 61" name="DIV61" value="0x3D"/>
        <value caption="Divide by 62" name="DIV62" value="0x3E"/>
        <value caption="Divide by 63" name="DIV63" value="0x3F"/>
      </value-group>
      <value-group caption="SPLL Post Divider bits for controlling auxiliary second PLL clock output." name="CFGCON3__SPLLPOSTDIV2">
        <value caption="Divide by 1" name="DIV1" value="0x1"/>
        <value caption="Divide by 2" name="DIV2" value="0x2"/>
        <value caption="Divide by 3" name="DIV3" value="0x3"/>
        <value caption="Divide by 4" name="DIV4" value="0x4"/>
        <value caption="Divide by 5" name="DIV5" value="0x5"/>
        <value caption="Divide by 6" name="DIV6" value="0x6"/>
        <value caption="Divide by 7" name="DIV7" value="0x7"/>
        <value caption="Divide by 8" name="DIV8" value="0x8"/>
        <value caption="Divide by 9" name="DIV9" value="0x9"/>
        <value caption="Divide by 10" name="DIV10" value="0xA"/>
        <value caption="Divide by 11" name="DIV11" value="0xB"/>
        <value caption="Divide by 12" name="DIV12" value="0xC"/>
        <value caption="Divide by 13" name="DIV13" value="0xD"/>
        <value caption="Divide by 14" name="DIV14" value="0xE"/>
        <value caption="Divide by 15" name="DIV15" value="0xF"/>
        <value caption="Divide by 16" name="DIV16" value="0x10"/>
        <value caption="Divide by 17" name="DIV17" value="0x11"/>
        <value caption="Divide by 18" name="DIV18" value="0x12"/>
        <value caption="Divide by 19" name="DIV19" value="0x13"/>
        <value caption="Divide by 20" name="DIV20" value="0x14"/>
        <value caption="Divide by 21" name="DIV21" value="0x15"/>
        <value caption="Divide by 22" name="DIV22" value="0x16"/>
        <value caption="Divide by 23" name="DIV23" value="0x17"/>
        <value caption="Divide by 24" name="DIV24" value="0x18"/>
        <value caption="Divide by 25" name="DIV25" value="0x19"/>
        <value caption="Divide by 26" name="DIV26" value="0x1A"/>
        <value caption="Divide by 27" name="DIV27" value="0x1B"/>
        <value caption="Divide by 28" name="DIV28" value="0x1C"/>
        <value caption="Divide by 29" name="DIV29" value="0x1D"/>
        <value caption="Divide by 30" name="DIV30" value="0x1E"/>
        <value caption="Divide by 31" name="DIV31" value="0x1F"/>
        <value caption="Divide by 32" name="DIV32" value="0x20"/>
        <value caption="Divide by 33" name="DIV33" value="0x21"/>
        <value caption="Divide by 34" name="DIV34" value="0x22"/>
        <value caption="Divide by 35" name="DIV35" value="0x23"/>
        <value caption="Divide by 36" name="DIV36" value="0x24"/>
        <value caption="Divide by 37" name="DIV37" value="0x25"/>
        <value caption="Divide by 38" name="DIV38" value="0x26"/>
        <value caption="Divide by 39" name="DIV39" value="0x27"/>
        <value caption="Divide by 40" name="DIV40" value="0x28"/>
        <value caption="Divide by 41" name="DIV41" value="0x29"/>
        <value caption="Divide by 42" name="DIV42" value="0x2A"/>
        <value caption="Divide by 43" name="DIV43" value="0x2B"/>
        <value caption="Divide by 44" name="DIV44" value="0x2C"/>
        <value caption="Divide by 45" name="DIV45" value="0x2D"/>
        <value caption="Divide by 46" name="DIV46" value="0x2E"/>
        <value caption="Divide by 47" name="DIV47" value="0x2F"/>
        <value caption="Divide by 48" name="DIV48" value="0x30"/>
        <value caption="Divide by 49" name="DIV49" value="0x31"/>
        <value caption="Divide by 50" name="DIV50" value="0x32"/>
        <value caption="Divide by 51" name="DIV51" value="0x33"/>
        <value caption="Divide by 52" name="DIV52" value="0x34"/>
        <value caption="Divide by 53" name="DIV53" value="0x35"/>
        <value caption="Divide by 54" name="DIV54" value="0x36"/>
        <value caption="Divide by 55" name="DIV55" value="0x37"/>
        <value caption="Divide by 56" name="DIV56" value="0x38"/>
        <value caption="Divide by 57" name="DIV57" value="0x39"/>
        <value caption="Divide by 58" name="DIV58" value="0x3A"/>
        <value caption="Divide by 59" name="DIV59" value="0x3B"/>
        <value caption="Divide by 60" name="DIV60" value="0x3C"/>
        <value caption="Divide by 61" name="DIV61" value="0x3D"/>
        <value caption="Divide by 62" name="DIV62" value="0x3E"/>
        <value caption="Divide by 63" name="DIV63" value="0x3F"/>
      </value-group>
      <value-group caption="BTPLL Post Divider bits for controlling auxiliary second PLL clock output." name="CFGCON3__BTPLLPOSTDIV2">
        <value caption="Divide by 1" name="DIV1" value="0x1"/>
        <value caption="Divide by 2" name="DIV2" value="0x2"/>
        <value caption="Divide by 3" name="DIV3" value="0x3"/>
        <value caption="Divide by 4" name="DIV4" value="0x4"/>
        <value caption="Divide by 5" name="DIV5" value="0x5"/>
        <value caption="Divide by 6" name="DIV6" value="0x6"/>
        <value caption="Divide by 7" name="DIV7" value="0x7"/>
        <value caption="Divide by 8" name="DIV8" value="0x8"/>
        <value caption="Divide by 9" name="DIV9" value="0x9"/>
        <value caption="Divide by 10" name="DIV10" value="0xA"/>
        <value caption="Divide by 11" name="DIV11" value="0xB"/>
        <value caption="Divide by 12" name="DIV12" value="0xC"/>
        <value caption="Divide by 13" name="DIV13" value="0xD"/>
        <value caption="Divide by 14" name="DIV14" value="0xE"/>
        <value caption="Divide by 15" name="DIV15" value="0xF"/>
        <value caption="Divide by 16" name="DIV16" value="0x10"/>
        <value caption="Divide by 17" name="DIV17" value="0x11"/>
        <value caption="Divide by 18" name="DIV18" value="0x12"/>
        <value caption="Divide by 19" name="DIV19" value="0x13"/>
        <value caption="Divide by 20" name="DIV20" value="0x14"/>
        <value caption="Divide by 21" name="DIV21" value="0x15"/>
        <value caption="Divide by 22" name="DIV22" value="0x16"/>
        <value caption="Divide by 23" name="DIV23" value="0x17"/>
        <value caption="Divide by 24" name="DIV24" value="0x18"/>
        <value caption="Divide by 25" name="DIV25" value="0x19"/>
        <value caption="Divide by 26" name="DIV26" value="0x1A"/>
        <value caption="Divide by 27" name="DIV27" value="0x1B"/>
        <value caption="Divide by 28" name="DIV28" value="0x1C"/>
        <value caption="Divide by 29" name="DIV29" value="0x1D"/>
        <value caption="Divide by 30" name="DIV30" value="0x1E"/>
        <value caption="Divide by 31" name="DIV31" value="0x1F"/>
        <value caption="Divide by 32" name="DIV32" value="0x20"/>
        <value caption="Divide by 33" name="DIV33" value="0x21"/>
        <value caption="Divide by 34" name="DIV34" value="0x22"/>
        <value caption="Divide by 35" name="DIV35" value="0x23"/>
        <value caption="Divide by 36" name="DIV36" value="0x24"/>
        <value caption="Divide by 37" name="DIV37" value="0x25"/>
        <value caption="Divide by 38" name="DIV38" value="0x26"/>
        <value caption="Divide by 39" name="DIV39" value="0x27"/>
        <value caption="Divide by 40" name="DIV40" value="0x28"/>
        <value caption="Divide by 41" name="DIV41" value="0x29"/>
        <value caption="Divide by 42" name="DIV42" value="0x2A"/>
        <value caption="Divide by 43" name="DIV43" value="0x2B"/>
        <value caption="Divide by 44" name="DIV44" value="0x2C"/>
        <value caption="Divide by 45" name="DIV45" value="0x2D"/>
        <value caption="Divide by 46" name="DIV46" value="0x2E"/>
        <value caption="Divide by 47" name="DIV47" value="0x2F"/>
        <value caption="Divide by 48" name="DIV48" value="0x30"/>
        <value caption="Divide by 49" name="DIV49" value="0x31"/>
        <value caption="Divide by 50" name="DIV50" value="0x32"/>
        <value caption="Divide by 51" name="DIV51" value="0x33"/>
        <value caption="Divide by 52" name="DIV52" value="0x34"/>
        <value caption="Divide by 53" name="DIV53" value="0x35"/>
        <value caption="Divide by 54" name="DIV54" value="0x36"/>
        <value caption="Divide by 55" name="DIV55" value="0x37"/>
        <value caption="Divide by 56" name="DIV56" value="0x38"/>
        <value caption="Divide by 57" name="DIV57" value="0x39"/>
        <value caption="Divide by 58" name="DIV58" value="0x3A"/>
        <value caption="Divide by 59" name="DIV59" value="0x3B"/>
        <value caption="Divide by 60" name="DIV60" value="0x3C"/>
        <value caption="Divide by 61" name="DIV61" value="0x3D"/>
        <value caption="Divide by 62" name="DIV62" value="0x3E"/>
        <value caption="Divide by 63" name="DIV63" value="0x3F"/>
      </value-group>
      <value-group caption="VBAT Zero-Power BOR Enable bit" name="CFGCON4__VBZPBOREN">
        <value caption="Disable ZPBOR during VBAT mode" name="DISABLE" value="0x0"/>
        <value caption="Enable ZPBOR during VBAT mode" name="ENABLE" value="0x1"/>
      </value-group>
      <value-group caption="Deep Sleep Zero-Power BOR Enable bit" name="CFGCON4__DSZPBOREN">
        <value caption="Disable ZPBOR during deep sleep" name="DISABLE" value="0x0"/>
        <value caption="Enable ZPBOR during deep sleep" name="ENABLE" value="0x1"/>
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Postscale Select bits" name="CFGCON4__DSWDTPS">
        <value caption="1:236 (25.7 days)" name="25DAYS" value="0x1f"/>
        <value caption="1:235 (12.8 days)" name="12DAYS" value="0x1e"/>
        <value caption="1:234 (6.4 days)" name="6DAYS" value="0x1d"/>
        <value caption="1:233 (77.0 hours)" name="77HRS" value="0x1c"/>
        <value caption="1:232 (38.5 hours)" name="38HRS" value="0x1b"/>
        <value caption="1:231 (19.2 hours)" name="19HRS" value="0x1a"/>
        <value caption="1:230 (9.6 hours)" name="9HRS" value="0x19"/>
        <value caption="1:229 (4.8 hours)" name="4HRS" value="0x18"/>
        <value caption="1:228 (2.4 hours)" name="2HRS" value="0x17"/>
        <value caption="1:227 (72.2 minutes)" name="72MINS" value="0x16"/>
        <value caption="1:226 (36.1 minutes)" name="36MINS" value="0x15"/>
        <value caption="1:225 (18.0 minutes)" name="18MINS" value="0x14"/>
        <value caption="1:224 (9.0 minutes)" name="9MINS" value="0x13"/>
        <value caption="1:223 (4.5 minutes)" name="4MINS" value="0x12"/>
        <value caption="1:222 (135.3 s)" name="135SEC" value="0x11"/>
        <value caption="1:221 (67.7 s)" name="67SEC" value="0x10"/>
        <value caption="1:220 (33.825 s)" name="33SEC" value="0xf"/>
        <value caption="1:219 (16.912 s)" name="16SEC" value="0xe"/>
        <value caption="1:218 (8.456 s)" name="8SEC" value="0xd"/>
        <value caption="1:217 (4.228 s)" name="4SEC" value="0xc"/>
        <value caption="1:65536 (2.114 s)" name="2SEC" value="0xb"/>
        <value caption="1:32768 (1.057 s)" name="1SEC" value="0xa"/>
        <value caption="1:16384 (528.5 ms)" name="528MSEC" value="0x9"/>
        <value caption="1:8192 (264.3 ms)" name="264MSEC" value="0x8"/>
        <value caption="1:4096 (132.1 ms)" name="132MSEC" value="0x7"/>
        <value caption="1:2048 (66.1 ms)" name="66MSEC" value="0x6"/>
        <value caption="1:1024 (33 ms)" name="33MSEC" value="0x5"/>
        <value caption="1:512 (16.5 ms)" name="16MSEC" value="0x4"/>
        <value caption="1:256 (8.3 ms)" name="8MSEC" value="0x3"/>
        <value caption="1:128 (4.1 ms)" name="4MSEC" value="0x2"/>
        <value caption="1:64 (2.1 ms)" name="2MSEC" value="0x1"/>
        <value caption="1:32 (1 ms)" name="1MSEC" value="0x0"/>
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Reference Clock Select bit" name="CFGCON4__DSWDTOSC">
        <value caption="Select SOSC as DSWDT reference clock" name="SOSC" value="0x0"/>
        <value caption="Select LPRC as DSWDT reference clock" name="LPRC" value="0x1"/>
      </value-group>
      <value-group caption="Deep Sleep Watchdog Timer Enable bit" name="CFGCON4__DSWDTEN">
        <value caption="Disable DSWDT during Deep Sleep" name="DISABLE" value="0x0"/>
        <value caption="Enable DSWDT during Deep Sleep" name="ENABLE" value="0x1"/>
      </value-group>
      <value-group caption="Deep Sleep Bit Enable bit" name="CFGCON4__DSEN">
        <value caption="Disable DS Bit in DSCON" name="DISABLE" value="0x0"/>
        <value caption="Enable DS Bit in DSCON" name="ENABLE" value="0x1"/>
      </value-group>
      <value-group caption="Low Power (Secondary) Oscillator Enable bit" name="CFGCON4__SOSCEN">
        <value caption="Enable Low Power (Secondary) Oscillator - also at reset" name="ENABLE" value="0x1"/>
        <value caption="Disable Low Power (Secondary) Oscillator" name="DISABLE" value="0x0"/>
      </value-group>
      <value-group caption="CPU (Code) Permission Group" name="CFGPG__CPUPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="FC Permission Group" name="CFGPG__FCPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="DMA Permission Group" name="CFGPG__DMAPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="ICD-JTAG Permission Group" name="CFGPG__ICDJPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
      <value-group caption="WIFI Permission Group" name="CFGPG__WIFIPG">
        <value caption="Read Access if RDPER[3] is 1- Write Access if WRPER[3] is 1 (Perm. Grp. 3)" name="GROUP3" value="0x3"/>
        <value caption="Read Access if RDPER[2] is 1- Write Access if WRPER[2] is 1 (Perm. Grp. 2)" name="GROUP2" value="0x2"/>
        <value caption="Read Access if RDPER[1] is 1- Write Access if WRPER[1] is 1 (Perm. Grp. 1)" name="GROUP1" value="0x1"/>
        <value caption="Read Access if RDPER[0] is 1- Write Access if WRPER[0] is 1 (Perm. Grp. 0)" name="GROUP0" value="0x0"/>
      </value-group>
