Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
        <value caption="Request oscillator switch to selection specified by NOSC[3:0] bits" name="SWITCH" value="0x1"/>
        <value caption="Oscillator switch is complete" name="SWITCH_COMPLETE" value="0x0"/>
      </value-group>
      <value-group caption="32 kHz Secondary (LP) Oscillator Enable bit" name="OSCCON__SOSCEN">
        <value caption="Enable Secondary Oscillator" name="ON" value="0x1"/>
        <value caption="Disable Secondary Oscillator" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="USB FRC Clock Enable bit" name="OSCCON__UFRCEN">
        <value caption="Enable FRC as the clock source for the USB clock source" name="FRC" value="0x1"/>
        <value caption="Use the primary oscillator or UPLL as the USB clock source" name="USBCLK" value="0x0"/>
      </value-group>
      <value-group caption="Clock Fail Detect bit (Read / writable / Clearable by application)" name="OSCCON__CF">
        <value caption="FSCM has detected clock failure" name="FAIL_DET" value="0x1"/>
        <value caption="FSCM has not detected clock failure" name="NO_FAILDET" value="0x0"/>
      </value-group>
      <value-group caption="Enable SLEEP Mode bit" name="OSCCON__SLPEN">
        <value caption="When a WAIT Instruction is executed device will enter SLEEP Mode" name="SLEEP" value="0x1"/>
        <value caption="When a WAIT instruction is executed device will enter IDLE Mode" name="IDLE" value="0x0"/>
      </value-group>
      <value-group caption="Clock Lock Enabled bit" name="OSCCON__CLKLOCK">
        <value caption="All clock and PLL configuration registers are locked.  These include OSCCON, OSCTRIM, SPLLCON, UPLLCON, PBxDIV" name="LOCKED" value="0x1"/>
        <value caption="Clock and PLL selection registers are not locked, configurations may be modified" name="UNLOCKED" value="0x0"/>
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
        <value caption="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV ( Supports FRC/16 and FRC/1)" name="FRCCLK" value="0x0"/>
        <value caption="SPLL Module (input clock and divider set by SPLLCON)" name="SPLL" value="0x1"/>
        <value caption="Primary Oscillator" name="POSC" value="0x2"/>
        <value caption="UPLL mode (input clock divider set by UPLLCON) -- was POSC with PLL" name="USBCLK" value="0x3"/>
        <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4"/>
        <value caption="Low Power RC Oscillator (LPRC)" name="LPRC" value="0x5"/>
        <value caption="BT PLL (input clock and divider set by BTPLLCON)" name="BTCLK" value="0x6"/>
        <value caption="EWPLL Ethernet Clock (input clock and divider set by EWPLLCON)" name="ECLK" value="0x7"/>
        <value caption="EWPLL WiFi Clock (input clock and divider set by EWPLLCON)" name="WCLK" value="0x8"/>
      </value-group>
      <value-group caption="Current Oscillator Selection bits (Read-only)" name="OSCCON__COSC">
        <value caption="Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV (Supports FRC/16 and FRC/1)" name="FRC" value="0x0"/>
        <value caption="System PLL (SPLL Module) (input clock and divider set by SPLLCON)" name="SPLL" value="0x1"/>
        <value caption="Primary Oscillator- POSC" name="POSC" value="0x2"/>
        <value caption="USB PLL (UPLL Module) (input clock and divider set by UPLLCON)" name="UPLL" value="0x3"/>
        <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4"/>
        <value caption="Low Power RC Oscillator (LPRC)" name="LPRC" value="0x5"/>
        <value caption="BT PLL (input clock and divider set by BTPLLCON)" name="BTCLK" value="0x6"/>
        <value caption="EWPLL Ethernet Clock (input clock and divider set by EWPLLCON)" name="ECLK" value="0x7"/>
        <value caption="EWPLL WiFi Clock (input clock and divider set by EWPLLCON)" name="WCLK" value="0x8"/>
      </value-group>
      <value-group caption="" name="OSCCON__WAKE2SPD">
        <value caption="When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready" name="FRC" value="0x1"/>
        <value caption="When the device EXITS Sleep Mode, the sys_clk will be from the selected clock." name="SELECTED_CLK" value="0x0"/>
      </value-group>
      <value-group caption="Enable Dream Mode bit" name="OSCCON__DRMEN">
        <value caption="When the cpu_si_sleep input is asserted and SLPEN = 1, DMA transfer complete causes SLEEP Mode to be entered" name="SLEEP" value="0x1"/>
        <value caption="DMA transfer has no effect" name="NO_EFFECT" value="0x0"/>
      </value-group>
      <value-group caption="Fast RC Clock Divider bits" name="OSCCON__FRCDIV">
        <value caption="FRC Divide by 1" name="OSC_FRC_DIV_1" value="0x0"/>
        <value caption="FRC Divide by 2" name="OSC_FRC_DIV_2" value="0x1"/>
        <value caption="FRC Divide by 4" name="OSC_FRC_DIV_4" value="0x2"/>
        <value caption="FRC Divide by 8" name="OSC_FRC_DIV_8" value="0x3"/>
        <value caption="FRC Divide by 16" name="OSC_FRC_DIV_16" value="0x4"/>
        <value caption="FRC Divide by 32" name="OSC_FRC_DIV_32" value="0x5"/>
        <value caption="FRC Divide by 64" name="OSC_FRC_DIV_64" value="0x6"/>
        <value caption="FRC Divide by 256" name="OSC_FRC_DIV_256" value="0x7"/>
      </value-group>
      <value-group caption="Internal Fast RC (FRC) Oscillator Tuning bits" name="OSCTUN__TUN">
        <value caption="Maximum Frequency" name="" value="0x1f"/>
        <value caption="Center Frequency, oscillator is running at calibrated frequency" name="" value="0x0"/>
        <value caption="Minimum Frequency" name="" value="0x20"/>
      </value-group>
      <value-group caption="PLL Power Down Register bit" name="SPLLCON__SPLLPWDN">
        <value caption="PLL is powered down" name="PLL_OFF" value="0x1"/>
        <value caption="PLL is active" name="PLL_ON" value="0x0"/>
      </value-group>
      <value-group caption="First Post Divide Value, 1 to 63" name="SPLLCON__SPLLPOSTDIV1">
        <value caption="First post divide by 1" name="POSTDIV_1" value="0x1"/>
        <value caption="First post divide by 2" name="POSTDIV_2" value="0x2"/>
        <value caption="First post divide by 3" name="POSTDIV_3" value="0x3"/>
        <value caption="First post divide by 4" name="POSTDIV_4" value="0x4"/>
        <value caption="First post divide by 5" name="POSTDIV_5" value="0x5"/>
        <value caption="First post divide by 6" name="POSTDIV_6" value="0x6"/>
        <value caption="First post divide by 7" name="POSTDIV_7" value="0x7"/>
        <value caption="First post divide by 8" name="POSTDIV_8" value="0x8"/>
        <value caption="First post divide by 9" name="POSTDIV_9" value="0x9"/>
        <value caption="First post divide by 10" name="POSTDIV_10" value="0xa"/>
        <value caption="First post divide by 11" name="POSTDIV_11" value="0xb"/>
        <value caption="First post divide by 12" name="POSTDIV_12" value="0xc"/>
        <value caption="First post divide by 13" name="POSTDIV_13" value="0xd"/>
        <value caption="First post divide by 14" name="POSTDIV_14" value="0xe"/>
        <value caption="First post divide by 15" name="POSTDIV_15" value="0xf"/>
        <value caption="First post divide by 16" name="POSTDIV_16" value="0x10"/>
        <value caption="First post divide by 17" name="POSTDIV_17" value="0x11"/>
        <value caption="First post divide by 18" name="POSTDIV_18" value="0x12"/>
        <value caption="First post divide by 19" name="POSTDIV_19" value="0x13"/>
        <value caption="First post divide by 20" name="POSTDIV_20" value="0x14"/>
        <value caption="First post divide by 21" name="POSTDIV_21" value="0x15"/>
        <value caption="First post divide by 22" name="POSTDIV_22" value="0x16"/>
        <value caption="First post divide by 23" name="POSTDIV_23" value="0x17"/>
        <value caption="First post divide by 24" name="POSTDIV_24" value="0x18"/>
        <value caption="First post divide by 25" name="POSTDIV_25" value="0x19"/>
        <value caption="First post divide by 26" name="POSTDIV_26" value="0x1a"/>
        <value caption="First post divide by 27" name="POSTDIV_27" value="0x1b"/>
        <value caption="First post divide by 28" name="POSTDIV_28" value="0x1c"/>
        <value caption="First post divide by 29" name="POSTDIV_29" value="0x1d"/>
        <value caption="First post divide by 30" name="POSTDIV_30" value="0x1e"/>
        <value caption="First post divide by 31" name="POSTDIV_31" value="0x1f"/>
        <value caption="First post divide by 32" name="POSTDIV_32" value="0x20"/>
        <value caption="First post divide by 33" name="POSTDIV_33" value="0x21"/>
        <value caption="First post divide by 34" name="POSTDIV_34" value="0x22"/>
        <value caption="First post divide by 35" name="POSTDIV_35" value="0x23"/>
        <value caption="First post divide by 36" name="POSTDIV_36" value="0x24"/>
        <value caption="First post divide by 37" name="POSTDIV_37" value="0x25"/>
        <value caption="First post divide by 38" name="POSTDIV_38" value="0x26"/>
        <value caption="First post divide by 39" name="POSTDIV_39" value="0x27"/>
        <value caption="First post divide by 40" name="POSTDIV_40" value="0x28"/>
        <value caption="First post divide by 41" name="POSTDIV_41" value="0x29"/>
        <value caption="First post divide by 42" name="POSTDIV_42" value="0x2a"/>
        <value caption="First post divide by 43" name="POSTDIV_43" value="0x2b"/>
        <value caption="First post divide by 44" name="POSTDIV_44" value="0x2c"/>
        <value caption="First post divide by 45" name="POSTDIV_45" value="0x2d"/>
        <value caption="First post divide by 46" name="POSTDIV_46" value="0x2e"/>
        <value caption="First post divide by 47" name="POSTDIV_47" value="0x2f"/>
        <value caption="First post divide by 48" name="POSTDIV_48" value="0x30"/>
        <value caption="First post divide by 49" name="POSTDIV_49" value="0x31"/>
        <value caption="First post divide by 50" name="POSTDIV_50" value="0x32"/>
        <value caption="First post divide by 51" name="POSTDIV_51" value="0x33"/>
        <value caption="First post divide by 52" name="POSTDIV_52" value="0x34"/>
        <value caption="First post divide by 53" name="POSTDIV_53" value="0x35"/>
        <value caption="First post divide by 54" name="POSTDIV_54" value="0x36"/>
        <value caption="First post divide by 55" name="POSTDIV_55" value="0x37"/>
        <value caption="First post divide by 56" name="POSTDIV_56" value="0x38"/>
        <value caption="First post divide by 57" name="POSTDIV_57" value="0x39"/>
        <value caption="First post divide by 58" name="POSTDIV_58" value="0x3a"/>
        <value caption="First post divide by 59" name="POSTDIV_59" value="0x3b"/>
        <value caption="First post divide by 60" name="POSTDIV_60" value="0x3c"/>
        <value caption="First post divide by 61" name="POSTDIV_61" value="0x3d"/>
        <value caption="First post divide by 62" name="POSTDIV_62" value="0x3e"/>
        <value caption="First post divide by 63" name="POSTDIV_63" value="0x3f"/>
      </value-group>
      <value-group caption="System PLL Force Lock" name="SPLLCON__SPLLFLOCK">
        <value caption="Force the SPLL lock signal to be asserted" name="ASSERT" value="0x1"/>
        <value caption="Do not force the SPLL lock signal to be asserted" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="System PLL Reset" name="SPLLCON__SPLLRST">
        <value caption="Assert the reset to the SPLL" name="ASSERT" value="0x1"/>
        <value caption="De-assert the reset to the SPLL" name="NO_ASSERT" value="0x0"/>
      </value-group>
      <value-group caption="PLL feedback divider, 16 to 1023" name="SPLLCON__SPLLFBDIV">
        <value caption="PLL feedback divide by 16" name="DIV_16" value="0x10"/>
        <value caption="PLL feedback divide by 17" name="DIV_17" value="0x11"/>
        <value caption="PLL feedback divide by 18" name="DIV_18" value="0x12"/>
        <value caption="PLL feedback divide by 1022" name="DIV_1022" value="0x3fe"/>
        <value caption="PLL feedback divide by 1023" name="DIV_1023" value="0x3ff"/>
      </value-group>
