Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Reference Clock Request Status bit" name="REFO4CON__ACTIVE">
        <value caption="Reference clock request is active (User should not update this REFOCON register)" name="" value="0x1"/>
        <value caption="Reference clock request is not active (User can update this REFOCON register)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock RODIV/ROTRIM switch enabled." name="REFO4CON__DIVSWEN">
        <value caption="Clock Divider Switching currently in progress." name="" value="0x1"/>
        <value caption="Clock Divider Switch has completed." name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Oscillator Run in Sleep bit" name="REFO4CON__RSLP">
        <value caption="Reference Oscillator output continues to run in Sleep" name="" value="0x1"/>
        <value caption="Reference Oscillator output is disabled in Sleep" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Output Enable bit" name="REFO4CON__OE">
        <value caption="Reference clock is driven out on REFO1 pin" name="" value="0x1"/>
        <value caption="Reference clock is not driven out on REFO1 pin." name="" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Stop in Idle Mode bit" name="REFO4CON__SIDL">
        <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1"/>
        <value caption="Continue module operation in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Freeze in Debug mode bit" name="REFO4CON__FRZ">
        <value caption="When emulator is in Debug mode, module freezes operation" name="" value="0x1"/>
        <value caption="When emulator is in Debug mode, module continues operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="REFO4CON__ON">
        <value caption="Reference Oscillator Module enabled" name="" value="0x1"/>
        <value caption="Reference Oscillator Module disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reference Clock Divider bits" name="REFO4CON__RODIV">
        <value caption="REFO1 clock is Base clock frequency divided by 65,534 (32,767 *2)" name="" value="0x7fff"/>
        <value caption="REFO1 clock is Base clock frequency divided by 4 (2*2)" name="" value="0x2"/>
        <value caption="REFO1 clock is Base clock frequency divided by 2 (1*2)" name="" value="0x1"/>
        <value caption="REFO1 clock is same frequency as Base clock (no divider)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock" name="REFO4TRIM__ROTRIM">
        <value caption="0/512 (0.0) divisor added to RODIV value" name="" value="0x0"/>
        <value caption="1/512 (0.001953125) divisor added to RODIV value" name="" value="0x1"/>
        <value caption="2/512 (0.00390625) divisor added to RODIV value" name="" value="0x2"/>
        <value caption="256/512 (0.5000) divisor added to RODIV value" name="" value="0x100"/>
        <value caption="511/512 (0.998046875) divisor added to RODIV value" name="" value="0x1ff"/>
      </value-group>
      <value-group caption="PB1 Peripheral Clock Divisor Control value" name="PB1DIV__PBDIV">
        <value caption="Divide by 1 PB1 Clock same frequency as sys_clk" name="" value="0x0"/>
        <value caption="Divide by 2 PB1 Clock is 1/2 of sys_clk" name="" value="0x1"/>
        <value caption="Divide by 3 PB1 Clock is 1/3 of sys_clk" name="" value="0x2"/>
        <value caption="Divide by 16 PB1 Clock is 1/16 of sys_clk" name="" value="0xf"/>
        <value caption="Divide by 17 PB1 Clock is 1/17 of sys_clk" name="" value="0x10"/>
        <value caption="Divide by 127 PB1 Clock is 1/127 of sys_clk" name="" value="0x7e"/>
        <value caption="Divide by 128 PB1 Clock is 1/128 of sys_clk" name="" value="0x7f"/>
      </value-group>
      <value-group caption="PB1 Peripheral Clock Divisor Ready" name="PB1DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB1DIV may be written." name="" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB1DIV cannot be written." name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB1DIV__PBDIVON">
        <value caption="PB1 Output clock is enabled" name="" value="0x1"/>
        <value caption="PB1 Output clock is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PB2 Peripheral Clock Divisor Control value" name="PB2DIV__PBDIV">
        <value caption="Divide by 1 PB2 Clock same frequency as sys_clk" name="" value="0x0"/>
        <value caption="Divide by 2 PB2 Clock is 1/2 of sys_clk" name="" value="0x1"/>
        <value caption="Divide by 3 PB2 Clock is 1/3 of sys_clk" name="" value="0x2"/>
        <value caption="Divide by 16 PB2 Clock is 1/16 of sys_clk" name="" value="0xf"/>
        <value caption="Divide by 17 PB2 Clock is 1/17 of sys_clk" name="" value="0x10"/>
        <value caption="Divide by 127 PB2 Clock is 1/127 of sys_clk" name="" value="0x7e"/>
        <value caption="Divide by 128 PB2 Clock is 1/128 of sys_clk" name="" value="0x7f"/>
      </value-group>
      <value-group caption="PB2 Peripheral Clock Divisor Ready" name="PB2DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written." name="" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written." name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB2DIV__PBDIVON">
        <value caption="PB2 Output clock is enabled" name="" value="0x1"/>
        <value caption="PB2 Output clock is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PB3 Peripheral Clock Divisor Control value" name="PB3DIV__PBDIV">
        <value caption="Divide by 1 PB3 Clock same frequency as sys_clk" name="" value="0x0"/>
        <value caption="Divide by 2 PB3 Clock is 1/2 of sys_clk" name="" value="0x1"/>
        <value caption="Divide by 3 PB3 Clock is 1/3 of sys_clk" name="" value="0x2"/>
        <value caption="Divide by 16 PB3 Clock is 1/16 of sys_clk" name="" value="0xf"/>
        <value caption="Divide by 17 PB3 Clock is 1/17 of sys_clk" name="" value="0x10"/>
        <value caption="Divide by 127 PB3 Clock is 1/127 of sys_clk" name="" value="0x7e"/>
        <value caption="Divide by 128 PB3 Clock is 1/128 of sys_clk" name="" value="0x7f"/>
      </value-group>
      <value-group caption="PB3 Peripheral Clock Divisor Ready" name="PB3DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written." name="" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written." name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB3DIV__PBDIVON">
        <value caption="PB3 Output clock is enabled" name="" value="0x1"/>
        <value caption="PB3 Output clock is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PB4 Peripheral Clock Divisor Control value" name="PB4DIV__PBDIV">
        <value caption="Divide by 1 PB4 Clock same frequency as sys_clk" name="" value="0x0"/>
        <value caption="Divide by 2 PB4 Clock is 1/2 of sys_clk" name="" value="0x1"/>
        <value caption="Divide by 3 PB4 Clock is 1/3 of sys_clk" name="" value="0x2"/>
        <value caption="Divide by 16 PB4 Clock is 1/16 of sys_clk" name="" value="0xf"/>
        <value caption="Divide by 17 PB4 Clock is 1/17 of sys_clk" name="" value="0x10"/>
        <value caption="Divide by 127 PB4 Clock is 1/127 of sys_clk" name="" value="0x7e"/>
        <value caption="Divide by 128 PB4 Clock is 1/128 of sys_clk" name="" value="0x7f"/>
      </value-group>
      <value-group caption="PB4 Peripheral Clock Divisor Ready" name="PB4DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB4DIV may be written." name="" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB4DIV cannot be written." name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB4DIV__PBDIVON">
        <value caption="PB4 Output clock is enabled" name="" value="0x1"/>
        <value caption="PB4 Output clock is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PB5 Peripheral Clock Divisor Control value" name="PB5DIV__PBDIV">
        <value caption="Divide by 1 PB5 Clock same frequency as sys_clk" name="" value="0x0"/>
        <value caption="Divide by 2 PB5 Clock is 1/2 of sys_clk" name="" value="0x1"/>
        <value caption="Divide by 3 PB5 Clock is 1/3 of sys_clk" name="" value="0x2"/>
        <value caption="Divide by 16 PB5 Clock is 1/16 of sys_clk" name="" value="0xf"/>
        <value caption="Divide by 17 PB5 Clock is 1/17 of sys_clk" name="" value="0x10"/>
        <value caption="Divide by 127 PB5 Clock is 1/127 of sys_clk" name="" value="0x7e"/>
        <value caption="Divide by 128 PB5 Clock is 1/128 of sys_clk" name="" value="0x7f"/>
      </value-group>
