Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="PB5 Peripheral Clock Divisor Ready" name="PB5DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB5DIV may be written." name="" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB5DIV cannot be written." name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB5DIV__PBDIVON">
        <value caption="PB5 Output clock is enabled" name="" value="0x1"/>
        <value caption="PB5 Output clock is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PB6 Peripheral Clock Divisor Control value" name="PB6DIV__PBDIV">
        <value caption="Divide by 1 PB6 Clock same frequency as sys_clk" name="" value="0x0"/>
        <value caption="Divide by 2 PB6 Clock is 1/2 of sys_clk" name="" value="0x1"/>
        <value caption="Divide by 3 PB6 Clock is 1/3 of sys_clk" name="" value="0x2"/>
        <value caption="Divide by 16 PB6 Clock is 1/16 of sys_clk" name="" value="0xf"/>
        <value caption="Divide by 17 PB6 Clock is 1/17 of sys_clk" name="" value="0x10"/>
        <value caption="Divide by 127 PB6 Clock is 1/127 of sys_clk" name="" value="0x7e"/>
        <value caption="Divide by 128 PB6 Clock is 1/128 of sys_clk" name="" value="0x7f"/>
      </value-group>
      <value-group caption="PB6 Peripheral Clock Divisor Ready" name="PB6DIV__PBDIVRDY">
        <value caption="Indicates the PB clock divisor logic is not switching divisors and the PB6DIV may be written." name="" value="0x1"/>
        <value caption="Indicates the PB clock divisor logic is currently switching values and the PB6DIV cannot be written." name="" value="0x0"/>
      </value-group>
      <value-group caption="Output Enable bit" name="PB6DIV__PBDIVON">
        <value caption="PB6 Output clock is enabled" name="" value="0x1"/>
        <value caption="PB6 Output clock is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Switch Slewing Active Status Bit - Read-Only" name="SLEWCON__BUSY">
        <value caption="Clock Switch has reached its final value" name="" value="0x0"/>
        <value caption="Clock frequency is being actively Slewed" name="" value="0x1"/>
      </value-group>
      <value-group caption="Clock slew enable for switching down to slower clocks" name="SLEWCON__DNEN">
        <value caption="Clock Slewing disabled" name="" value="0x0"/>
        <value caption="Clock Slewing enabled on a clock switch" name="" value="0x1"/>
      </value-group>
      <value-group caption="Clock slew enable for switching up to faster clocks" name="SLEWCON__UPEN">
        <value caption="Clock Slewing disabled" name="" value="0x0"/>
        <value caption="Clock Slewing enabled on a clock switch OR exit from SLEEP" name="" value="0x1"/>
      </value-group>
      <value-group caption="Divisor steps used when doing slewed clock switches" name="SLEWCON__SLWDIV">
        <value caption="No Divisor used" name="" value="0x0"/>
        <value caption="Divide by 2, then no divisor" name="" value="0x1"/>
        <value caption="Divide by 4, then by 2, then no divisor" name="" value="0x2"/>
        <value caption="Divide by 8, then by 4, then by 2, then no divisor" name="" value="0x3"/>
        <value caption="Divide by 16, then by 8, then by 4, then by 2, then no divisor" name="" value="0x4"/>
        <value caption="Divide by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" name="" value="0x5"/>
        <value caption="Divide by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" name="" value="0x6"/>
        <value caption="Divide by 128, then by 64, then by 32, then by 16, then by 8, then by 4, then by 2, then no divisor" name="" value="0x7"/>
      </value-group>
      <value-group caption="PBx Peripheral Clock Divisor Control value" name="SLEWCON__SYSDIV">
        <value caption="Divide by 1- sys_clk_out same frequency as sys_clk source - Default" name="" value="0x0"/>
        <value caption="Divide by 2- sys_clk_out is 1/2 of sys_clk source" name="" value="0x1"/>
        <value caption="Divide by 3- sys_clk_out is 1/3 of sys_clk source" name="" value="0x2"/>
        <value caption="Divide by 4- sys_clk_out is 1/4 of sys_clk source" name="" value="0x3"/>
        <value caption="Divide by 5- sys_clk_out is 1/5 of sys_clk source" name="" value="0x4"/>
        <value caption="Divide by 6- sys_clk_out is 1/6 of sys_clk source" name="" value="0x5"/>
        <value caption="Divide by 7- sys_clk_out is 1/7 of sys_clk source" name="" value="0x6"/>
        <value caption="Divide by 8- sys_clk_out is 1/8 of sys_clk source" name="" value="0x7"/>
        <value caption="Divide by 9- sys_clk_out is 1/9 of sys_clk source" name="" value="0x8"/>
        <value caption="Divide by 10- sys_clk_out is 1/10 of sys_clk source" name="" value="0x9"/>
        <value caption="Divide by 11- sys_clk_out is 1/11 of sys_clk source" name="" value="0xa"/>
        <value caption="Divide by 12- sys_clk_out is 1/12 of sys_clk source" name="" value="0xb"/>
        <value caption="Divide by 13- sys_clk_out is 1/13 of sys_clk source" name="" value="0xc"/>
        <value caption="Divide by 14- sys_clk_out is 1/14 of sys_clk source" name="" value="0xd"/>
        <value caption="Divide by 15- sys_clk_out is 1/15 of sys_clk source" name="" value="0xe"/>
        <value caption="Divide by 16- sys_clk_out is 1/16 of sys_clk source" name="" value="0xf"/>
      </value-group>
      <value-group caption="Number of clocks generated at each slew step for a clock switch" name="SLEWCON__SLWDLY">
        <value caption="1 clock will be generated at each slew step" name="" value="0x0"/>
        <value caption="2 clocks will be generated at each slew step" name="" value="0x1"/>
        <value caption="3 clocks will be generated at each slew step" name="" value="0x2"/>
        <value caption="4 clocks will be generated at each slew step" name="" value="0x3"/>
        <value caption="5 clocks will be generated at each slew step" name="" value="0x4"/>
        <value caption="6 clocks will be generated at each slew step" name="" value="0x5"/>
        <value caption="7 clocks will be generated at each slew step" name="" value="0x6"/>
        <value caption="8 clocks will be generated at each slew step" name="" value="0x7"/>
        <value caption="9 clocks will be generated at each slew step" name="" value="0x8"/>
        <value caption="10 clocks will be generated at each slew step" name="" value="0x9"/>
        <value caption="11 clocks will be generated at each slew step" name="" value="0xa"/>
        <value caption="12 clocks will be generated at each slew step" name="" value="0xb"/>
        <value caption="13 clocks will be generated at each slew step" name="" value="0xc"/>
        <value caption="14 clocks will be generated at each slew step" name="" value="0xd"/>
        <value caption="15 clocks will be generated at each slew step" name="" value="0xe"/>
        <value caption="16 clocks will be generated at each slew step" name="" value="0xf"/>
      </value-group>
      <value-group caption="FRC Ready Status value" name="CLKSTAT__FRCRDY">
        <value caption="FRC is not stable and not ready" name="" value="0x0"/>
        <value caption="FRC is stable and ready" name="" value="0x1"/>
      </value-group>
