Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="System PLL Ready Status value" name="CLKSTAT__SPLLRDY">
        <value caption="SPLL Primary Output is not stable and not ready" name="" value="0x0"/>
        <value caption="SPLL Primary Output is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="Primary Oscillator Ready Status value" name="CLKSTAT__POSCRDY">
        <value caption="POSC is not stable and not ready" name="" value="0x0"/>
        <value caption="POSC is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="USB PLL Ready Status value" name="CLKSTAT__UPLLRDY">
        <value caption="UPLL is not stable and not ready" name="" value="0x0"/>
        <value caption="UPLL is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="SOSC Ready Status value" name="CLKSTAT__SOSCRDY">
        <value caption="SOSC is not stable and not ready" name="" value="0x0"/>
        <value caption="SOSC is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="LPRC Ready Status value" name="CLKSTAT__LPRCRDY">
        <value caption="LPRC is not stable and not ready" name="" value="0x0"/>
        <value caption="LPRC is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="Bluetooth PLL Ready Status value" name="CLKSTAT__BTPLLRDY">
        <value caption="BTPLL is not stable and not ready" name="" value="0x0"/>
        <value caption="BTPLL is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="EWPLL Ready Status value" name="CLKSTAT__ETHPLLRDY">
        <value caption="EWPLL is not stable and not ready" name="" value="0x0"/>
        <value caption="EWPLL is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="WiFi Clock Ready Status value" name="CLKSTAT__WIFICLKRDY">
        <value caption="WIFICLK is not stable and not ready" name="" value="0x0"/>
        <value caption="WIFICLK is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="System PLL Ready Status value" name="CLKSTAT__SPLLALTRDY">
        <value caption="SPLL Alternate Output is not stable and not ready" name="" value="0x0"/>
        <value caption="SPLL Alternate Output is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="PB1 Clock Ready Status value" name="CLKSTAT__PB1CLKRDY">
        <value caption="PB1CLK is not stable and not ready" name="" value="0x0"/>
        <value caption="PB1CLK is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="System Clock Ready Status value" name="CLKSTAT__SYSCLKRDY">
        <value caption="SYSCLK is not stable and not ready" name="" value="0x0"/>
        <value caption="SYSCLK is stable and ready" name="" value="0x1"/>
      </value-group>
      <value-group caption="POSC Clock Stop Control value" name="CLKDIAG__POSCSTOP">
        <value caption="POSC clock source runs as normal" name="" value="0x0"/>
        <value caption="POSC clock source is stopped" name="" value="0x1"/>
      </value-group>
      <value-group caption="SOSC Clock Stop Control value" name="CLKDIAG__SOSCSTOP">
        <value caption="SOSC clock source runs as normal" name="" value="0x0"/>
        <value caption="SOSC clock source is stopped" name="" value="0x1"/>
      </value-group>
      <value-group caption="FRC Clock Stop Control value" name="CLKDIAG__FRCSTOP">
        <value caption="FRC clock source runs as normal" name="" value="0x0"/>
        <value caption="FRC clock source is stopped" name="" value="0x1"/>
      </value-group>
      <value-group caption="LPRC Clock Stop Control value" name="CLKDIAG__LPRCSTOP">
        <value caption="LPRC clock source runs as normal" name="" value="0x0"/>
        <value caption="LPRC clock source is stopped" name="" value="0x1"/>
      </value-group>
      <value-group caption="SPLL Clock Stop Control value" name="CLKDIAG__SPLLSTOP">
        <value caption="SPLL clock source runs as normal" name="" value="0x0"/>
        <value caption="SPLL clock source is stopped" name="" value="0x1"/>
      </value-group>
      <value-group caption="UPLL Clock Stop Control value" name="CLKDIAG__UPLLSTOP">
        <value caption="UPLL clock source runs as normal" name="" value="0x0"/>
        <value caption="UPLL clock source is stopped" name="" value="0x1"/>
      </value-group>
      <value-group caption="UPLL Clock Stop Control value" name="CLKDIAG__ETHPLLSTOP">
        <value caption="EWPLL clock source runs as normal" name="" value="0x0"/>
        <value caption="EWPLL clock source is stopped" name="" value="0x1"/>
      </value-group>
    </module>
    <module caption="" id="03100" name="RCON" version="3">
      <register-group name="RCON">
        <register caption="RESET CONTROL REGISTER" initval="0x3" name="RCON" offset="0x60" rw="RW" size="4">
          <bitfield caption="Power-On Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR"/>
          <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR"/>
          <bitfield caption="Wake from Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE"/>
          <bitfield caption="Wake from Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP"/>
          <bitfield caption="Watchdog Timer Time-Out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO"/>
          <bitfield caption="Deadman Timer Time-Out Flag bit" mask="0x00000020" name="DMTO" values="RCON__DMTO"/>
          <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR"/>
          <bitfield caption="External Reset (MCLR) Status bit" mask="0x00000080" name="EXTR" values="RCON__EXTR"/>
          <bitfield caption="Configuration Mismatch Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR"/>
          <bitfield caption="DPSLP Deep Sleep Mode Flag Bit" mask="0x00000400" name="DPSLP" values="RCON__DPSLP"/>
          <bitfield caption="VBAT Mode Flag Bit" mask="0x00010000" name="VBAT" values="RCON__VBAT"/>
          <bitfield caption="VBPOR Mode Flag Bit" mask="0x00020000" name="VBPOR" values="RCON__VBPOR"/>
          <bitfield caption="NVM End of Life Flag Bit" mask="0x01000000" name="NVMEOL" values="RCON__NVMEOL"/>
          <bitfield caption="NVM Life Time Alert Flag Bit" mask="0x02000000" name="NVMLTA" values="RCON__NVMLTA"/>
          <bitfield caption="BCFG Failure Flag Bit" mask="0x04000000" name="BCFGFAIL" values="RCON__BCFGFAIL"/>
          <bitfield caption="BCFG Error Flag Bit" mask="0x08000000" name="BCFGERR" values="RCON__BCFGERR"/>
          <bitfield caption="Core Voltage POR Flag bit" mask="0x40000000" name="PORCORE" values="RCON__PORCORE"/>
          <bitfield caption="IO Voltage POR Flag bit" mask="0x80000000" name="PORIO" values="RCON__PORIO"/>
        </register>
        <register caption="SOFTWARE RESET REGISTER" initval="0x0" name="RSWRST" offset="0x70" rw="W" size="4">
          <bitfield caption="Software Reset Trigger" mask="0x00000001" name="SWRST" values="RSWRST__SWRST"/>
        </register>
        <register caption="NMI CONTROL REGISTER" initval="0x0" name="RNMICON" offset="0x80" rw="RW" size="4">
          <bitfield caption="NMI Reset counter value" mask="0x0000FFFF" name="NMICNT" values="RNMICON__NMICNT"/>
          <bitfield caption="Watch-Dog Timer Time-Out in Sleep Flag bit" mask="0x00010000" name="WDTS" values="RNMICON__WDTS"/>
          <bitfield caption="Clock Fail Detect bit" mask="0x00020000" name="CF" values="RNMICON__CF"/>
          <bitfield caption="Programmable Low Voltage Detect Event" mask="0x00040000" name="LVD" values="RNMICON__LVD"/>
          <bitfield caption="External / Generic NMI Event" mask="0x00080000" name="GNMI" values="RNMICON__GNMI"/>
          <bitfield caption="Software NMI Trigger" mask="0x00800000" name="SWNMI" values="RNMICON__SWNMI"/>
          <bitfield caption="Watchdog Timer Time-Out in Run Flag bit" mask="0x01000000" name="WDTR" values="RNMICON__WDTR"/>
          <bitfield caption="Deadman Timer Time-Out Flag bit" mask="0x02000000" name="DMTO" values="RNMICON__DMTO"/>
        </register>
        <register caption="POWER CONTROL REGISTER" initval="0x0" name="PWRCON" offset="0x90" rw="RW" size="4">
          <bitfield caption="Voltage Regulator Standby Enable bit" mask="0x00000001" name="VREGS" values="PWRCON__VREGS"/>
          <bitfield caption="Controls Output level of the Voltage Regulators During SLEEP Mode" mask="0x00000030" name="VRGSLP" values="PWRCON__VRGSLP"/>
          <bitfield caption="Controls Output level of the Voltage Regulators in Mission/Run Mode" mask="0x000000C0" name="VRGRUN" values="PWRCON__VRGRUN"/>
        </register>
      </register-group>
      <value-group caption="Power-On Reset Flag bit" name="RCON__POR">
        <value caption="A Power-up Reset has occurred." name="" value="0x1"/>
        <value caption="A Power-up Reset has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
        <value caption="A Brown-out Reset has occurred." name="" value="0x1"/>
        <value caption="A Brown-out Reset has not occurred." name="" value="0x0"/>
      </value-group>
