Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Wake from Idle Flag bit" name="RCON__IDLE">
        <value caption="Device was in Idle mode." name="" value="0x1"/>
        <value caption="Device was not in Idle mode." name="" value="0x0"/>
      </value-group>
      <value-group caption="Wake from Sleep Flag bit" name="RCON__SLEEP">
        <value caption="Device has been in Sleep mode." name="" value="0x1"/>
        <value caption="Device has not been in Sleep mode." name="" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RCON__WDTO">
        <value caption="WDT Time-out has occurred and caused a reset." name="" value="0x1"/>
        <value caption="WDT Time-out has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="Deadman Timer Time-Out Flag bit" name="RCON__DMTO">
        <value caption="DMT Time-out has occurred and caused a reset." name="" value="0x1"/>
        <value caption="DMT Time-out has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
        <value caption="A Software Commanded Reset has occurred." name="" value="0x1"/>
        <value caption="A Software Commanded Reset has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="External Reset (MCLR) Status bit" name="RCON__EXTR">
        <value caption="A Master Clear (pin) Reset has occurred." name="" value="0x1"/>
        <value caption="A Master Clear (pin) Reset has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="Configuration Mismatch Flag bit" name="RCON__CMR">
        <value caption="A Configuration Mismatch Reset Event has occurred." name="" value="0x1"/>
        <value caption="A Configuration Mismatch Reset Event has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="DPSLP Deep Sleep Mode Flag Bit" name="RCON__DPSLP">
        <value caption="Deep Sleep Mode has occurred." name="" value="0x1"/>
        <value caption="Deep Sleep Mode has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="VBAT Mode Flag Bit" name="RCON__VBAT">
        <value caption="A POR exit from VBAT has occurred. A true POR must be established with the valid VBAT voltage level on the VBAT pin" name="" value="0x1"/>
        <value caption="A POR exit from VBAT has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="VBPOR Mode Flag Bit" name="RCON__VBPOR">
        <value caption="A VBAT Domain POR has occurred." name="" value="0x1"/>
        <value caption="A VBAT Domain POR has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="NVM End of Life Flag Bit" name="RCON__NVMEOL">
        <value caption="A NVM EOL Failure has not occurred." name="" value="0x0"/>
        <value caption="A NVM EOL Failure has occurred." name="" value="0x1"/>
      </value-group>
      <value-group caption="NVM Life Time Alert Flag Bit" name="RCON__NVMLTA">
        <value caption="A NVM LTA Error has not occurred." name="" value="0x0"/>
        <value caption="A NVM LTA Error has occurred." name="" value="0x1"/>
      </value-group>
      <value-group caption="BCFG Failure Flag Bit" name="RCON__BCFGFAIL">
        <value caption="A BCFG Failure has not occurred." name="" value="0x0"/>
        <value caption="A BCFG Failure has occurred." name="" value="0x1"/>
      </value-group>
      <value-group caption="BCFG Error Flag Bit" name="RCON__BCFGERR">
        <value caption="A BCFG Error has not occurred." name="" value="0x0"/>
        <value caption="A BCFG Error has occurred." name="" value="0x1"/>
      </value-group>
      <value-group caption="Core Voltage POR Flag bit" name="RCON__PORCORE">
        <value caption="A Power-up Reset has occurred due to Core Voltage." name="" value="0x1"/>
        <value caption="A Power-up Reset has not occurred due to Core Voltage." name="" value="0x0"/>
      </value-group>
      <value-group caption="IO Voltage POR Flag bit" name="RCON__PORIO">
        <value caption="A Power-up Reset has occurred due to IO Voltage." name="" value="0x1"/>
        <value caption="A Power-up Reset has not occurred due to IO Voltage." name="" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset Trigger" name="RSWRST__SWRST">
        <value caption="Enable software reset event" name="" value="0x1"/>
        <value caption="Do not enable software reset event" name="" value="0x0"/>
      </value-group>
      <value-group caption="NMI Reset counter value" name="RNMICON__NMICNT">
        <value caption="No delay between NMI assertion and device reset event" name="" value="0x0"/>
        <value caption="1 sys_clk cycle that Software has to clear the NMI event before a device reset is performed." name="" value="0x1"/>
        <value caption="2 sys_clk cycles that Software has to clear the NMI event before a device reset is performed." name="" value="0x2"/>
        <value caption="65535 sys_clk cycles that Software has to clear the NMI event before a device reset is performed." name="" value="0xffff"/>
      </value-group>
      <value-group caption="Watch-Dog Timer Time-Out in Sleep Flag bit" name="RNMICON__WDTS">
        <value caption="WDT Time-out has occurred during sleep_mode and caused a wake-up from sleep." name="" value="0x1"/>
        <value caption="WDT Time-out has not occurred during sleep_mode." name="" value="0x0"/>
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
        <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1"/>
        <value caption="FSCM has not detected clock failure" name="NO_FAILDET" value="0x0"/>
      </value-group>
      <value-group caption="Programmable Low Voltage Detect Event" name="RNMICON__LVD">
        <value caption="PLVD has detected a low voltage condition and caused an NMI" name="" value="0x1"/>
        <value caption="PLVD has not detected a low voltage condition" name="" value="0x0"/>
      </value-group>
      <value-group caption="External / Generic NMI Event" name="RNMICON__GNMI">
        <value caption="A general NMI event has been detected and caused an NMI" name="" value="0x1"/>
        <value caption="A general NMI event has not been detected." name="" value="0x0"/>
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
        <value caption="Writing a 1 to this bit will cause an NMI to be generated" name="" value="0x1"/>
        <value caption="Writing a 0 to this bit will have no effect." name="" value="0x0"/>
      </value-group>
      <value-group caption="Watchdog Timer Time-Out in Run Flag bit" name="RNMICON__WDTR">
        <value caption="WDT Time-out has occurred and caused a NMI." name="" value="0x1"/>
        <value caption="WDT Time-out has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="Deadman Timer Time-Out Flag bit" name="RNMICON__DMTO">
        <value caption="DMT Time-out has occurred and caused a NMI." name="" value="0x1"/>
        <value caption="DMT Time-out has not occurred." name="" value="0x0"/>
      </value-group>
      <value-group caption="Voltage Regulator Standby Enable bit" name="PWRCON__VREGS">
        <value caption="Main Voltage Regulator will remain active during Sleep" name="" value="0x1"/>
        <value caption="Main Voltage Regulator will go to standby mode during Sleep" name="" value="0x0"/>
      </value-group>
      <value-group caption="Controls Output level of the Voltage Regulators During SLEEP Mode" name="PWRCON__VRGSLP">
        <value caption="Main VREG Outputs are set to nominal voltage" name="" value="0x0"/>
        <value caption="Main VREG Outputs are set to reduced voltage (approx 67% nominal)" name="" value="0x1"/>
        <value caption="Main VREG Outputs are set to reduced voltage (approx 83% Nominal)" name="" value="0x2"/>
        <value caption="Main VREG Outputs are set to nominal voltage" name="" value="0x3"/>
      </value-group>
      <value-group caption="Controls Output level of the Voltage Regulators in Mission/Run Mode" name="PWRCON__VRGRUN">
        <value caption="Main VREG Outputs are set to nominal voltage" name="" value="0x0"/>
        <value caption="Main VREG Outputs are set to reduced voltage (approx 67% nominal)" name="" value="0x1"/>
        <value caption="Main VREG Outputs are set to reduced voltage (approx 83% Nominal)" name="" value="0x2"/>
        <value caption="Main VREG Outputs are set to nominal voltage" name="" value="0x3"/>
      </value-group>
    </module>
    <module caption="" id="00158" name="CRYPTO" version="1">
      <register-group name="CRYPTO">
        <register caption="Crypto Engine Revision" name="CEVER" offset="0x0" rw="R" size="4">
          <bitfield mask="0x0000FFFF" name="ID"/>
          <bitfield mask="0x00FF0000" name="VERSION"/>
          <bitfield mask="0xFF000000" name="REVISION"/>
        </register>
        <register caption="Crypto Engine Control Register" name="CECON" offset="0x4" rw="RW" size="4">
          <bitfield caption="DMA Enable bit" mask="0x00000001" name="DMAEN" values="CECON__DMAEN"/>
          <bitfield caption="Buffer Descriptor Processor Poll Enable bit" mask="0x00000002" name="BDPPLEN" values="CECON__BDPPLEN"/>
          <bitfield caption="Buffer Descriptor Processor Fetch Enable bit" mask="0x00000004" name="BDPCHST" values="CECON__BDPCHST"/>
          <bitfield caption="Input Data Swap Enable bit" mask="0x00000020" name="SWAPEN" values="CECON__SWAPEN"/>
          <bitfield caption="Software Reset bit" mask="0x00000040" name="SWRST" values="CECON__SWRST"/>
          <bitfield caption="Swap Output Data Enable bit" mask="0x00000080" name="SWAPOEN" values="CECON__SWAPOEN"/>
        </register>
        <register caption="Crypto Engine Buffer Descriptor Register" name="CEBDADDR" offset="0x8" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="BDPADDR"/>
        </register>
        <register caption="Crypto Engine Buffer Descriptor Processor Register" name="CEBDPADDR" offset="0xc" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="BASEADDR"/>
        </register>
        <register caption="Crypto Engine Status Register" name="CESTAT" offset="0x10" rw="R" size="4">
          <bitfield mask="0x0000FFFF" name="BDCTRL"/>
          <bitfield caption="Buffer Descriptor Processor Status bit" mask="0x00010000" name="ACTIVE" values="CESTAT__ACTIVE"/>
          <bitfield caption="DMA Start Status bit" mask="0x00020000" name="START" values="CESTAT__START"/>
          <bitfield caption="Buffer Descriptor Processor State Status bits" mask="0x003C0000" name="BDSTATE" values="CESTAT__BDSTATE"/>
          <bitfield caption="Internal Error Phase of DMA Status bits" mask="0x03000000" name="ERRPHASE" values="CESTAT__ERRPHASE"/>
          <bitfield caption="Internal Error Operation Status bits" mask="0x1C000000" name="ERROP" values="CESTAT__ERROP"/>
          <bitfield caption="Internal Error Mode Status bits" mask="0xE0000000" name="ERRMODE" values="CESTAT__ERRMODE"/>
        </register>
