Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="Crypto Engine Interrupt Source Register" name="CEINTSRC" offset="0x14" rw="R" size="4">
          <bitfield caption="Crypto Engine Interrupt Pending Status bit" mask="0x00000001" name="PENDIF" values="CEINTSRC__PENDIF"/>
          <bitfield caption="BD Transmit Status bit" mask="0x00000002" name="CBDIF" values="CEINTSRC__CBDIF"/>
          <bitfield caption="DMA Packet Completion Interrupt Status bit" mask="0x00000004" name="PKTIF" values="CEINTSRC__PKTIF"/>
          <bitfield caption="Access Response Error Interrupt bit" mask="0x00000008" name="AREIF" values="CEINTSRC__AREIF"/>
        </register>
        <register caption="Crypto Engine Interrupt Enable Register" name="CEINTEN" offset="0x18" rw="RW" size="4">
          <bitfield caption="Master Interrupt Enable bit" mask="0x00000001" name="PENDIE" values="CEINTEN__PENDIE"/>
          <bitfield caption="DMA Buffer Descriptor Processor Interrupt Enable bit" mask="0x00000002" name="BDPIE" values="CEINTEN__BDPIE"/>
          <bitfield caption="DMA Packet Completion Interrupt Enable bit" mask="0x00000004" name="PKTIE" values="CEINTEN__PKTIE"/>
          <bitfield caption="Access Response Error Interrupt Enable bit" mask="0x00000008" name="AREIE" values="CEINTEN__AREIE"/>
        </register>
        <register caption="Crypto Engine Poll Control Register" name="CEPOLLCON" offset="0x1c" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="BDPPLCON"/>
        </register>
        <register caption="Crypto Engine Header Length Register" name="CEHDLEN" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="HDRLEN"/>
        </register>
        <register caption="Crypto Engine Trailer Length Register" name="CETRLLEN" offset="0x24" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="TRLRLEN"/>
        </register>
        <register caption="" name="CEDTXSTAT" offset="0x28" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="DTXSTATE"/>
          <bitfield mask="0x000FFFF0" name="DTXBLEN"/>
        </register>
        <register caption="" name="CEDRXSTAT" offset="0x2c" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="DRXSTATE"/>
          <bitfield mask="0x000FFFF0" name="DRXBLEN"/>
        </register>
        <register caption="" name="CEDCRYPTOADDR" offset="0x30" rw="R" size="4">
          <bitfield mask="0x0000000F" name="CRYPTOADDR"/>
        </register>
        <register caption="" name="CEDHASHADDR" offset="0x34" rw="R" size="4">
          <bitfield mask="0x0000000F" name="HASHADDR"/>
        </register>
        <register caption="" name="CEDTXADDR" offset="0x38" rw="R" size="4">
          <bitfield mask="0x00000003" name="TXDADDR"/>
        </register>
        <register caption="" name="CEDML0ADDR" offset="0x3c" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="ML0ADDR"/>
        </register>
        <register caption="" name="CEDML1ADDR" offset="0x40" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="ML1ADDR"/>
        </register>
        <register caption="" name="CEDOL0ADDR" offset="0x44" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="OL0ADDR"/>
        </register>
        <register caption="" name="CEDCSTADDDR" offset="0x48" rw="R" size="4">
          <bitfield mask="0x0000000F" name="CSTATEADDR"/>
        </register>
        <register caption="" name="CEDMTSKADDR" offset="0x4c" rw="R" size="4">
          <bitfield mask="0x00000003" name="MTASKADDR"/>
        </register>
        <register caption="" name="CEDSACON" offset="0x50" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="SACON"/>
        </register>
        <register caption="" name="CEDCSTATE" offset="0x54" rw="R" size="4">
          <bitfield mask="0x0000000F" name="CSTATE"/>
        </register>
        <register caption="" name="CEDTXBCNT" offset="0x58" rw="R" size="4">
          <bitfield mask="0x0000001F" name="CTXBCNT"/>
        </register>
        <register caption="" name="CEDRXBCNT" offset="0x5c" rw="R" size="4">
          <bitfield mask="0x0000007F" name="DRXBCNT"/>
        </register>
      </register-group>
      <value-group caption="DMA Enable bit" name="CECON__DMAEN">
        <value caption="Crypto Engine DMA is enabled" name="" value="0x1"/>
        <value caption="Crypto Engine DMA is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor Poll Enable bit" name="CECON__BDPPLEN">
        <value caption="Poll for descriptor until valid bit is set" name="" value="0x1"/>
        <value caption="Do not poll" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor Fetch Enable bit" name="CECON__BDPCHST">
        <value caption="BDP descriptor fetch is enabled" name="" value="0x1"/>
        <value caption="BDP descriptor fetch is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Input Data Swap Enable bit" name="CECON__SWAPEN">
        <value caption="Input data is byte swapped when read by dedicated DMA" name="" value="0x1"/>
        <value caption="Input data is not byte swapped when read by dedicated DMA" name="" value="0x0"/>
      </value-group>
      <value-group caption="Software Reset bit" name="CECON__SWRST">
        <value caption="Initiate a software reset of the Crypto Engine" name="" value="0x1"/>
        <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Swap Output Data Enable bit" name="CECON__SWAPOEN">
        <value caption="Output data is byte swapped when written by dedicated DMA" name="" value="0x1"/>
        <value caption="Output data is not byte swapped when written by dedicated DMA" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor Status bit" name="CESTAT__ACTIVE">
        <value caption="BDP is active" name="" value="0x1"/>
        <value caption="BDP is idle" name="" value="0x0"/>
      </value-group>
