Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="DMA Start Status bit" name="CESTAT__START">
        <value caption="DMA start has occurred" name="" value="0x1"/>
        <value caption="DMA start has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor State Status bits" name="CESTAT__BDSTATE">
        <value caption="Reserved" name="" value="0xf"/>
        <value caption="Reserved" name="" value="0xe"/>
        <value caption="Reserved" name="" value="0xd"/>
        <value caption="Reserved" name="" value="0xc"/>
        <value caption="Reserved" name="" value="0xb"/>
        <value caption="Reserved" name="" value="0xa"/>
        <value caption="Reserved" name="" value="0x9"/>
        <value caption="Reserved" name="" value="0x8"/>
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="SA fetch" name="" value="0x6"/>
        <value caption="Fetch BDP is disabled" name="" value="0x5"/>
        <value caption="Descriptor is done" name="" value="0x4"/>
        <value caption="Data phase" name="" value="0x3"/>
        <value caption="BDP is loading" name="" value="0x2"/>
        <value caption="Descriptor fetch request is pending" name="" value="0x1"/>
        <value caption="BDP is idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Internal Error Phase of DMA Status bits" name="CESTAT__ERRPHASE">
        <value caption="Destination data" name="" value="0x3"/>
        <value caption="Source data" name="" value="0x2"/>
        <value caption="Security Association (SA) access" name="" value="0x1"/>
        <value caption="Buffer Descriptor (BD) access" name="" value="0x0"/>
      </value-group>
      <value-group caption="Internal Error Operation Status bits" name="CESTAT__ERROP">
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="Reserved" name="" value="0x6"/>
        <value caption="Reserved" name="" value="0x5"/>
        <value caption="Authentication" name="" value="0x4"/>
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="Decryption" name="" value="0x2"/>
        <value caption="Encryption" name="" value="0x1"/>
        <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Internal Error Mode Status bits" name="CESTAT__ERRMODE">
        <value caption="Reserved" name="" value="0x7"/>
        <value caption="Reserved" name="" value="0x6"/>
        <value caption="Reserved" name="" value="0x5"/>
        <value caption="Reserved" name="" value="0x4"/>
        <value caption="CEK operation" name="" value="0x3"/>
        <value caption="KEK operation" name="" value="0x2"/>
        <value caption="Preboot authentication" name="" value="0x1"/>
        <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Crypto Engine Interrupt Pending Status bit" name="CEINTSRC__PENDIF">
        <value caption="Crypto Engine interrupt is pending (this value is the result of an OR of all interrupts in the Crypto Engine)" name="" value="0x1"/>
        <value caption="Crypto Engine interrupt is not pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="BD Transmit Status bit" name="CEINTSRC__CBDIF">
        <value caption="Last BD transmit was processed" name="" value="0x1"/>
        <value caption="Last BD transmit has not been processed" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Packet Completion Interrupt Status bit" name="CEINTSRC__PKTIF">
        <value caption="DMA packet was completed" name="" value="0x1"/>
        <value caption="DMA packet was not completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Access Response Error Interrupt bit" name="CEINTSRC__AREIF">
        <value caption="Error occurred trying to access memory outside the Crypto Engine" name="" value="0x1"/>
        <value caption="No error has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Master Interrupt Enable bit" name="CEINTEN__PENDIE">
        <value caption="Crypto Engine interrupts are enabled" name="" value="0x1"/>
        <value caption="Crypto Engine interrupts are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor Interrupt Enable bit" name="CEINTEN__BDPIE">
        <value caption="BDP interrupts are enabled" name="" value="0x1"/>
        <value caption="BDP interrupts are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Packet Completion Interrupt Enable bit" name="CEINTEN__PKTIE">
        <value caption="DMA packet completion interrupts are enabled" name="" value="0x1"/>
        <value caption="DMA packet completion interrupts are not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Access Response Error Interrupt Enable bit" name="CEINTEN__AREIE">
        <value caption="Access response error interrupts are enabled" name="" value="0x1"/>
        <value caption="Access response error interrupts are not enabled" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="03367" name="CVD" version="1">
      <register-group name="CVD">
        <register caption="" name="CVDCON" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x0000000F" name="TRIGGER"/>
          <bitfield mask="0x00000030" name="CLKSEL"/>
          <bitfield mask="0x0003FF00" name="FIFOTH"/>
          <bitfield mask="0x00040000" name="FIFOIEN"/>
          <bitfield mask="0x00800000" name="THSTR"/>
          <bitfield mask="0x01000000" name="SWTRIG"/>
          <bitfield mask="0x02000000" name="ABORT"/>
          <bitfield mask="0x08000000" name="SDHOLD"/>
          <bitfield mask="0x10000000" name="ORDER"/>
          <bitfield mask="0x20000000" name="SIDL"/>
          <bitfield mask="0x40000000" name="FRZ"/>
          <bitfield mask="0x80000000" name="ON"/>
        </register>
        <register caption="" name="CVDADC" offset="0x4" rw="RW" size="4">
          <bitfield mask="0x00FFFFFF" name="ADCCON"/>
        </register>
