Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="CRC Bit Order Selection bit" name="DCRCCON__BITO">
        <value caption="(When CRCTYP (ie" name="" value="0x1"/>
        <value caption="(When CRCTYP (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC Write Byte Order Selection bit" name="DCRCCON__WBO">
        <value caption="Source data is written to the destination re-ordered as defined by BYTO" name="" value="0x1"/>
        <value caption="Source data is written to the destination unaltered" name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC Byte Order Selection bits" name="DCRCCON__BYTO">
        <value caption="Endian byte swap on half-word boundaries (i.e." name="" value="0x3"/>
        <value caption="Swap half-words on word boundaries (i.e." name="" value="0x2"/>
        <value caption="Endian byte swap on word boundaries (i.e." name="" value="0x1"/>
        <value caption="No swapping (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="CRC Data Register bits" name="DCRCDATA__DCRCDATA">
        <value caption="(CRC module is in IP Header mode) Only the lower 16 bits contain IP header checksum information. Seed with 0 / (CRC module is in LFSR mode) Seed with 0" name="" value="0x0"/>
        <value caption="(CRC module is in IP Header mode) Only the lower 16 bits contain IP header checksum information. Seed with 1 / (CRC module is in LFSR mode) Seed with 1" name="" value="0x1"/>
        <value caption="(CRC module is in IP Header mode) Only the lower 16 bits contain IP header checksum information. Seed with ffffffff / (CRC module is in LFSR mode) Seed with ffffffff" name="" value="0xffffffff"/>
      </value-group>
      <value-group caption="CRC XOR Register bits" name="DCRCXOR__DCRCXOR">
        <value caption="(When CRCTYP (i.e." name="" value="0x1"/>
        <value caption="(When CRCTYP (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH0CON__CHPRI">
        <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3"/>
        <value caption="Channel has priority 2" name="CHPRI2" value="0x2"/>
        <value caption="Channel has priority 1" name="CHPRI1" value="0x1"/>
        <value caption="Channel has priority 0" name="CHPRI0" value="0x0"/>
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH0CON__CHEDET">
        <value caption="An event has been detected" name="" value="0x1"/>
        <value caption="No events have been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH0CON__CHAEN">
        <value caption="Channel is continuously enabled" name="" value="0x1"/>
        <value caption="Channel is disabled on block transfer complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH0CON__CHCHN">
        <value caption="Allow channel to be chained" name="" value="0x1"/>
        <value caption="Do not allow channel to be chained" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH0CON__CHAED">
        <value caption="Channel start/abort events will be registered" name="" value="0x1"/>
        <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH0CON__CHEN">
        <value caption="Channel is enabled" name="" value="0x1"/>
        <value caption="Channel is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH0CON__CHCHNS">
        <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1"/>
        <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Pattern Length bit" name="DCH0CON__CHPATLEN">
        <value caption="2 byte length" name="" value="0x1"/>
        <value caption="1 byte length" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Pattern Ignore Byte bit" name="DCH0CON__CHPIGNEN">
        <value caption="Treat any byte that matches the CHPIGN bits as a dont care when pattern matching is enabled" name="" value="0x1"/>
        <value caption="Disable this feature" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH0CON__CHBUSY">
        <value caption="Channel is active or has been enabled" name="" value="0x1"/>
        <value caption="Channel is inactive or has been disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH1CON__CHPRI">
        <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3"/>
        <value caption="Channel has priority 2" name="CHPRI2" value="0x2"/>
        <value caption="Channel has priority 1" name="CHPRI1" value="0x1"/>
        <value caption="Channel has priority 0" name="CHPRI0" value="0x0"/>
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH1CON__CHEDET">
        <value caption="An event has been detected" name="" value="0x1"/>
        <value caption="No events have been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH1CON__CHAEN">
        <value caption="Channel is continuously enabled" name="" value="0x1"/>
        <value caption="Channel is disabled on block transfer complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH1CON__CHCHN">
        <value caption="Allow channel to be chained" name="" value="0x1"/>
        <value caption="Do not allow channel to be chained" name="" value="0x0"/>
      </value-group>
