Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="DMA RAM access priority" name="DEVCFG0__DMAPRI">
        <value caption="DMA gets High Priority access to SRAM" name="HIGH" value="0x1"/>
        <value caption="DMA gets least recently used arbitration to RAM" name="LRSA" value="0x0"/>
      </value-group>
      <value-group caption="CPU RAM access priority" name="DEVCFG0__EXLPRI">
        <value caption="CPU gets high priority access to RAM" name="HIGH" value="0x1"/>
        <value caption="CPU gets least recently used arbitration to RAM" name="LRSA" value="0x0"/>
      </value-group>
      <value-group caption="USB Suspend Sleep Enable" name="DEVCFG0__USBSSEN">
        <value caption="USB FREF clock is shut down when suspend mode is active" name="ON" value="0x1"/>
        <value caption="USB FREF clock continues to run when suspend mode is active" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="PMU Controller Register LOCK" name="DEVCFG0__PMULOCK">
        <value caption="PMU SFR bits are locked and cannot be modified" name="ON" value="0x1"/>
        <value caption="PMU SFR bits are not locked and can be modified" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Permission Group LOCK" name="DEVCFG0__PGLOCK">
        <value caption="CFGPG SFR bits are locked and cannot be modified" name="ON" value="0x1"/>
        <value caption="CFGPG SFR bits are not locked and can be modified" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Peripheral Module Disable (PMD) LOCK" name="DEVCFG0__PMDLOCK">
        <value caption="PMDx SFR bits are locked and cannot be modified" name="ON" value="0x1"/>
        <value caption="PMDx SFR bits are not locked and can be modified" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="IO LOCK" name="DEVCFG0__IOLOCK">
        <value caption="IO Remap SFR bits are locked and cannot be modified" name="ON" value="0x1"/>
        <value caption="IO Remap SFR are not locked and can be modified" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Configuration Register Lock" name="DEVCFG0__CFGLOCK">
        <value caption="All NVR memory self-writes, BCFG0 and System Config registers, are not locked and can be written - CFGLOCK value can be changed" name="OFF" value="0x0"/>
        <value caption="All NVR memory self-writes, BCFG0 and System Config registers, are locked and can not be written - CFGLOCK value can be changed" name="ON_W" value="0x2"/>
        <value caption="All NVR memory self-writes, BCFG0 and System Config registers, are locked and can not be written - CFGLOCK value can not be changed" name="ON" value="0x3"/>
      </value-group>
      <value-group caption="OCMP Alternate Clock Selection" name="DEVCFG0__OC_ACLK">
        <value caption="OCMP module use an alternative TMR pair as their timebase clock" name="OCMP_ALT_TMR" value="0x1"/>
        <value caption="All OCMP Modules use TMR2/TMR3 as their timebase clock" name="OCMP_TMR2_TMR3" value="0x0"/>
      </value-group>
      <value-group caption="ICAP Alternate Clock Selection" name="DEVCFG0__IC_ACLK">
        <value caption="ICAP module use an alternative TMR pair as their timebase clock" name="ICAP_ALT_TMR" value="0x1"/>
        <value caption="All ICAP Modules use TMR2/TMR3 as their timebase clock" name="ICAP_TMR2_TMR3" value="0x0"/>
      </value-group>
      <value-group caption="P-Cache cache-ability control" name="DEVCFG0__PCM">
        <value caption="PCHE cache-ability is controlled by CPU" name="CPU" value="0x0"/>
        <value caption="PCHE cache-ability is controled by SFR" name="SFR" value="0x1"/>
      </value-group>
      <value-group caption="UPLL HW Control Mode for power down and RESET" name="DEVCFG0__UPLLHWMD">
        <value caption="UPLL PWDN and RESET are generated by HW" name="ON" value="0x1"/>
        <value caption="UPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="SPLL HW Control Mode for power down and RESET" name="DEVCFG0__SPLLHWMD">
        <value caption="SPLL PWDN and RESET are generated by HW" name="ON" value="0x1"/>
        <value caption="SPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="BTPLL HW Control Mode for power down and RESET" name="DEVCFG0__BTPLLHWMD">
        <value caption="BTPLL PWDN and RESET are generated by HW" name="ON" value="0x1"/>
        <value caption="BTPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Ethernet PLL HW Control Mode for power down and RESET" name="DEVCFG0__ETHPLLHWMD">
        <value caption="ETHPLL PWDN and RESET are generated by HW" name="ON" value="0x1"/>
        <value caption="ETHPLL PWDN and RESET are generated by SW using corresponding PLLCON register bits" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="Dynamic Flash ECC Configuration" name="DEVCFG0__FECCCON">
        <value caption="Flash ECC is enabled" name="ON" value="0x0"/>
        <value caption="Dynamic Flash ECC is enabled" name="DYNAMIC" value="0x1"/>
        <value caption="ECC and Dynamic ECC are disabled" name="OFF" value="0x2"/>
      </value-group>
      <value-group caption="Ethernet Tx SOF control for CTR measurements" name="DEVCFG0__ETHTPSF">
        <value caption="TPSF is enabled in CTR measurement" name="TPSF" value="0x1"/>
        <value caption="RPSF is enabled in CTR measurement" name="RPSF" value="0x0"/>
      </value-group>
      <value-group caption="External Programming Clock enable" name="DEVCFG0__EPGMCLK">
        <value caption="In ICSP (TMOD0) mode, enable the FRC clock to be driven by the TSTFRC Pin Function" name="TSTFRC" value="0x1"/>
        <value caption="In ICSP (TMOD0) mode, the FRC clock is always driven by the FRC oscillator" name="FRC" value="0x0"/>
      </value-group>
      <value-group caption="Buck mode switching control" name="FBCFG0__BUHSWEN">
        <value caption="Buck mode is switched in HW at POR before CPU is allowed to boot" name="ON" value="0x1"/>
        <value caption="Buck switching is disabled in HW at POR. Enable from SW" name="OFF" value="0x0"/>
      </value-group>
      <value-group caption="PCache Single cache Mode" name="FBCFG0__PCSCMODE">
        <value caption="PCHE ICache Only.CPU Instructions (code, data) go to PCHE ONLY." name="SINGLE" value="0x1"/>
        <value caption="PCHE ICache and DCache. CPU opcodes go to PCEHE ICache port and data goes to PCHE" name="DUAL" value="0x0"/>
      </value-group>
      <value-group caption="Boot and exception code mode" name="FBCFG0__BOOTISA">
        <value caption="Boot code and Exception code is MIPS32" name="MIPS32" value="0x1"/>
        <value caption="Boot code and Exception code is microMIPS" name="MICROMIPS" value="0x0"/>
      </value-group>
      <value-group caption="Boot Code Protect" name="FCPN0__CP">
        <value caption="Protection Disabled" name="DISABLED" value="0x0"/>
        <value caption="Protection Enabled" name="ENABLED" value="0x1"/>
      </value-group>
    </module>
    <module caption="" id="02467" name="GPIO" version="1">
      <register-group name="GPIO">
        <register caption="" name="ANSELA" offset="0x0" rw="RW" size="4">
          <bitfield mask="0x400" name="ANSA10"/>
          <bitfield mask="0x1000" name="ANSA12"/>
          <bitfield mask="0x2000" name="ANSA13"/>
          <bitfield mask="0x4000" name="ANSA14"/>
          <bitfield mask="0x8000" name="ANSA15"/>
        </register>
        <register caption="" name="ANSELB" offset="0x100" rw="RW" size="4">
          <bitfield mask="0x1" name="ANSB0"/>
          <bitfield mask="0x2" name="ANSB1"/>
          <bitfield mask="0x4" name="ANSB2"/>
          <bitfield mask="0x8" name="ANSB3"/>
          <bitfield mask="0x10" name="ANSB4"/>
          <bitfield mask="0x20" name="ANSB5"/>
          <bitfield mask="0x40" name="ANSB6"/>
          <bitfield mask="0x80" name="ANSB7"/>
          <bitfield mask="0x100" name="ANSB8"/>
          <bitfield mask="0x200" name="ANSB9"/>
          <bitfield mask="0x400" name="ANSB10"/>
          <bitfield mask="0x800" name="ANSB11"/>
          <bitfield mask="0x1000" name="ANSB12"/>
          <bitfield mask="0x2000" name="ANSB13"/>
          <bitfield mask="0x4000" name="ANSB14"/>
        </register>
