Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="" name="ANSELK" offset="0x300" rw="RW" size="4">
          <bitfield mask="0x4" name="ANSK2"/>
          <bitfield mask="0x8" name="ANSK3"/>
        </register>
        <register caption="" name="TRISA" offset="0x10" rw="RW" size="4">
          <bitfield mask="0x1" name="TRISA0"/>
          <bitfield mask="0x2" name="TRISA1"/>
          <bitfield mask="0x4" name="TRISA2"/>
          <bitfield mask="0x8" name="TRISA3"/>
          <bitfield mask="0x10" name="TRISA4"/>
          <bitfield mask="0x20" name="TRISA5"/>
          <bitfield mask="0x40" name="TRISA6"/>
          <bitfield mask="0x80" name="TRISA7"/>
          <bitfield mask="0x100" name="TRISA8"/>
          <bitfield mask="0x200" name="TRISA9"/>
          <bitfield mask="0x400" name="TRISA10"/>
          <bitfield mask="0x800" name="TRISA11"/>
          <bitfield mask="0x1000" name="TRISA12"/>
          <bitfield mask="0x2000" name="TRISA13"/>
          <bitfield mask="0x4000" name="TRISA14"/>
          <bitfield mask="0x8000" name="TRISA15"/>
        </register>
        <register caption="" name="TRISB" offset="0x110" rw="RW" size="4">
          <bitfield mask="0x1" name="TRISB0"/>
          <bitfield mask="0x2" name="TRISB1"/>
          <bitfield mask="0x4" name="TRISB2"/>
          <bitfield mask="0x8" name="TRISB3"/>
          <bitfield mask="0x10" name="TRISB4"/>
          <bitfield mask="0x20" name="TRISB5"/>
          <bitfield mask="0x40" name="TRISB6"/>
          <bitfield mask="0x80" name="TRISB7"/>
          <bitfield mask="0x100" name="TRISB8"/>
          <bitfield mask="0x200" name="TRISB9"/>
          <bitfield mask="0x400" name="TRISB10"/>
          <bitfield mask="0x800" name="TRISB11"/>
          <bitfield mask="0x1000" name="TRISB12"/>
          <bitfield mask="0x2000" name="TRISB13"/>
          <bitfield mask="0x4000" name="TRISB14"/>
        </register>
        <register caption="" name="TRISC" offset="0x210" rw="RW" size="4">
          <bitfield mask="0x1" name="TRISC0"/>
          <bitfield mask="0x2" name="TRISC1"/>
          <bitfield mask="0x4" name="TRISC2"/>
          <bitfield mask="0x8" name="TRISC3"/>
          <bitfield mask="0x10" name="TRISC4"/>
          <bitfield mask="0x20" name="TRISC5"/>
          <bitfield mask="0x40" name="TRISC6"/>
          <bitfield mask="0x80" name="TRISC7"/>
          <bitfield mask="0x100" name="TRISC8"/>
          <bitfield mask="0x200" name="TRISC9"/>
          <bitfield mask="0x400" name="TRISC10"/>
          <bitfield mask="0x800" name="TRISC11"/>
          <bitfield mask="0x1000" name="TRISC12"/>
          <bitfield mask="0x2000" name="TRISC13"/>
          <bitfield mask="0x4000" name="TRISC14"/>
          <bitfield mask="0x8000" name="TRISC15"/>
        </register>
        <register caption="" name="TRISK" offset="0x310" rw="RW" size="4">
          <bitfield mask="0x1" name="TRISK0"/>
          <bitfield mask="0x2" name="TRISK1"/>
          <bitfield mask="0x4" name="TRISK2"/>
          <bitfield mask="0x8" name="TRISK3"/>
          <bitfield mask="0x10" name="TRISK4"/>
          <bitfield mask="0x20" name="TRISK5"/>
          <bitfield mask="0x40" name="TRISK6"/>
          <bitfield mask="0x80" name="TRISK7"/>
          <bitfield mask="0x100" name="TRISK8"/>
          <bitfield mask="0x200" name="TRISK9"/>
          <bitfield mask="0x400" name="TRISK10"/>
          <bitfield mask="0x800" name="TRISK11"/>
          <bitfield mask="0x1000" name="TRISK12"/>
          <bitfield mask="0x2000" name="TRISK13"/>
          <bitfield mask="0x4000" name="TRISK14"/>
        </register>
        <register caption="" name="PORTA" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x1" name="RA0"/>
          <bitfield mask="0x2" name="RA1"/>
          <bitfield mask="0x4" name="RA2"/>
          <bitfield mask="0x8" name="RA3"/>
          <bitfield mask="0x10" name="RA4"/>
          <bitfield mask="0x20" name="RA5"/>
          <bitfield mask="0x40" name="RA6"/>
          <bitfield mask="0x80" name="RA7"/>
          <bitfield mask="0x100" name="RA8"/>
          <bitfield mask="0x200" name="RA9"/>
          <bitfield mask="0x400" name="RA10"/>
          <bitfield mask="0x800" name="RA11"/>
          <bitfield mask="0x1000" name="RA12"/>
          <bitfield mask="0x2000" name="RA13"/>
          <bitfield mask="0x4000" name="RA14"/>
          <bitfield mask="0x8000" name="RA15"/>
        </register>
        <register caption="" name="PORTB" offset="0x120" rw="RW" size="4">
          <bitfield mask="0x1" name="RB0"/>
          <bitfield mask="0x2" name="RB1"/>
          <bitfield mask="0x4" name="RB2"/>
          <bitfield mask="0x8" name="RB3"/>
          <bitfield mask="0x10" name="RB4"/>
          <bitfield mask="0x20" name="RB5"/>
          <bitfield mask="0x40" name="RB6"/>
          <bitfield mask="0x80" name="RB7"/>
          <bitfield mask="0x100" name="RB8"/>
          <bitfield mask="0x200" name="RB9"/>
          <bitfield mask="0x400" name="RB10"/>
          <bitfield mask="0x800" name="RB11"/>
          <bitfield mask="0x1000" name="RB12"/>
          <bitfield mask="0x2000" name="RB13"/>
          <bitfield mask="0x4000" name="RB14"/>
        </register>
        <register caption="" name="PORTC" offset="0x220" rw="RW" size="4">
          <bitfield mask="0x1" name="RC0"/>
          <bitfield mask="0x2" name="RC1"/>
          <bitfield mask="0x4" name="RC2"/>
          <bitfield mask="0x8" name="RC3"/>
          <bitfield mask="0x10" name="RC4"/>
          <bitfield mask="0x20" name="RC5"/>
          <bitfield mask="0x40" name="RC6"/>
          <bitfield mask="0x80" name="RC7"/>
          <bitfield mask="0x100" name="RC8"/>
          <bitfield mask="0x200" name="RC9"/>
          <bitfield mask="0x400" name="RC10"/>
          <bitfield mask="0x800" name="RC11"/>
          <bitfield mask="0x1000" name="RC12"/>
          <bitfield mask="0x2000" name="RC13"/>
          <bitfield mask="0x4000" name="RC14"/>
          <bitfield mask="0x8000" name="RC15"/>
        </register>
        <register caption="" name="PORTK" offset="0x320" rw="RW" size="4">
          <bitfield mask="0x1" name="RK0"/>
          <bitfield mask="0x2" name="RK1"/>
          <bitfield mask="0x4" name="RK2"/>
          <bitfield mask="0x8" name="RK3"/>
          <bitfield mask="0x10" name="RK4"/>
          <bitfield mask="0x20" name="RK5"/>
          <bitfield mask="0x40" name="RK6"/>
          <bitfield mask="0x80" name="RK7"/>
          <bitfield mask="0x100" name="RK8"/>
          <bitfield mask="0x200" name="RK9"/>
          <bitfield mask="0x400" name="RK10"/>
          <bitfield mask="0x800" name="RK11"/>
          <bitfield mask="0x1000" name="RK12"/>
          <bitfield mask="0x2000" name="RK13"/>
          <bitfield mask="0x4000" name="RK14"/>
        </register>
        <register caption="" name="LATA" offset="0x30" rw="RW" size="4">
          <bitfield mask="0x1" name="LATA0"/>
          <bitfield mask="0x2" name="LATA1"/>
          <bitfield mask="0x4" name="LATA2"/>
          <bitfield mask="0x8" name="LATA3"/>
          <bitfield mask="0x10" name="LATA4"/>
          <bitfield mask="0x20" name="LATA5"/>
          <bitfield mask="0x40" name="LATA6"/>
          <bitfield mask="0x80" name="LATA7"/>
          <bitfield mask="0x100" name="LATA8"/>
          <bitfield mask="0x200" name="LATA9"/>
          <bitfield mask="0x400" name="LATA10"/>
          <bitfield mask="0x800" name="LATA11"/>
          <bitfield mask="0x1000" name="LATA12"/>
          <bitfield mask="0x2000" name="LATA13"/>
          <bitfield mask="0x4000" name="LATA14"/>
          <bitfield mask="0x8000" name="LATA15"/>
        </register>
        <register caption="" name="LATB" offset="0x130" rw="RW" size="4">
          <bitfield mask="0x1" name="LATB0"/>
          <bitfield mask="0x2" name="LATB1"/>
          <bitfield mask="0x4" name="LATB2"/>
          <bitfield mask="0x8" name="LATB3"/>
          <bitfield mask="0x10" name="LATB4"/>
          <bitfield mask="0x20" name="LATB5"/>
          <bitfield mask="0x40" name="LATB6"/>
          <bitfield mask="0x80" name="LATB7"/>
          <bitfield mask="0x100" name="LATB8"/>
          <bitfield mask="0x200" name="LATB9"/>
          <bitfield mask="0x400" name="LATB10"/>
          <bitfield mask="0x800" name="LATB11"/>
          <bitfield mask="0x1000" name="LATB12"/>
          <bitfield mask="0x2000" name="LATB13"/>
          <bitfield mask="0x4000" name="LATB14"/>
        </register>
        <register caption="" name="LATC" offset="0x230" rw="RW" size="4">
          <bitfield mask="0x1" name="LATC0"/>
          <bitfield mask="0x2" name="LATC1"/>
          <bitfield mask="0x4" name="LATC2"/>
          <bitfield mask="0x8" name="LATC3"/>
          <bitfield mask="0x10" name="LATC4"/>
          <bitfield mask="0x20" name="LATC5"/>
          <bitfield mask="0x40" name="LATC6"/>
          <bitfield mask="0x80" name="LATC7"/>
          <bitfield mask="0x100" name="LATC8"/>
          <bitfield mask="0x200" name="LATC9"/>
          <bitfield mask="0x400" name="LATC10"/>
          <bitfield mask="0x800" name="LATC11"/>
          <bitfield mask="0x1000" name="LATC12"/>
          <bitfield mask="0x2000" name="LATC13"/>
          <bitfield mask="0x4000" name="LATC14"/>
          <bitfield mask="0x8000" name="LATC15"/>
        </register>
        <register caption="" name="LATK" offset="0x330" rw="RW" size="4">
          <bitfield mask="0x1" name="LATK0"/>
          <bitfield mask="0x2" name="LATK1"/>
          <bitfield mask="0x4" name="LATK2"/>
          <bitfield mask="0x8" name="LATK3"/>
          <bitfield mask="0x10" name="LATK4"/>
          <bitfield mask="0x20" name="LATK5"/>
          <bitfield mask="0x40" name="LATK6"/>
          <bitfield mask="0x80" name="LATK7"/>
          <bitfield mask="0x100" name="LATK8"/>
          <bitfield mask="0x200" name="LATK9"/>
          <bitfield mask="0x400" name="LATK10"/>
          <bitfield mask="0x800" name="LATK11"/>
          <bitfield mask="0x1000" name="LATK12"/>
          <bitfield mask="0x2000" name="LATK13"/>
          <bitfield mask="0x4000" name="LATK14"/>
        </register>
