Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Acknowledge Time Status bit" name="I2C1STAT__ACKTIM">
        <value caption="I2C bus is in an Acknowledge sequence" name="" value="0x1"/>
        <value caption="Not an Acknowledge sequence" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Status bit" name="I2C1STAT__TRSTAT">
        <value caption="Master transmit is in progress (8 bits + ACK)" name="" value="0x1"/>
        <value caption="Master transmit is not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Status bit" name="I2C1STAT__ACKSTAT">
        <value caption="NACK received from slave" name="" value="0x1"/>
        <value caption="ACK received from slave" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="I2C2STAT__TBF">
        <value caption="Transmit in progress" name="" value="0x1"/>
        <value caption="Transmit complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Full Status bit" name="I2C2STAT__RBF">
        <value caption="Receive complete" name="" value="0x1"/>
        <value caption="Receive not complete" name="" value="0x0"/>
      </value-group>
      <value-group caption="Read/Write Information bit" name="I2C2STAT__R_W">
        <value caption="Read indicates data transfer is output from slave" name="" value="0x1"/>
        <value caption="Write indicates data transfer is input to slave" name="" value="0x0"/>
      </value-group>
      <value-group caption="Start bit" name="I2C2STAT__S">
        <value caption="Indicates that a Start (or Repeated Start) bit has been detected last" name="" value="0x1"/>
        <value caption="Start bit was not detected last" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop bit" name="I2C2STAT__P">
        <value caption="Indicates that a Stop bit has been detected last" name="" value="0x1"/>
        <value caption="Stop bit was not detected last" name="" value="0x0"/>
      </value-group>
      <value-group caption="Data/Address bit" name="I2C2STAT__D_A">
        <value caption="Indicates that the last byte received was data" name="" value="0x1"/>
        <value caption="Indicates that the last byte received was device address" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="I2C2STAT__I2COV">
        <value caption="A byte was received while the I2CxRCV register is still holding the previous byte" name="" value="0x1"/>
        <value caption="No overflow" name="" value="0x0"/>
      </value-group>
      <value-group caption="Write Collision Detect bit" name="I2C2STAT__IWCOL">
        <value caption="An attempt to write the I2CxTRN register failed because the I2C module is busy" name="" value="0x1"/>
        <value caption="No collision" name="" value="0x0"/>
      </value-group>
      <value-group caption="10-bit Address Status bit" name="I2C2STAT__ADD10">
        <value caption="10-bit address was matched" name="" value="0x1"/>
        <value caption="10-bit address was not matched" name="" value="0x0"/>
      </value-group>
      <value-group caption="General Call Status bit" name="I2C2STAT__GCSTAT">
        <value caption="General call address was received" name="" value="0x1"/>
        <value caption="General call address was not received" name="" value="0x0"/>
      </value-group>
      <value-group caption="Master Bus Collision Detect bit" name="I2C2STAT__BCL">
        <value caption="A bus collision has been detected during a master operation" name="" value="0x1"/>
        <value caption="No collision" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Time Status bit" name="I2C2STAT__ACKTIM">
        <value caption="I2C bus is in an Acknowledge sequence" name="" value="0x1"/>
        <value caption="Not an Acknowledge sequence" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Status bit" name="I2C2STAT__TRSTAT">
        <value caption="Master transmit is in progress (8 bits + ACK)" name="" value="0x1"/>
        <value caption="Master transmit is not in progress" name="" value="0x0"/>
      </value-group>
      <value-group caption="Acknowledge Status bit" name="I2C2STAT__ACKSTAT">
        <value caption="NACK received from slave" name="" value="0x1"/>
        <value caption="ACK received from slave" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="00740" name="ICAP" version="1">
      <register-group name="ICAP">
        <register caption="Input Capture 1 Control Register" name="IC1CON" offset="0x0" rw="RW" size="4">
          <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC1CON__ICM"/>
          <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC1CON__ICBNE"/>
          <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC1CON__ICOV"/>
          <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC1CON__ICI"/>
          <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC1CON__ICTMR"/>
          <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC1CON__C32"/>
          <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC1CON__FEDGE"/>
          <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC1CON__SIDL"/>
          <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC1CON__ON"/>
        </register>
        <register caption="Input Capture 1 Control Register" name="IC2CON" offset="0x200" rw="RW" size="4">
          <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC2CON__ICM"/>
          <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC2CON__ICBNE"/>
          <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC2CON__ICOV"/>
          <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC2CON__ICI"/>
          <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC2CON__ICTMR"/>
          <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC2CON__C32"/>
          <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC2CON__FEDGE"/>
          <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC2CON__SIDL"/>
          <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC2CON__ON"/>
        </register>
        <register caption="Input Capture 1 Control Register" name="IC3CON" offset="0x400" rw="RW" size="4">
          <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC3CON__ICM"/>
          <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC3CON__ICBNE"/>
          <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC3CON__ICOV"/>
          <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC3CON__ICI"/>
          <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC3CON__ICTMR"/>
          <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC3CON__C32"/>
          <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC3CON__FEDGE"/>
          <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC3CON__SIDL"/>
          <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC3CON__ON"/>
        </register>
        <register caption="Input Capture 1 Control Register" name="IC4CON" offset="0x600" rw="RW" size="4">
          <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC4CON__ICM"/>
          <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC4CON__ICBNE"/>
          <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC4CON__ICOV"/>
          <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC4CON__ICI"/>
          <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC4CON__ICTMR"/>
          <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC4CON__C32"/>
          <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC4CON__FEDGE"/>
          <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC4CON__SIDL"/>
          <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC4CON__ON"/>
        </register>
        <register caption="" name="IC1BUF" offset="0x10" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="IC1BUF"/>
        </register>
        <register caption="" name="IC2BUF" offset="0x210" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="IC2BUF"/>
        </register>
        <register caption="" name="IC3BUF" offset="0x410" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="IC3BUF"/>
        </register>
