Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="Priority Shadow Select Register" name="PRISS" offset="0x10" rw="RW" size="4">
          <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00000001" name="SS0" values="PRISS__SS0"/>
          <bitfield caption="Interrupt with Priority Level 1 Shadow Set bits " mask="0x000000F0" name="PRI1SS" values="PRISS__PRI1SS"/>
          <bitfield caption="Interrupt with Priority Level 2 Shadow Set bits " mask="0x00000F00" name="PRI2SS" values="PRISS__PRI2SS"/>
          <bitfield caption="Interrupt with Priority Level 3 Shadow Set bits " mask="0x0000F000" name="PRI3SS" values="PRISS__PRI3SS"/>
          <bitfield caption="Interrupt with Priority Level 4 Shadow Set bits " mask="0x000F0000" name="PRI4SS" values="PRISS__PRI4SS"/>
          <bitfield caption="Interrupt with Priority Level 5 Shadow Set bits " mask="0x00F00000" name="PRI5SS" values="PRISS__PRI5SS"/>
          <bitfield caption="Interrupt with Priority Level 6 Shadow Set bits " mask="0x0F000000" name="PRI6SS" values="PRISS__PRI6SS"/>
          <bitfield caption="Interrupt with Priority Level 7 Shadow Set bits " mask="0xF0000000" name="PRI7SS" values="PRISS__PRI7SS"/>
        </register>
        <register caption="Interrupt Status Register" name="INTSTAT" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Interrupt Request Serviced Status bits" mask="0x000000FF" name="SIRQ" values="INTSTAT__SIRQ"/>
          <bitfield caption="Requested Priority Level bits for Single Vector Mode bits " mask="0x00000700" name="SRIPL" values="INTSTAT__SRIPL"/>
        </register>
        <register caption="Interrupt Proximity Timer Register" name="IPTMR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Interrupt Proximity Timer Reload bits" mask="0xFFFFFFFF" name="IPTMR" values="IPTMR__IPTMR"/>
        </register>
        <register caption="Interrupt Flag Status Register 0" name="IFS0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Interrupt Flag Status bit 0" mask="0x00000001" name="CTIF" values="IFS0__CTIF"/>
          <bitfield caption="Interrupt Flag Status bit 1" mask="0x00000002" name="CS0IF" values="IFS0__CS0IF"/>
          <bitfield caption="Interrupt Flag Status bit 2" mask="0x00000004" name="CS1IF" values="IFS0__CS1IF"/>
          <bitfield caption="Interrupt Flag Status bit 3" mask="0x00000008" name="INT0IF" values="IFS0__INT0IF"/>
          <bitfield caption="Interrupt Flag Status bit 4" mask="0x00000010" name="T1IF" values="IFS0__T1IF"/>
          <bitfield caption="Interrupt Flag Status bit 5" mask="0x00000020" name="IC1EIF" values="IFS0__IC1EIF"/>
          <bitfield caption="Interrupt Flag Status bit 6" mask="0x00000040" name="IC1IF" values="IFS0__IC1IF"/>
          <bitfield caption="Interrupt Flag Status bit 7" mask="0x00000080" name="OC1IF" values="IFS0__OC1IF"/>
          <bitfield caption="Interrupt Flag Status bit 8" mask="0x00000100" name="INT1IF" values="IFS0__INT1IF"/>
          <bitfield caption="Interrupt Flag Status bit 9" mask="0x00000200" name="T2IF" values="IFS0__T2IF"/>
          <bitfield caption="Interrupt Flag Status bit 10" mask="0x00000400" name="IC2EIF" values="IFS0__IC2EIF"/>
          <bitfield caption="Interrupt Flag Status bit 11" mask="0x00000800" name="IC2IF" values="IFS0__IC2IF"/>
          <bitfield caption="Interrupt Flag Status bit 12" mask="0x00001000" name="OC2IF" values="IFS0__OC2IF"/>
          <bitfield caption="Interrupt Flag Status bit 13" mask="0x00002000" name="INT2IF" values="IFS0__INT2IF"/>
          <bitfield caption="Interrupt Flag Status bit 14" mask="0x00004000" name="T3IF" values="IFS0__T3IF"/>
          <bitfield caption="Interrupt Flag Status bit 15" mask="0x00008000" name="IC3EIF" values="IFS0__IC3EIF"/>
          <bitfield caption="Interrupt Flag Status bit 16" mask="0x00010000" name="IC3IF" values="IFS0__IC3IF"/>
          <bitfield caption="Interrupt Flag Status bit 17" mask="0x00020000" name="OC3IF" values="IFS0__OC3IF"/>
          <bitfield caption="Interrupt Flag Status bit 18" mask="0x00040000" name="INT3IF" values="IFS0__INT3IF"/>
          <bitfield caption="Interrupt Flag Status bit 19" mask="0x00080000" name="T4IF" values="IFS0__T4IF"/>
          <bitfield caption="Interrupt Flag Status bit 20" mask="0x00100000" name="IC4EIF" values="IFS0__IC4EIF"/>
          <bitfield caption="Interrupt Flag Status bit 21" mask="0x00200000" name="IC4IF" values="IFS0__IC4IF"/>
          <bitfield caption="Interrupt Flag Status bit 22" mask="0x00400000" name="OC4IF" values="IFS0__OC4IF"/>
          <bitfield caption="Interrupt Flag Status bit 23" mask="0x00800000" name="INT4IF" values="IFS0__INT4IF"/>
          <bitfield caption="Interrupt Flag Status bit 24" mask="0x01000000" name="T5IF" values="IFS0__T5IF"/>
          <bitfield caption="Interrupt Flag Status bit 30" mask="0x40000000" name="FCEIF" values="IFS0__FCEIF"/>
          <bitfield caption="Interrupt Flag Status bit 31" mask="0x80000000" name="PREIF" values="IFS0__PREIF"/>
        </register>
        <register caption="Interrupt Flag Status Register 1" name="IFS1" offset="0x50" rw="RW" size="4">
          <bitfield caption="Interrupt Flag Status bit 0" mask="0x00000001" name="PFWCRCIF" values="IFS1__PFWCRCIF"/>
          <bitfield caption="Interrupt Flag Status bit 1" mask="0x00000002" name="RTCCIF" values="IFS1__RTCCIF"/>
          <bitfield caption="Interrupt Flag Status bit 2" mask="0x00000004" name="USBIF" values="IFS1__USBIF"/>
          <bitfield caption="Interrupt Flag Status bit 3" mask="0x00000008" name="SPI1EIF" values="IFS1__SPI1EIF"/>
          <bitfield caption="Interrupt Flag Status bit 4" mask="0x00000010" name="SPI1RXIF" values="IFS1__SPI1RXIF"/>
          <bitfield caption="Interrupt Flag Status bit 5" mask="0x00000020" name="SPI1TXIF" values="IFS1__SPI1TXIF"/>
          <bitfield caption="Interrupt Flag Status bit 6" mask="0x00000040" name="U1EIF" values="IFS1__U1EIF"/>
          <bitfield caption="Interrupt Flag Status bit 7" mask="0x00000080" name="U1RXIF" values="IFS1__U1RXIF"/>
          <bitfield caption="Interrupt Flag Status bit 8" mask="0x00000100" name="U1TXIF" values="IFS1__U1TXIF"/>
          <bitfield caption="Interrupt Flag Status bit 9" mask="0x00000200" name="I2C1BIF" values="IFS1__I2C1BIF"/>
          <bitfield caption="Interrupt Flag Status bit 10" mask="0x00000400" name="I2C1SIF" values="IFS1__I2C1SIF"/>
          <bitfield caption="Interrupt Flag Status bit 11" mask="0x00000800" name="I2C1MIF" values="IFS1__I2C1MIF"/>
          <bitfield caption="Interrupt Flag Status bit 12" mask="0x00001000" name="CNAIF" values="IFS1__CNAIF"/>
          <bitfield caption="Interrupt Flag Status bit 13" mask="0x00002000" name="CNBIF" values="IFS1__CNBIF"/>
          <bitfield caption="Interrupt Flag Status bit 14" mask="0x00004000" name="CNCIF" values="IFS1__CNCIF"/>
          <bitfield caption="Interrupt Flag Status bit 15" mask="0x00008000" name="CNKIF" values="IFS1__CNKIF"/>
          <bitfield caption="Interrupt Flag Status bit 21" mask="0x00200000" name="SPI2EIF" values="IFS1__SPI2EIF"/>
          <bitfield caption="Interrupt Flag Status bit 22" mask="0x00400000" name="SPI2RXIF" values="IFS1__SPI2RXIF"/>
          <bitfield caption="Interrupt Flag Status bit 23" mask="0x00800000" name="SPI2TXIF" values="IFS1__SPI2TXIF"/>
          <bitfield caption="Interrupt Flag Status bit 24" mask="0x01000000" name="U2EIF" values="IFS1__U2EIF"/>
          <bitfield caption="Interrupt Flag Status bit 25" mask="0x02000000" name="U2RXIF" values="IFS1__U2RXIF"/>
          <bitfield caption="Interrupt Flag Status bit 26" mask="0x04000000" name="U2TXIF" values="IFS1__U2TXIF"/>
          <bitfield caption="Interrupt Flag Status bit 27" mask="0x08000000" name="I2C2BIF" values="IFS1__I2C2BIF"/>
          <bitfield caption="Interrupt Flag Status bit 28" mask="0x10000000" name="I2C2SIF" values="IFS1__I2C2SIF"/>
          <bitfield caption="Interrupt Flag Status bit 29" mask="0x20000000" name="I2C2MIF" values="IFS1__I2C2MIF"/>
          <bitfield caption="Interrupt Flag Status bit 30" mask="0x40000000" name="U3EIF" values="IFS1__U3EIF"/>
          <bitfield caption="Interrupt Flag Status bit 31" mask="0x80000000" name="U3RXIF" values="IFS1__U3RXIF"/>
        </register>
        <register caption="Interrupt Flag Status Register 2" name="IFS2" offset="0x60" rw="RW" size="4">
          <bitfield caption="Interrupt Flag Status bit 0" mask="0x00000001" name="U3TXIF" values="IFS2__U3TXIF"/>
          <bitfield caption="Interrupt Flag Status bit 4" mask="0x00000010" name="DMA0IF" values="IFS2__DMA0IF"/>
          <bitfield caption="Interrupt Flag Status bit 5" mask="0x00000020" name="DMA1IF" values="IFS2__DMA1IF"/>
          <bitfield caption="Interrupt Flag Status bit 6" mask="0x00000040" name="DMA2IF" values="IFS2__DMA2IF"/>
          <bitfield caption="Interrupt Flag Status bit 7" mask="0x00000080" name="DMA3IF" values="IFS2__DMA3IF"/>
          <bitfield caption="Interrupt Flag Status bit 8" mask="0x00000100" name="DMA4IF" values="IFS2__DMA4IF"/>
          <bitfield caption="Interrupt Flag Status bit 9" mask="0x00000200" name="DMA5IF" values="IFS2__DMA5IF"/>
          <bitfield caption="Interrupt Flag Status bit 10" mask="0x00000400" name="DMA6IF" values="IFS2__DMA6IF"/>
          <bitfield caption="Interrupt Flag Status bit 11" mask="0x00000800" name="DMA7IF" values="IFS2__DMA7IF"/>
          <bitfield caption="Interrupt Flag Status bit 12" mask="0x00001000" name="T6IF" values="IFS2__T6IF"/>
          <bitfield caption="Interrupt Flag Status bit 16" mask="0x00010000" name="T7IF" values="IFS2__T7IF"/>
          <bitfield caption="Interrupt Flag Status bit 19" mask="0x00080000" name="RFSMCIF" values="IFS2__RFSMCIF"/>
          <bitfield caption="Interrupt Flag Status bit 20" mask="0x00100000" name="RFMACIF" values="IFS2__RFMACIF"/>
          <bitfield caption="Interrupt Flag Status bit 21" mask="0x00200000" name="CTR1EVIF" values="IFS2__CTR1EVIF"/>
          <bitfield caption="Interrupt Flag Status bit 22" mask="0x00400000" name="RFTM0IF" values="IFS2__RFTM0IF"/>
          <bitfield caption="Interrupt Flag Status bit 23" mask="0x00800000" name="RFTM1IF" values="IFS2__RFTM1IF"/>
          <bitfield caption="Interrupt Flag Status bit 24" mask="0x01000000" name="RFTM2IF" values="IFS2__RFTM2IF"/>
          <bitfield caption="Interrupt Flag Status bit 25" mask="0x02000000" name="RFTM3IF" values="IFS2__RFTM3IF"/>
          <bitfield caption="Interrupt Flag Status bit 26" mask="0x04000000" name="CTR1TRGIF" values="IFS2__CTR1TRGIF"/>
          <bitfield caption="Interrupt Flag Status bit 27" mask="0x08000000" name="RFWCOEIF" values="IFS2__RFWCOEIF"/>
          <bitfield caption="Interrupt Flag Status bit 28" mask="0x10000000" name="ADCIF" values="IFS2__ADCIF"/>
          <bitfield caption="Interrupt Flag Status bit 30" mask="0x40000000" name="ADCDC1IF" values="IFS2__ADCDC1IF"/>
          <bitfield caption="Interrupt Flag Status bit 31" mask="0x80000000" name="ADCDC2IF" values="IFS2__ADCDC2IF"/>
        </register>
