Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="Interrupt Flag Status Register 3" name="IFS3" offset="0x70" rw="RW" size="4">
          <bitfield caption="Interrupt Flag Status bit 0" mask="0x00000001" name="ADCDF1IF" values="IFS3__ADCDF1IF"/>
          <bitfield caption="Interrupt Flag Status bit 1" mask="0x00000002" name="ADCDF2IF" values="IFS3__ADCDF2IF"/>
          <bitfield caption="Interrupt Flag Status bit 4" mask="0x00000010" name="ADCFLTIF" values="IFS3__ADCFLTIF"/>
          <bitfield caption="Interrupt Flag Status bit 5" mask="0x00000020" name="ADCEOSIF" values="IFS3__ADCEOSIF"/>
          <bitfield caption="Interrupt Flag Status bit 6" mask="0x00000040" name="ADCARDYIF" values="IFS3__ADCARDYIF"/>
          <bitfield caption="Interrupt Flag Status bit 7" mask="0x00000080" name="ADCURDYIF" values="IFS3__ADCURDYIF"/>
          <bitfield caption="Interrupt Flag Status bit 8" mask="0x00000100" name="ADCFCBTIF" values="IFS3__ADCFCBTIF"/>
          <bitfield caption="Interrupt Flag Status bit 10" mask="0x00000400" name="ADCD0IF" values="IFS3__ADCD0IF"/>
          <bitfield caption="Interrupt Flag Status bit 11" mask="0x00000800" name="ADCD1IF" values="IFS3__ADCD1IF"/>
          <bitfield caption="Interrupt Flag Status bit 12" mask="0x00001000" name="ADCD2IF" values="IFS3__ADCD2IF"/>
          <bitfield caption="Interrupt Flag Status bit 13" mask="0x00002000" name="ADCD3IF" values="IFS3__ADCD3IF"/>
          <bitfield caption="Interrupt Flag Status bit 14" mask="0x00004000" name="ADCD4IF" values="IFS3__ADCD4IF"/>
          <bitfield caption="Interrupt Flag Status bit 15" mask="0x00008000" name="ADCD5IF" values="IFS3__ADCD5IF"/>
          <bitfield caption="Interrupt Flag Status bit 16" mask="0x00010000" name="ADCD6IF" values="IFS3__ADCD6IF"/>
          <bitfield caption="Interrupt Flag Status bit 17" mask="0x00020000" name="ADCD7IF" values="IFS3__ADCD7IF"/>
          <bitfield caption="Interrupt Flag Status bit 18" mask="0x00040000" name="ADCD8IF" values="IFS3__ADCD8IF"/>
          <bitfield caption="Interrupt Flag Status bit 19" mask="0x00080000" name="ADCD9IF" values="IFS3__ADCD9IF"/>
          <bitfield caption="Interrupt Flag Status bit 20" mask="0x00100000" name="ADCD10IF" values="IFS3__ADCD10IF"/>
          <bitfield caption="Interrupt Flag Status bit 21" mask="0x00200000" name="ADCD11IF" values="IFS3__ADCD11IF"/>
          <bitfield caption="Interrupt Flag Status bit 22" mask="0x00400000" name="ADCD12IF" values="IFS3__ADCD12IF"/>
          <bitfield caption="Interrupt Flag Status bit 23" mask="0x00800000" name="ADCD13IF" values="IFS3__ADCD13IF"/>
          <bitfield caption="Interrupt Flag Status bit 24" mask="0x01000000" name="ADCD14IF" values="IFS3__ADCD14IF"/>
          <bitfield caption="Interrupt Flag Status bit 25" mask="0x02000000" name="ADCD15IF" values="IFS3__ADCD15IF"/>
          <bitfield caption="Interrupt Flag Status bit 26" mask="0x04000000" name="ADCD16IF" values="IFS3__ADCD16IF"/>
          <bitfield caption="Interrupt Flag Status bit 27" mask="0x08000000" name="ADCD17IF" values="IFS3__ADCD17IF"/>
          <bitfield caption="Interrupt Flag Status bit 28" mask="0x10000000" name="ADCD18IF" values="IFS3__ADCD18IF"/>
          <bitfield caption="Interrupt Flag Status bit 29" mask="0x20000000" name="ADCD19IF" values="IFS3__ADCD19IF"/>
          <bitfield caption="Interrupt Flag Status bit 30" mask="0x40000000" name="ADCD20IF" values="IFS3__ADCD20IF"/>
          <bitfield caption="Interrupt Flag Status bit 31" mask="0x80000000" name="ADCD21IF" values="IFS3__ADCD21IF"/>
        </register>
        <register caption="Interrupt Flag Status Register 4" name="IFS4" offset="0x80" rw="RW" size="4">
          <bitfield caption="Interrupt Flag Status bit 0" mask="0x00000001" name="ADCD22IF" values="IFS4__ADCD22IF"/>
          <bitfield caption="Interrupt Flag Status bit 1" mask="0x00000002" name="ADCD23IF" values="IFS4__ADCD23IF"/>
          <bitfield caption="Interrupt Flag Status bit 14" mask="0x00004000" name="CAN1IF" values="IFS4__CAN1IF"/>
          <bitfield caption="Interrupt Flag Status bit 15" mask="0x00008000" name="CAN2TXIF" values="IFS4__CAN2TXIF"/>
          <bitfield caption="Interrupt Flag Status bit 16" mask="0x00010000" name="CAN2RXIF" values="IFS4__CAN2RXIF"/>
          <bitfield caption="Interrupt Flag Status bit 17" mask="0x00020000" name="CAN2IF" values="IFS4__CAN2IF"/>
          <bitfield caption="Interrupt Flag Status bit 22" mask="0x00400000" name="SQIIF" values="IFS4__SQIIF"/>
          <bitfield caption="Interrupt Flag Status bit 24" mask="0x01000000" name="PTGSTEPIF" values="IFS4__PTGSTEPIF"/>
          <bitfield caption="Interrupt Flag Status bit 25" mask="0x02000000" name="PTGWDTIF" values="IFS4__PTGWDTIF"/>
          <bitfield caption="Interrupt Flag Status bit 26" mask="0x04000000" name="PTG0TR0IF" values="IFS4__PTG0TR0IF"/>
          <bitfield caption="Interrupt Flag Status bit 27" mask="0x08000000" name="PTG0TR1IF" values="IFS4__PTG0TR1IF"/>
          <bitfield caption="Interrupt Flag Status bit 28" mask="0x10000000" name="PTG0TR2IF" values="IFS4__PTG0TR2IF"/>
          <bitfield caption="Interrupt Flag Status bit 29" mask="0x20000000" name="PTG0TR3IF" values="IFS4__PTG0TR3IF"/>
        </register>
        <register caption="Interrupt Flag Status Register 5" name="IFS5" offset="0x90" rw="RW" size="4">
          <bitfield caption="Interrupt Flag Status bit 2" mask="0x00000004" name="MPUPCIF" values="IFS5__MPUPCIF"/>
          <bitfield caption="Interrupt Flag Status bit 3" mask="0x00000008" name="FDCIF" values="IFS5__FDCIF"/>
          <bitfield caption="Interrupt Flag Status bit 4" mask="0x00000010" name="CRPTIF" values="IFS5__CRPTIF"/>
          <bitfield caption="Interrupt Flag Status bit 5" mask="0x00000020" name="ETHIF" values="IFS5__ETHIF"/>
          <bitfield caption="Interrupt Flag Status bit 6" mask="0x00000040" name="CRPT1IF" values="IFS5__CRPT1IF"/>
          <bitfield caption="Interrupt Flag Status bit 7" mask="0x00000080" name="CRPT1EIF" values="IFS5__CRPT1EIF"/>
        </register>
        <register caption="Interrupt Enable Control Register 0" name="IEC0" offset="0xc0" rw="RW" size="4">
          <bitfield caption="Interrupt Enable bit 0" mask="0x00000001" name="CTIE" values="IEC0__CTIE"/>
          <bitfield caption="Interrupt Enable bit 1" mask="0x00000002" name="CS0IE" values="IEC0__CS0IE"/>
          <bitfield caption="Interrupt Enable bit 2" mask="0x00000004" name="CS1IE" values="IEC0__CS1IE"/>
          <bitfield caption="Interrupt Enable bit 3" mask="0x00000008" name="INT0IE" values="IEC0__INT0IE"/>
          <bitfield caption="Interrupt Enable bit 4" mask="0x00000010" name="T1IE" values="IEC0__T1IE"/>
          <bitfield caption="Interrupt Enable bit 5" mask="0x00000020" name="IC1EIE" values="IEC0__IC1EIE"/>
          <bitfield caption="Interrupt Enable bit 6" mask="0x00000040" name="IC1IE" values="IEC0__IC1IE"/>
          <bitfield caption="Interrupt Enable bit 7" mask="0x00000080" name="OC1IE" values="IEC0__OC1IE"/>
          <bitfield caption="Interrupt Enable bit 8" mask="0x00000100" name="INT1IE" values="IEC0__INT1IE"/>
          <bitfield caption="Interrupt Enable bit 9" mask="0x00000200" name="T2IE" values="IEC0__T2IE"/>
          <bitfield caption="Interrupt Enable bit 10" mask="0x00000400" name="IC2EIE" values="IEC0__IC2EIE"/>
          <bitfield caption="Interrupt Enable bit 11" mask="0x00000800" name="IC2IE" values="IEC0__IC2IE"/>
          <bitfield caption="Interrupt Enable bit 12" mask="0x00001000" name="OC2IE" values="IEC0__OC2IE"/>
          <bitfield caption="Interrupt Enable bit 13" mask="0x00002000" name="INT2IE" values="IEC0__INT2IE"/>
          <bitfield caption="Interrupt Enable bit 14" mask="0x00004000" name="T3IE" values="IEC0__T3IE"/>
          <bitfield caption="Interrupt Enable bit 15" mask="0x00008000" name="IC3EIE" values="IEC0__IC3EIE"/>
          <bitfield caption="Interrupt Enable bit 16" mask="0x00010000" name="IC3IE" values="IEC0__IC3IE"/>
          <bitfield caption="Interrupt Enable bit 17" mask="0x00020000" name="OC3IE" values="IEC0__OC3IE"/>
          <bitfield caption="Interrupt Enable bit 18" mask="0x00040000" name="INT3IE" values="IEC0__INT3IE"/>
          <bitfield caption="Interrupt Enable bit 19" mask="0x00080000" name="T4IE" values="IEC0__T4IE"/>
          <bitfield caption="Interrupt Enable bit 20" mask="0x00100000" name="IC4EIE" values="IEC0__IC4EIE"/>
          <bitfield caption="Interrupt Enable bit 21" mask="0x00200000" name="IC4IE" values="IEC0__IC4IE"/>
          <bitfield caption="Interrupt Enable bit 22" mask="0x00400000" name="OC4IE" values="IEC0__OC4IE"/>
          <bitfield caption="Interrupt Enable bit 23" mask="0x00800000" name="INT4IE" values="IEC0__INT4IE"/>
          <bitfield caption="Interrupt Enable bit 24" mask="0x01000000" name="T5IE" values="IEC0__T5IE"/>
          <bitfield caption="Interrupt Enable bit 30" mask="0x40000000" name="FCEIE" values="IEC0__FCEIE"/>
          <bitfield caption="Interrupt Enable bit 31" mask="0x80000000" name="PREIE" values="IEC0__PREIE"/>
        </register>
        <register caption="Interrupt Enable Control Register 1" name="IEC1" offset="0xd0" rw="RW" size="4">
          <bitfield caption="Interrupt Enable bit 0" mask="0x00000001" name="PFWCRCIE" values="IEC1__PFWCRCIE"/>
          <bitfield caption="Interrupt Enable bit 1" mask="0x00000002" name="RTCCIE" values="IEC1__RTCCIE"/>
          <bitfield caption="Interrupt Enable bit 2" mask="0x00000004" name="USBIE" values="IEC1__USBIE"/>
          <bitfield caption="Interrupt Enable bit 3" mask="0x00000008" name="SPI1EIE" values="IEC1__SPI1EIE"/>
          <bitfield caption="Interrupt Enable bit 4" mask="0x00000010" name="SPI1RXIE" values="IEC1__SPI1RXIE"/>
          <bitfield caption="Interrupt Enable bit 5" mask="0x00000020" name="SPI1TXIE" values="IEC1__SPI1TXIE"/>
          <bitfield caption="Interrupt Enable bit 6" mask="0x00000040" name="U1EIE" values="IEC1__U1EIE"/>
          <bitfield caption="Interrupt Enable bit 7" mask="0x00000080" name="U1RXIE" values="IEC1__U1RXIE"/>
          <bitfield caption="Interrupt Enable bit 8" mask="0x00000100" name="U1TXIE" values="IEC1__U1TXIE"/>
          <bitfield caption="Interrupt Enable bit 9" mask="0x00000200" name="I2C1BIE" values="IEC1__I2C1BIE"/>
          <bitfield caption="Interrupt Enable bit 10" mask="0x00000400" name="I2C1SIE" values="IEC1__I2C1SIE"/>
          <bitfield caption="Interrupt Enable bit 11" mask="0x00000800" name="I2C1MIE" values="IEC1__I2C1MIE"/>
          <bitfield caption="Interrupt Enable bit 12" mask="0x00001000" name="CNAIE" values="IEC1__CNAIE"/>
          <bitfield caption="Interrupt Enable bit 13" mask="0x00002000" name="CNBIE" values="IEC1__CNBIE"/>
          <bitfield caption="Interrupt Enable bit 14" mask="0x00004000" name="CNCIE" values="IEC1__CNCIE"/>
          <bitfield caption="Interrupt Enable bit 15" mask="0x00008000" name="CNKIE" values="IEC1__CNKIE"/>
          <bitfield caption="Interrupt Enable bit 21" mask="0x00200000" name="SPI2EIE" values="IEC1__SPI2EIE"/>
          <bitfield caption="Interrupt Enable bit 22" mask="0x00400000" name="SPI2RXIE" values="IEC1__SPI2RXIE"/>
          <bitfield caption="Interrupt Enable bit 23" mask="0x00800000" name="SPI2TXIE" values="IEC1__SPI2TXIE"/>
          <bitfield caption="Interrupt Enable bit 24" mask="0x01000000" name="U2EIE" values="IEC1__U2EIE"/>
          <bitfield caption="Interrupt Enable bit 25" mask="0x02000000" name="U2RXIE" values="IEC1__U2RXIE"/>
          <bitfield caption="Interrupt Enable bit 26" mask="0x04000000" name="U2TXIE" values="IEC1__U2TXIE"/>
          <bitfield caption="Interrupt Enable bit 27" mask="0x08000000" name="I2C2BIE" values="IEC1__I2C2BIE"/>
          <bitfield caption="Interrupt Enable bit 28" mask="0x10000000" name="I2C2SIE" values="IEC1__I2C2SIE"/>
          <bitfield caption="Interrupt Enable bit 29" mask="0x20000000" name="I2C2MIE" values="IEC1__I2C2MIE"/>
          <bitfield caption="Interrupt Enable bit 30" mask="0x40000000" name="U3EIE" values="IEC1__U3EIE"/>
          <bitfield caption="Interrupt Enable bit 31" mask="0x80000000" name="U3RXIE" values="IEC1__U3RXIE"/>
        </register>
        <register caption="Interrupt Enable Control Register 2" name="IEC2" offset="0xe0" rw="RW" size="4">
          <bitfield caption="Interrupt Enable bit 0" mask="0x00000001" name="U3TXIE" values="IEC2__U3TXIE"/>
          <bitfield caption="Interrupt Enable bit 4" mask="0x00000010" name="DMA0IE" values="IEC2__DMA0IE"/>
          <bitfield caption="Interrupt Enable bit 5" mask="0x00000020" name="DMA1IE" values="IEC2__DMA1IE"/>
          <bitfield caption="Interrupt Enable bit 6" mask="0x00000040" name="DMA2IE" values="IEC2__DMA2IE"/>
          <bitfield caption="Interrupt Enable bit 7" mask="0x00000080" name="DMA3IE" values="IEC2__DMA3IE"/>
          <bitfield caption="Interrupt Enable bit 8" mask="0x00000100" name="DMA4IE" values="IEC2__DMA4IE"/>
          <bitfield caption="Interrupt Enable bit 9" mask="0x00000200" name="DMA5IE" values="IEC2__DMA5IE"/>
          <bitfield caption="Interrupt Enable bit 10" mask="0x00000400" name="DMA6IE" values="IEC2__DMA6IE"/>
          <bitfield caption="Interrupt Enable bit 11" mask="0x00000800" name="DMA7IE" values="IEC2__DMA7IE"/>
          <bitfield caption="Interrupt Enable bit 12" mask="0x00001000" name="T6IE" values="IEC2__T6IE"/>
          <bitfield caption="Interrupt Enable bit 16" mask="0x00010000" name="T7IE" values="IEC2__T7IE"/>
          <bitfield caption="Interrupt Enable bit 19" mask="0x00080000" name="RFSMCIE" values="IEC2__RFSMCIE"/>
          <bitfield caption="Interrupt Enable bit 20" mask="0x00100000" name="RFMACIE" values="IEC2__RFMACIE"/>
          <bitfield caption="Interrupt Enable bit 21" mask="0x00200000" name="CTREVIE" values="IEC2__CTREVIE"/>
          <bitfield caption="Interrupt Enable bit 22" mask="0x00400000" name="RFTM0IE" values="IEC2__RFTM0IE"/>
          <bitfield caption="Interrupt Enable bit 23" mask="0x00800000" name="RFTM1IE" values="IEC2__RFTM1IE"/>
          <bitfield caption="Interrupt Enable bit 24" mask="0x01000000" name="RFTM2IE" values="IEC2__RFTM2IE"/>
          <bitfield caption="Interrupt Enable bit 25" mask="0x02000000" name="RFTM3IE" values="IEC2__RFTM3IE"/>
          <bitfield caption="Interrupt Enable bit 26" mask="0x04000000" name="CTRTRGIE" values="IEC2__CTRTRGIE"/>
          <bitfield caption="Interrupt Enable bit 27" mask="0x08000000" name="RFWCOEIE" values="IEC2__RFWCOEIE"/>
          <bitfield caption="Interrupt Enable bit 28" mask="0x10000000" name="ADCIE" values="IEC2__ADCIE"/>
          <bitfield caption="Interrupt Enable bit 30" mask="0x40000000" name="ADCDC1IE" values="IEC2__ADCDC1IE"/>
          <bitfield caption="Interrupt Enable bit 31" mask="0x80000000" name="ADCDC2IE" values="IEC2__ADCDC2IE"/>
        </register>
        <register caption="Interrupt Enable Control Register 3" name="IEC3" offset="0xf0" rw="RW" size="4">
          <bitfield caption="Interrupt Enable bit 0" mask="0x00000001" name="ADCDF1IE" values="IEC3__ADCDF1IE"/>
          <bitfield caption="Interrupt Enable bit 1" mask="0x00000002" name="ADCDF2IE" values="IEC3__ADCDF2IE"/>
          <bitfield caption="Interrupt Enable bit 4" mask="0x00000010" name="ADCFLTIE" values="IEC3__ADCFLTIE"/>
          <bitfield caption="Interrupt Enable bit 5" mask="0x00000020" name="ADCEOSIE" values="IEC3__ADCEOSIE"/>
          <bitfield caption="Interrupt Enable bit 6" mask="0x00000040" name="ADCARDYIE" values="IEC3__ADCARDYIE"/>
          <bitfield caption="Interrupt Enable bit 7" mask="0x00000080" name="ADCURDYIE" values="IEC3__ADCURDYIE"/>
          <bitfield caption="Interrupt Enable bit 8" mask="0x00000100" name="ADCFCBTIE" values="IEC3__ADCFCBTIE"/>
          <bitfield caption="Interrupt Enable bit 10" mask="0x00000400" name="ADCD0IE" values="IEC3__ADCD0IE"/>
          <bitfield caption="Interrupt Enable bit 11" mask="0x00000800" name="ADCD1IE" values="IEC3__ADCD1IE"/>
          <bitfield caption="Interrupt Enable bit 12" mask="0x00001000" name="ADCD2IE" values="IEC3__ADCD2IE"/>
          <bitfield caption="Interrupt Enable bit 13" mask="0x00002000" name="ADCD3IE" values="IEC3__ADCD3IE"/>
          <bitfield caption="Interrupt Enable bit 14" mask="0x00004000" name="ADCD4IE" values="IEC3__ADCD4IE"/>
          <bitfield caption="Interrupt Enable bit 15" mask="0x00008000" name="ADCD5IE" values="IEC3__ADCD5IE"/>
          <bitfield caption="Interrupt Enable bit 16" mask="0x00010000" name="ADCD6IE" values="IEC3__ADCD6IE"/>
          <bitfield caption="Interrupt Enable bit 17" mask="0x00020000" name="ADCD7IE" values="IEC3__ADCD7IE"/>
          <bitfield caption="Interrupt Enable bit 18" mask="0x00040000" name="ADCD8IE" values="IEC3__ADCD8IE"/>
          <bitfield caption="Interrupt Enable bit 19" mask="0x00080000" name="ADCD9IE" values="IEC3__ADCD9IE"/>
          <bitfield caption="Interrupt Enable bit 20" mask="0x00100000" name="ADCD10IE" values="IEC3__ADCD10IE"/>
          <bitfield caption="Interrupt Enable bit 21" mask="0x00200000" name="ADCD11IE" values="IEC3__ADCD11IE"/>
          <bitfield caption="Interrupt Enable bit 22" mask="0x00400000" name="ADCD12IE" values="IEC3__ADCD12IE"/>
          <bitfield caption="Interrupt Enable bit 23" mask="0x00800000" name="ADCD13IE" values="IEC3__ADCD13IE"/>
          <bitfield caption="Interrupt Enable bit 24" mask="0x01000000" name="ADCD14IE" values="IEC3__ADCD14IE"/>
          <bitfield caption="Interrupt Enable bit 25" mask="0x02000000" name="ADCD15IE" values="IEC3__ADCD15IE"/>
          <bitfield caption="Interrupt Enable bit 26" mask="0x04000000" name="ADCD16IE" values="IEC3__ADCD16IE"/>
          <bitfield caption="Interrupt Enable bit 27" mask="0x08000000" name="ADCD17IE" values="IEC3__ADCD17IE"/>
          <bitfield caption="Interrupt Enable bit 28" mask="0x10000000" name="ADCD18IE" values="IEC3__ADCD18IE"/>
          <bitfield caption="Interrupt Enable bit 29" mask="0x20000000" name="ADCD19IE" values="IEC3__ADCD19IE"/>
          <bitfield caption="Interrupt Enable bit 30" mask="0x40000000" name="ADCD20IE" values="IEC3__ADCD20IE"/>
          <bitfield caption="Interrupt Enable bit 31" mask="0x80000000" name="ADCD21IE" values="IEC3__ADCD21IE"/>
        </register>
        <register caption="Interrupt Enable Control Register 4" name="IEC4" offset="0x100" rw="RW" size="4">
          <bitfield caption="Interrupt Enable bit 0" mask="0x00000001" name="ADCD22IE" values="IEC4__ADCD22IE"/>
          <bitfield caption="Interrupt Enable bit 1" mask="0x00000002" name="ADCD23IE" values="IEC4__ADCD23IE"/>
          <bitfield caption="Interrupt Enable bit 14" mask="0x00004000" name="CAN1IE" values="IEC4__CAN1IE"/>
          <bitfield caption="Interrupt Enable bit 15" mask="0x00008000" name="CAN2RXIE" values="IEC4__CAN2RXIE"/>
          <bitfield caption="Interrupt Enable bit 16" mask="0x00010000" name="CAN2TXIE" values="IEC4__CAN2TXIE"/>
          <bitfield caption="Interrupt Enable bit 17" mask="0x00020000" name="CAN2IE" values="IEC4__CAN2IE"/>
          <bitfield caption="Interrupt Enable bit 22" mask="0x00400000" name="SQIIE" values="IEC4__SQIIE"/>
          <bitfield caption="Interrupt Enable bit 24" mask="0x01000000" name="PTGSTEPIE" values="IEC4__PTGSTEPIE"/>
          <bitfield caption="Interrupt Enable bit 25" mask="0x02000000" name="PTGWDTIE" values="IEC4__PTGWDTIE"/>
          <bitfield caption="Interrupt Enable bit 26" mask="0x04000000" name="PTG0TR0IE" values="IEC4__PTG0TR0IE"/>
          <bitfield caption="Interrupt Enable bit 27" mask="0x08000000" name="PTG0TR1IE" values="IEC4__PTG0TR1IE"/>
          <bitfield caption="Interrupt Enable bit 28" mask="0x10000000" name="PTG0TR2IE" values="IEC4__PTG0TR2IE"/>
          <bitfield caption="Interrupt Enable bit 29" mask="0x20000000" name="PTG0TR3IE" values="IEC4__PTG0TR3IE"/>
        </register>
        <register caption="Interrupt Enable Control Register 5" name="IEC5" offset="0x110" rw="RW" size="4">
          <bitfield caption="Interrupt Enable bit 2" mask="0x00000004" name="MPUPCIE" values="IEC5__MPUPCIE"/>
          <bitfield caption="Interrupt Enable bit 3" mask="0x00000008" name="FDCIE" values="IEC5__FDCIE"/>
          <bitfield caption="Interrupt Enable bit 4" mask="0x00000010" name="CRPTIE" values="IEC5__CRPTIE"/>
          <bitfield caption="Interrupt Enable bit 5" mask="0x00000020" name="ETHIE" values="IEC5__ETHIE"/>
          <bitfield caption="Interrupt Enable bit 6" mask="0x00000040" name="CRPT1IE" values="IEC5__CRPT1IE"/>
          <bitfield caption="Interrupt Enable bit 7" mask="0x00000080" name="CRPT1EIE" values="IEC5__CRPT1EIE"/>
        </register>
        <register caption="Interrupt Priority Control Register 0" name="IPC0" offset="0x140" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="CTIS" values="IPC0__CTIS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="CTIP" values="IPC0__CTIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="CS0IS" values="IPC0__CS0IS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="CS0IP" values="IPC0__CS0IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="CS1IS" values="IPC0__CS1IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="CS1IP" values="IPC0__CS1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="INT0IS" values="IPC0__INT0IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="INT0IP" values="IPC0__INT0IP"/>
        </register>
        <register caption="Interrupt Priority Control Register 1" name="IPC1" offset="0x150" rw="RW" size="4">
          <bitfield caption="Interrupt subpriority" mask="0x00000003" name="T1IS" values="IPC1__T1IS"/>
          <bitfield caption="Interrupt priority" mask="0x0000001C" name="T1IP" values="IPC1__T1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00000300" name="IC1EIS" values="IPC1__IC1EIS"/>
          <bitfield caption="Interrupt priority" mask="0x00001C00" name="IC1EIP" values="IPC1__IC1EIP"/>
          <bitfield caption="Interrupt subpriority" mask="0x00030000" name="IC1IS" values="IPC1__IC1IS"/>
          <bitfield caption="Interrupt priority" mask="0x001C0000" name="IC1IP" values="IPC1__IC1IP"/>
          <bitfield caption="Interrupt subpriority" mask="0x03000000" name="OC1IS" values="IPC1__OC1IS"/>
          <bitfield caption="Interrupt priority" mask="0x1C000000" name="OC1IP" values="IPC1__OC1IP"/>
        </register>
