Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="Interrupt Vector Address Offset Register" name="OFF166" offset="0x7d8" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 166 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF166__VOFF"/>
        </register>
        <register caption="Interrupt Vector Address Offset Register" name="OFF167" offset="0x7dc" rw="RW" size="4">
          <bitfield caption="Interrupt Vector 167 Address Offset bits" mask="0x0003FFFE" name="VOFF" values="OFF167__VOFF"/>
        </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
        <value caption="Rising edge" name="" value="0x1"/>
        <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
        <value caption="Rising edge" name="" value="0x1"/>
        <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
        <value caption="Rising edge" name="" value="0x1"/>
        <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
        <value caption="Rising edge" name="" value="0x1"/>
        <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
        <value caption="Rising edge" name="" value="0x1"/>
        <value caption="Falling edge" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
        <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7"/>
        <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6"/>
        <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5"/>
        <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4"/>
        <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3"/>
        <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2"/>
        <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1"/>
        <value caption="Disables Interrupt Proximity timer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
        <value caption="Interrupt controller configured for multi vectored mode" name="" value="0x1"/>
        <value caption="Interrupt controller configured for single vectored mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Single Vector Shadow Register Set bit" name="PRISS__SS0">
        <value caption="Single vector is presented with a shadow set" name="" value="0x1"/>
        <value caption="Single vector is not presented with a shadow set" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 1 Shadow Set bits " name="PRISS__PRI1SS">
        <value caption="Interrupt with a priority level of 1 uses Shadow Set 7" name="" value="0x7"/>
        <value caption="Interrupt with a priority level of 1 uses Shadow Set 5" name="" value="0x5"/>
        <value caption="Interrupt with a priority level of 1 uses Shadow Set 4" name="" value="0x4"/>
        <value caption="Interrupt with a priority level of 1 uses Shadow Set 3" name="" value="0x3"/>
        <value caption="Interrupt with a priority level of 1 uses Shadow Set 2" name="" value="0x2"/>
        <value caption="Interrupt with a priority level of 1 uses Shadow Set 1" name="" value="0x1"/>
        <value caption="Interrupt with a priority level of 1 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 2 Shadow Set bits " name="PRISS__PRI2SS">
        <value caption="Interrupt with a priority level of 2 uses Shadow Set 7" name="" value="0x7"/>
        <value caption="Interrupt with a priority level of 2 uses Shadow Set 6" name="" value="0x6"/>
        <value caption="Interrupt with a priority level of 2 uses Shadow Set 5" name="" value="0x5"/>
        <value caption="Interrupt with a priority level of 2 uses Shadow Set 4" name="" value="0x4"/>
        <value caption="Interrupt with a priority level of 2 uses Shadow Set 3" name="" value="0x3"/>
        <value caption="Interrupt with a priority level of 2 uses Shadow Set 2" name="" value="0x2"/>
        <value caption="Interrupt with a priority level of 2 uses Shadow Set 1" name="" value="0x1"/>
        <value caption="Interrupt with a priority level of 2 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 3 Shadow Set bits " name="PRISS__PRI3SS">
        <value caption="Interrupt with a priority level of 3 uses Shadow Set 7" name="" value="0x7"/>
        <value caption="Interrupt with a priority level of 3 uses Shadow Set 6" name="" value="0x6"/>
        <value caption="Interrupt with a priority level of 3 uses Shadow Set 5" name="" value="0x5"/>
        <value caption="Interrupt with a priority level of 3 uses Shadow Set 4" name="" value="0x4"/>
        <value caption="Interrupt with a priority level of 3 uses Shadow Set 3" name="" value="0x3"/>
        <value caption="Interrupt with a priority level of 3 uses Shadow Set 2" name="" value="0x2"/>
        <value caption="Interrupt with a priority level of 3 uses Shadow Set 1" name="" value="0x1"/>
        <value caption="Interrupt with a priority level of 3 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 4 Shadow Set bits " name="PRISS__PRI4SS">
        <value caption="Interrupt with a priority level of 4 uses Shadow Set 7" name="" value="0x7"/>
        <value caption="Interrupt with a priority level of 4 uses Shadow Set 6" name="" value="0x6"/>
        <value caption="Interrupt with a priority level of 4 uses Shadow Set 5" name="" value="0x5"/>
        <value caption="Interrupt with a priority level of 4 uses Shadow Set 4" name="" value="0x4"/>
        <value caption="Interrupt with a priority level of 4 uses Shadow Set 3" name="" value="0x3"/>
        <value caption="Interrupt with a priority level of 4 uses Shadow Set 2" name="" value="0x2"/>
        <value caption="Interrupt with a priority level of 4 uses Shadow Set 1" name="" value="0x1"/>
        <value caption="Interrupt with a priority level of 4 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 5 Shadow Set bits " name="PRISS__PRI5SS">
        <value caption="Interrupt with a priority level of 5 uses Shadow Set 7" name="" value="0x7"/>
        <value caption="Interrupt with a priority level of 5 uses Shadow Set 6" name="" value="0x6"/>
        <value caption="Interrupt with a priority level of 5 uses Shadow Set 5" name="" value="0x5"/>
        <value caption="Interrupt with a priority level of 5 uses Shadow Set 4" name="" value="0x4"/>
        <value caption="Interrupt with a priority level of 5 uses Shadow Set 3" name="" value="0x3"/>
        <value caption="Interrupt with a priority level of 5 uses Shadow Set 2" name="" value="0x2"/>
        <value caption="Interrupt with a priority level of 5 uses Shadow Set 1" name="" value="0x1"/>
        <value caption="Interrupt with a priority level of 5 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 6 Shadow Set bits " name="PRISS__PRI6SS">
        <value caption="Interrupt with a priority level of 6 uses Shadow Set 7" name="" value="0x7"/>
        <value caption="Interrupt with a priority level of 6 uses Shadow Set 6" name="" value="0x6"/>
        <value caption="Interrupt with a priority level of 6 uses Shadow Set 5" name="" value="0x5"/>
        <value caption="Interrupt with a priority level of 6 uses Shadow Set 4" name="" value="0x4"/>
        <value caption="Interrupt with a priority level of 6 uses Shadow Set 3" name="" value="0x3"/>
        <value caption="Interrupt with a priority level of 6 uses Shadow Set 2" name="" value="0x2"/>
        <value caption="Interrupt with a priority level of 6 uses Shadow Set 1" name="" value="0x1"/>
        <value caption="Interrupt with a priority level of 6 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 7 Shadow Set bits " name="PRISS__PRI7SS">
        <value caption="Interrupt with a priority level of 7 uses Shadow Set 7" name="" value="0x7"/>
        <value caption="Interrupt with a priority level of 7 uses Shadow Set 6" name="" value="0x6"/>
        <value caption="Interrupt with a priority level of 7 uses Shadow Set 5" name="" value="0x5"/>
        <value caption="Interrupt with a priority level of 7 uses Shadow Set 4" name="" value="0x4"/>
        <value caption="Interrupt with a priority level of 7 uses Shadow Set 3" name="" value="0x3"/>
        <value caption="Interrupt with a priority level of 7 uses Shadow Set 2" name="" value="0x2"/>
        <value caption="Interrupt with a priority level of 7 uses Shadow Set 1" name="" value="0x1"/>
        <value caption="Interrupt with a priority level of 7 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Last Interrupt Request Serviced Status bits" name="INTSTAT__SIRQ">
        <value caption="The last interrupt request number serviced by the CPU was 255" name="" value="0xff"/>
        <value caption="The last interrupt request number serviced by the CPU was 254" name="" value="0xfe"/>
        <value caption="The last interrupt request number serviced by the CPU was 2" name="" value="0x2"/>
        <value caption="The last interrupt request number serviced by the CPU was 1" name="" value="0x1"/>
        <value caption="The last interrupt request number serviced by the CPU was 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Priority Level bits for Single Vector Mode bits " name="INTSTAT__SRIPL">
        <value caption="The priority level of the latest interrupt presented to the CPU is 0" name="" value="0x0"/>
        <value caption="The priority level of the latest interrupt presented to the CPU is 1" name="" value="0x0"/>
        <value caption="The priority level of the latest interrupt presented to the CPU is 2" name="" value="0x0"/>
        <value caption="The priority level of the latest interrupt presented to the CPU is 3" name="" value="0x0"/>
        <value caption="The priority level of the latest interrupt presented to the CPU is 4" name="" value="0x0"/>
        <value caption="The priority level of the latest interrupt presented to the CPU is 5" name="" value="0x0"/>
        <value caption="The priority level of the latest interrupt presented to the CPU is 6" name="" value="0x0"/>
        <value caption="The priority level of the latest interrupt presented to the CPU is 7" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Proximity Timer Reload bits" name="IPTMR__IPTMR">
        <value caption="reload value of 0" name="" value="0x0"/>
        <value caption="reload value of 1" name="" value="0x1"/>
        <value caption="reload value of 2^32-1" name="" value="0xffffffff"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 0" name="IFS0__CTIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
