Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Interrupt Flag Status bit 1" name="IFS0__CS0IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 2" name="IFS0__CS1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 3" name="IFS0__INT0IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 4" name="IFS0__T1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 5" name="IFS0__IC1EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 6" name="IFS0__IC1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 7" name="IFS0__OC1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 8" name="IFS0__INT1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 9" name="IFS0__T2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 10" name="IFS0__IC2EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 11" name="IFS0__IC2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 12" name="IFS0__OC2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 13" name="IFS0__INT2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 14" name="IFS0__T3IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 15" name="IFS0__IC3EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 16" name="IFS0__IC3IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 17" name="IFS0__OC3IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 18" name="IFS0__INT3IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 19" name="IFS0__T4IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 20" name="IFS0__IC4EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 21" name="IFS0__IC4IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 22" name="IFS0__OC4IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 23" name="IFS0__INT4IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 24" name="IFS0__T5IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
