Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Interrupt Flag Status bit 27" name="IFS1__I2C2BIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 28" name="IFS1__I2C2SIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 29" name="IFS1__I2C2MIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 30" name="IFS1__U3EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 31" name="IFS1__U3RXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 0" name="IFS2__U3TXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 4" name="IFS2__DMA0IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 5" name="IFS2__DMA1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 6" name="IFS2__DMA2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 7" name="IFS2__DMA3IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 8" name="IFS2__DMA4IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 9" name="IFS2__DMA5IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 10" name="IFS2__DMA6IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 11" name="IFS2__DMA7IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 12" name="IFS2__T6IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 16" name="IFS2__T7IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 19" name="IFS2__RFSMCIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 20" name="IFS2__RFMACIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 21" name="IFS2__CTR1EVIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 22" name="IFS2__RFTM0IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 23" name="IFS2__RFTM1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 24" name="IFS2__RFTM2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 25" name="IFS2__RFTM3IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 26" name="IFS2__CTR1TRGIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 27" name="IFS2__RFWCOEIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 28" name="IFS2__ADCIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 30" name="IFS2__ADCDC1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
