Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Interrupt Flag Status bit 26" name="IFS3__ADCD16IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 27" name="IFS3__ADCD17IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 28" name="IFS3__ADCD18IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 29" name="IFS3__ADCD19IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 30" name="IFS3__ADCD20IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 31" name="IFS3__ADCD21IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 0" name="IFS4__ADCD22IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 1" name="IFS4__ADCD23IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 14" name="IFS4__CAN1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 15" name="IFS4__CAN2TXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 16" name="IFS4__CAN2RXIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 17" name="IFS4__CAN2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 22" name="IFS4__SQIIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 24" name="IFS4__PTGSTEPIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 25" name="IFS4__PTGWDTIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 26" name="IFS4__PTG0TR0IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 27" name="IFS4__PTG0TR1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 28" name="IFS4__PTG0TR2IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 29" name="IFS4__PTG0TR3IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 2" name="IFS5__MPUPCIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 3" name="IFS5__FDCIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 4" name="IFS5__CRPTIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 5" name="IFS5__ETHIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 6" name="IFS5__CRPT1IF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Flag Status bit 7" name="IFS5__CRPT1EIF">
        <value caption="Interrupt request has occurred" name="" value="0x1"/>
        <value caption="No interrupt request has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 0" name="IEC0__CTIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 1" name="IEC0__CS0IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 2" name="IEC0__CS1IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 3" name="IEC0__INT0IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 4" name="IEC0__T1IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 5" name="IEC0__IC1EIE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt Enable bit 6" name="IEC0__IC1IE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
