Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Interrupt subpriority" name="IPC3__INT2IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC3__INT2IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC3__T3IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC3__T3IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC3__IC3EIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC3__IC3EIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC4__IC3IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC4__IC3IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC4__OC3IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC4__OC3IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC4__INT3IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC4__INT3IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC4__T4IS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC4__T4IP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC5__IC4EIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
