Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Interrupt priority" name="IPC9__SPI1TXIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC9__U1EIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC9__U1EIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC9__U1RXIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC9__U1RXIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC10__U1TXIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC10__U1TXIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC10__I2C1BIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC10__I2C1BIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC10__I2C1SIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC10__I2C1SIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt subpriority" name="IPC10__I2C1MIS">
        <value caption="Interrupt subpriority is 3" name="" value="0x3"/>
        <value caption="Interrupt subpriority is 2" name="" value="0x2"/>
        <value caption="Interrupt subpriority is 1" name="" value="0x1"/>
        <value caption="Interrupt subpriority is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt priority" name="IPC10__I2C1MIP">
        <value caption="Interrupt priority is 7" name="" value="0x7"/>
        <value caption="Interrupt priority is 6" name="" value="0x6"/>
        <value caption="Interrupt priority is 5" name="" value="0x5"/>
        <value caption="Interrupt priority is 4" name="" value="0x4"/>
        <value caption="Interrupt priority is 3" name="" value="0x3"/>
        <value caption="Interrupt priority is 2" name="" value="0x2"/>
        <value caption="Interrupt priority is 1" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
