Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Boot Flash Bank Alias Swap Control bit" name="NVMCON__BFSWAP">
        <value caption="Boot Flash Bank 2 is mapped to the lower boot alias and boot Flash Bank 1 is mapped to the upper boot alias" name="" value="0x1"/>
        <value caption="Boot Flash Bank 1 is mapped to the lower boot alias and boot Flash Bank 2 is mapped to the upper boot alias" name="" value="0x0"/>
      </value-group>
      <value-group caption="Program Flash Bank Swap Control bit" name="NVMCON__PFSWAP">
        <value caption="Program Flash Bank 2 is mapped to the lower mapped region and program Flash Bank 1 is mapped to the upper mapped region" name="" value="0x1"/>
        <value caption="Program Flash Bank 1 is mapped to the lower mapped region and program Flash Bank 2 is mapped to the upper mapped region" name="" value="0x0"/>
      </value-group>
      <value-group caption="High Temperature Detected during Program/Erase Operation Bit" name="NVMCON__HTDPGM">
        <value caption="High Temp Detected" name="" value="0x1"/>
        <value caption="High Temp Not Detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low-Voltage Detect Error bit" name="NVMCON__LVDERR">
        <value caption="Low-voltage detected (possible data corruption" name="" value="0x1"/>
        <value caption="Voltage level is acceptable for programming" name="" value="0x0"/>
      </value-group>
      <value-group caption="Write Error bit" name="NVMCON__WRERR">
        <value caption="Program or erase sequence did not complete successfully" name="" value="0x1"/>
        <value caption="Program or erase sequence completed normally" name="" value="0x0"/>
      </value-group>
      <value-group caption="Write Enable bit" name="NVMCON__WREN">
        <value caption="Enable writes to the WR bit and disables writes to the NVMOP bits" name="" value="0x1"/>
        <value caption="Disable writes to WR bit and enables writes to the NVMOP bits" name="" value="0x0"/>
      </value-group>
      <value-group caption="Write Control bit" name="NVMCON__WR">
        <value caption="Initiate a Flash operation" name="" value="0x1"/>
        <value caption="Flash operation is complete or inactive" name="" value="0x0"/>
      </value-group>
      <value-group caption="NVM Pre-Program Control Bit" name="NVMCON2__PREPG">
        <value caption="Program Operations include Pre-Program step" name="" value="0x1"/>
        <value caption="Program Operations exclude Pre-Program step" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash Memory Swap Lock Control bits" name="NVMCON2__SWAPLOCK">
        <value caption="PFSWAP and BFSWAP are not writable and SWAPLOCK is not writable" name="" value="0x3"/>
        <value caption="PFSWAP and BFSWAP are not writable and SWAPLOCK is writable" name="" value="0x2"/>
        <value caption="PFSWAP and BFSWAP are not writable and SWAPLOCK is writable" name="" value="0x1"/>
        <value caption="PFSWAP and BFSWAP are writable and SWAPLOCK is writable" name="" value="0x0"/>
      </value-group>
      <value-group caption="NVMPWPLT Register Unlock Bit" name="NVMPWPLT__ULOCK">
        <value caption="Register is not locked and can be modified" name="" value="0x1"/>
        <value caption="Register is locked and cannot be modified" name="" value="0x0"/>
      </value-group>
      <value-group caption="Program Flash Memory Page Write-protect Unlock bit" name="NVMPWPGTE__ULOCK">
        <value caption="Register is not locked and can be modified" name="" value="0x1"/>
        <value caption="Register is locked and cannot be modified" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="00749" name="OCMP" version="1">
      <register-group name="OCMP">
        <register caption="Output Compare 'x' Control Register" name="OC1CON" offset="0x0" rw="RW" size="4">
          <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC1CON__OCM"/>
          <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC1CON__OCTSEL"/>
          <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC1CON__OCFLT"/>
          <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC1CON__OC32"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC1CON__SIDL"/>
          <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC1CON__ON"/>
        </register>
        <register caption="Output Compare 'x' Control Register" name="OC2CON" offset="0x200" rw="RW" size="4">
          <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC2CON__OCM"/>
          <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC2CON__OCTSEL"/>
          <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC2CON__OCFLT"/>
          <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC2CON__OC32"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC2CON__SIDL"/>
          <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC2CON__ON"/>
        </register>
        <register caption="Output Compare 'x' Control Register" name="OC3CON" offset="0x400" rw="RW" size="4">
          <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC3CON__OCM"/>
          <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC3CON__OCTSEL"/>
          <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC3CON__OCFLT"/>
          <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC3CON__OC32"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC3CON__SIDL"/>
          <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC3CON__ON"/>
        </register>
        <register caption="Output Compare 'x' Control Register" name="OC4CON" offset="0x600" rw="RW" size="4">
          <bitfield caption="Output Compare Mode Select bits" mask="0x00000007" name="OCM" values="OC4CON__OCM"/>
          <bitfield caption="Output Compare Timer Select bit" mask="0x00000008" name="OCTSEL" values="OC4CON__OCTSEL"/>
          <bitfield caption="PWM Fault Condition Status bit" mask="0x00000010" name="OCFLT" values="OC4CON__OCFLT"/>
          <bitfield caption="32-bit Compare Mode bit" mask="0x00000020" name="OC32" values="OC4CON__OC32"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="OC4CON__SIDL"/>
          <bitfield caption="Output Compare Peripheral On bit" mask="0x00008000" name="ON" values="OC4CON__ON"/>
        </register>
