Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="" name="PTGADJ" offset="0x80" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGADJ"/>
        </register>
        <register caption="" name="PTGL0" offset="0x90" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="PTGL0"/>
        </register>
        <register caption="" name="PTGQPTR" offset="0xa0" rw="RW" size="4">
          <bitfield mask="0x0000001F" name="PTGQPTR"/>
        </register>
        <register caption="" name="PTGQUE0" offset="0xc0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP0"/>
          <bitfield mask="0x0000FF00" name="STEP1"/>
          <bitfield mask="0x00FF0000" name="STEP2"/>
          <bitfield mask="0xFF000000" name="STEP3"/>
        </register>
        <register caption="" name="PTGQUE1" offset="0xd0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP4"/>
          <bitfield mask="0x0000FF00" name="STEP5"/>
          <bitfield mask="0x00FF0000" name="STEP6"/>
          <bitfield mask="0xFF000000" name="STEP7"/>
        </register>
        <register caption="" name="PTGQUE2" offset="0xe0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP8"/>
          <bitfield mask="0x0000FF00" name="STEP9"/>
          <bitfield mask="0x00FF0000" name="STEP10"/>
          <bitfield mask="0xFF000000" name="STEP11"/>
        </register>
        <register caption="" name="PTGQUE3" offset="0xf0" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP12"/>
          <bitfield mask="0x0000FF00" name="STEP13"/>
          <bitfield mask="0x00FF0000" name="STEP14"/>
          <bitfield mask="0xFF000000" name="STEP15"/>
        </register>
        <register caption="" name="PTGQUE4" offset="0x100" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP16"/>
          <bitfield mask="0x0000FF00" name="STEP17"/>
          <bitfield mask="0x00FF0000" name="STEP18"/>
          <bitfield mask="0xFF000000" name="STEP19"/>
        </register>
        <register caption="" name="PTGQUE5" offset="0x110" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP20"/>
          <bitfield mask="0x0000FF00" name="STEP21"/>
          <bitfield mask="0x00FF0000" name="STEP22"/>
          <bitfield mask="0xFF000000" name="STEP23"/>
        </register>
        <register caption="" name="PTGQUE6" offset="0x120" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP24"/>
          <bitfield mask="0x0000FF00" name="STEP25"/>
          <bitfield mask="0x00FF0000" name="STEP26"/>
          <bitfield mask="0xFF000000" name="STEP27"/>
        </register>
        <register caption="" name="PTGQUE7" offset="0x130" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="STEP28"/>
          <bitfield mask="0x0000FF00" name="STEP29"/>
          <bitfield mask="0x00FF0000" name="STEP30"/>
          <bitfield mask="0xFF000000" name="STEP31"/>
        </register>
      </register-group>
    </module>
    <module caption="" id="00350" name="RNG" version="2">
      <register-group name="RNG">
        <register caption="Random Number Generator Version Register" name="RNGVER" offset="0x0" rw="R" size="4">
          <bitfield mask="0x0000007F" name="REVISION"/>
          <bitfield mask="0x0000FF80" name="VERSION"/>
          <bitfield mask="0xFFFF0000" name="ID"/>
        </register>
        <register caption="Random Number Generator Control Register" name="RNGCON" offset="0x4" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="PLEN"/>
          <bitfield caption="TRNG Operation Enable bit" mask="0x00000100" name="TRNGEN" values="RNGCON__TRNGEN"/>
          <bitfield caption="PRNG Operation Enable bit" mask="0x00000200" name="PRNGEN" values="RNGCON__PRNGEN"/>
          <bitfield caption="PRNG Number Shift Enable bit" mask="0x00000400" name="CONT" values="RNGCON__CONT"/>
          <bitfield caption="TRNG Mode Selection bit" mask="0x00000800" name="TRNGMODE" values="RNGCON__TRNGMODE"/>
          <bitfield mask="0x00001000" name="LOAD"/>
        </register>
        <register caption="Random Number Generator Polynomial Register 1" name="RNGPOLY1" offset="0x8" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="POLY"/>
        </register>
        <register caption="Random Number Generator Polynomial Register 2" name="RNGPOLY2" offset="0xc" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="POLY"/>
        </register>
        <register caption="Random Number Generator Register 1" name="RNGNUMGEN1" offset="0x10" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="RNG"/>
        </register>
        <register caption="Random Number Generator Register 2" name="RNGNUMGEN2" offset="0x14" rw="RW" size="4">
          <bitfield mask="0xFFFFFFFF" name="RNG"/>
        </register>
        <register caption="True Random Number Generator Seed Register 1" name="RNGSEED1" offset="0x18" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="SEED"/>
        </register>
        <register caption="True Random Number Generator Seed Register 2" name="RNGSEED2" offset="0x1c" rw="R" size="4">
          <bitfield mask="0xFFFFFFFF" name="SEED"/>
        </register>
        <register caption="True Random Number Generator Count Register" name="RNGCNT" offset="0x20" rw="RW" size="4">
          <bitfield mask="0x0000007F" name="RCNT"/>
        </register>
      </register-group>
      <value-group caption="TRNG Operation Enable bit" name="RNGCON__TRNGEN">
        <value caption="TRNG operation is enabled" name="" value="0x1"/>
        <value caption="TRNG operation is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PRNG Operation Enable bit" name="RNGCON__PRNGEN">
        <value caption="PRNG operation is enabled" name="" value="0x1"/>
        <value caption="PRNG operation is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="PRNG Number Shift Enable bit" name="RNGCON__CONT">
        <value caption="The PRNG random number is shifted every cycle" name="" value="0x1"/>
        <value caption="The PRNG random number is shifted when the previous value is removed" name="" value="0x0"/>
      </value-group>
      <value-group caption="TRNG Mode Selection bit" name="RNGCON__TRNGMODE">
        <value caption="Use ring oscillators with bias corrector" name="" value="0x1"/>
        <value caption="Use ring oscillators with XOR tree" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="00748" name="RTCC" version="2">
      <register-group name="RTCC">
        <register caption="Real-Time Clock and Calendar Control Register" name="RTCCON" offset="0x0" rw="RW" size="4">
          <bitfield caption="RTCC Output Enable bit" mask="0x00000001" name="RTCOE" values="RTCCON__RTCOE"/>
          <bitfield caption="Half-Second Status bit" mask="0x00000002" name="HALFSEC" values="RTCCON__HALFSEC"/>
          <bitfield caption="Real-Time Clock Value Registers Read Synchronization bit" mask="0x00000004" name="RTCSYNC" values="RTCCON__RTCSYNC"/>
          <bitfield caption="Real-Time Clock Value Registers Write Enable bit" mask="0x00000008" name="RTCWREN" values="RTCCON__RTCWREN"/>
          <bitfield caption="RTCC Clock Enable Status bit" mask="0x00000040" name="RTCCLKON" values="RTCCON__RTCCLKON"/>
          <bitfield caption="RTCC Output Data Select bits" mask="0x00000180" name="RTCOUTSEL" values="RTCCON__RTCOUTSEL"/>
          <bitfield caption="RTCC Clock Select bits" mask="0x00000600" name="RTCCLKSEL" values="RTCCON__RTCCLKSEL"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="RTCCON__SIDL"/>
          <bitfield caption="RTCC On bit" mask="0x00008000" name="ON" values="RTCCON__ON"/>
          <bitfield caption="Real-Time Clock Drift Calibration bits" mask="0x03FF0000" name="CAL" values="RTCCON__CAL"/>
        </register>
