Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Alarm Sync bit" name="RTCALRM__ALRMSYNC">
        <value caption="ARPT and ALRMEN may change as a result of a half second rollover during a read. The ARPT must be read repeatedly until the same value is read twice. This must be done since multiple bits may be changing." name="" value="0x1"/>
        <value caption="ARPT and ALRMEN can be read without concerns of rollover because the prescaler is more than 32 real-time clocks away from a half-second rollover" name="" value="0x0"/>
      </value-group>
      <value-group caption="Alarm Pulse Initial Value bit" name="RTCALRM__PIV">
        <value caption="(When ALRMEN is 0)low initial value of the Alarm Pulse / (when ALRMEN is 1) PIV is read-only and returns the state of the Alarm Pulse " name="" value="0x0"/>
        <value caption="(When ALRMEN is 0)high initial value of the Alarm Pulse / (when ALRMEN is 1) PIV is read-only and returns the state of the Alarm Pulse " name="" value="0x1"/>
      </value-group>
      <value-group caption="Chime Enable bit" name="RTCALRM__CHIME">
        <value caption="Chime is enabled ARPT is allowed to rollover from 0x00 to 0xFF" name="" value="0x1"/>
        <value caption="Chime is disabled ARPT stops once it reaches 0x00" name="" value="0x0"/>
      </value-group>
      <value-group caption="Alarm Enable bit" name="RTCALRM__ALRMEN">
        <value caption="Alarm is enabled" name="" value="0x1"/>
        <value caption="Alarm is disabled" name="" value="0x0"/>
      </value-group>
    </module>
    <module caption="" id="01329" name="SPI" version="2">
      <register-group name="SPI">
        <register caption="SPI Control Register" name="SPI1CON" offset="0x0" rw="RW" size="4">
          <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI1CON__SRXISEL"/>
          <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI1CON__STXISEL"/>
          <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI1CON__DISSDI"/>
          <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI1CON__MSTEN"/>
          <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI1CON__CKP"/>
          <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI1CON__SSEN"/>
          <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI1CON__CKE"/>
          <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI1CON__SMP"/>
          <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI1CON__MODE32"/>
          <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI1CON__DISSDO"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI1CON__SIDL"/>
          <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI1CON__ON"/>
          <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI1CON__ENHBUF"/>
          <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI1CON__SPIFE"/>
          <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI1CON__MCLKSEL"/>
          <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI1CON__FRMCNT"/>
          <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI1CON__FRMSYPW"/>
          <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI1CON__MSSEN"/>
          <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI1CON__FRMPOL"/>
          <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI1CON__FRMSYNC"/>
          <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI1CON__FRMEN"/>
        </register>
        <register caption="SPI Control Register" name="SPI2CON" offset="0x200" rw="RW" size="4">
          <bitfield caption="SPI Receive Buffer Full Interrupt Mode bits" mask="0x00000003" name="SRXISEL" values="SPI2CON__SRXISEL"/>
          <bitfield caption="SPI Transmit Buffer Empty Interrupt Mode bits" mask="0x0000000C" name="STXISEL" values="SPI2CON__STXISEL"/>
          <bitfield caption="Disable SDI bit" mask="0x00000010" name="DISSDI" values="SPI2CON__DISSDI"/>
          <bitfield caption="Master Mode Enable bit" mask="0x00000020" name="MSTEN" values="SPI2CON__MSTEN"/>
          <bitfield caption="Clock Polarity Select bit" mask="0x00000040" name="CKP" values="SPI2CON__CKP"/>
          <bitfield caption="Slave Select Enable bit" mask="0x00000080" name="SSEN" values="SPI2CON__SSEN"/>
          <bitfield caption="SPI Clock Edge Select bit" mask="0x00000100" name="CKE" values="SPI2CON__CKE"/>
          <bitfield caption="SPI Data Input Sample Phase bit (master mode only)" mask="0x00000200" name="SMP" values="SPI2CON__SMP"/>
          <bitfield caption="32/16-Bit Communication Select bits" mask="0x00000C00" name="MODE32" values="SPI2CON__MODE32"/>
          <bitfield caption="Disable SDOx pin bit" mask="0x00001000" name="DISSDO" values="SPI2CON__DISSDO"/>
          <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="SPI2CON__SIDL"/>
          <bitfield caption="SPI Peripheral On bit" mask="0x00008000" name="ON" values="SPI2CON__ON"/>
          <bitfield caption="Enhanced Buffer Enable bit" mask="0x00010000" name="ENHBUF" values="SPI2CON__ENHBUF"/>
          <bitfield caption="Frame Sync Pulse Edge Select bit" mask="0x00020000" name="SPIFE" values="SPI2CON__SPIFE"/>
          <bitfield caption="Master Clock Enable bit" mask="0x00040000" name="MCLKSEL" values="SPI2CON__MCLKSEL"/>
          <bitfield caption="Frame Sync Pulse Counter bits. Controls the number of data characters transmitted per pulse. This bit is only valid in FRAMED_SYNC mode." mask="0x07000000" name="FRMCNT" values="SPI2CON__FRMCNT"/>
          <bitfield caption="Frame Sync Pulse Width bit" mask="0x08000000" name="FRMSYPW" values="SPI2CON__FRMSYPW"/>
          <bitfield caption="Master Mode Slave Select Enable bit" mask="0x10000000" name="MSSEN" values="SPI2CON__MSSEN"/>
          <bitfield caption="Frame Sync Polarity bit (Framed SPI mode only)" mask="0x20000000" name="FRMPOL" values="SPI2CON__FRMPOL"/>
          <bitfield caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" mask="0x40000000" name="FRMSYNC" values="SPI2CON__FRMSYNC"/>
          <bitfield caption="Framed SPI Support bit" mask="0x80000000" name="FRMEN" values="SPI2CON__FRMEN"/>
        </register>
