Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Frame Sync Polarity bit (Framed SPI mode only)" name="SPI2CON__FRMPOL">
        <value caption="Frame pulse is active-high" name="" value="0x1"/>
        <value caption="Frame pulse is active-low" name="" value="0x0"/>
      </value-group>
      <value-group caption="Frame Sync Pulse Direction Control on SSx pin bit (Framed SPI mode only)" name="SPI2CON__FRMSYNC">
        <value caption="Frame sync pulse input (Slave mode)" name="" value="0x1"/>
        <value caption="Frame sync pulse output (Master mode)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Framed SPI Support bit" name="SPI2CON__FRMEN">
        <value caption="Framed SPI support is enabled (SSx pin used as FSYNC input/output)" name="" value="0x1"/>
        <value caption="Framed SPI support is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI1STAT__SPIRBF">
        <value caption="Receive buffer SPIxRXB is full" name="" value="0x1"/>
        <value caption="Receive buffer SPIxRXB is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI1STAT__SPITBF">
        <value caption="Transmit not yet started SPITXB is full" name="" value="0x1"/>
        <value caption="Transmit buffer is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI1STAT__SPITBE">
        <value caption="Transmit buffer SPIxTXB is empty" name="" value="0x1"/>
        <value caption="Transmit buffer SPIxTXB is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI1STAT__SPIRBE">
        <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1"/>
        <value caption="RX FIFO is not empty (CRPTR != SWPTR)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI1STAT__SPIROV">
        <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1"/>
        <value caption="No overflow has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shift Register Empty bit (valid only when ENHBUF = 1)" name="SPI1STAT__SRMT">
        <value caption="When SPI module shift register is empty" name="" value="0x1"/>
        <value caption="When SPI module shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI1STAT__SPITUR">
        <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1"/>
        <value caption="Transmit buffer has no underrun condition" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI1STAT__SPIBUSY">
        <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1"/>
        <value caption="SPI peripheral is currently idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI1STAT__FRMERR">
        <value caption="Frame error detected" name="" value="0x1"/>
        <value caption="No Frame error detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Receive Buffer Full Status bit" name="SPI2STAT__SPIRBF">
        <value caption="Receive buffer SPIxRXB is full" name="" value="0x1"/>
        <value caption="Receive buffer SPIxRXB is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Full Status bit" name="SPI2STAT__SPITBF">
        <value caption="Transmit not yet started SPITXB is full" name="" value="0x1"/>
        <value caption="Transmit buffer is not full" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Transmit Buffer Empty Status bit" name="SPI2STAT__SPITBE">
        <value caption="Transmit buffer SPIxTXB is empty" name="" value="0x1"/>
        <value caption="Transmit buffer SPIxTXB is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="RX FIFO Empty bit (valid only when ENHBUF = 1)" name="SPI2STAT__SPIRBE">
        <value caption="RX FIFO is empty (CRPTR = SWPTR)" name="" value="0x1"/>
        <value caption="RX FIFO is not empty (CRPTR != SWPTR)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="SPI2STAT__SPIROV">
        <value caption="A new data is completely received and discarded. The user software has not read the previous data in the SPIxBUF register." name="" value="0x1"/>
        <value caption="No overflow has occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Shift Register Empty bit (valid only when ENHBUF = 1)" name="SPI2STAT__SRMT">
        <value caption="When SPI module shift register is empty" name="" value="0x1"/>
        <value caption="When SPI module shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Under Run bit" name="SPI2STAT__SPITUR">
        <value caption="Transmit buffer has encountered an underrun condition" name="" value="0x1"/>
        <value caption="Transmit buffer has no underrun condition" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Activity Status bit" name="SPI2STAT__SPIBUSY">
        <value caption="SPI peripheral is currently busy with some transactions" name="" value="0x1"/>
        <value caption="SPI peripheral is currently idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="SPI Frame Error status bit" name="SPI2STAT__FRMERR">
        <value caption="Frame error detected" name="" value="0x1"/>
        <value caption="No Frame error detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Audio Protocol Mode bit" name="SPI1CON2__AUDMOD">
        <value caption="PCM/DSP mode" name="" value="0x3"/>
        <value caption="Right Justified mode" name="" value="0x2"/>
        <value caption="Left Justified mode" name="" value="0x1"/>
        <value caption="I2S mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Audio Data Format bit" name="SPI1CON2__AUDMONO">
        <value caption="Audio data is mono (Each data word is transmitted on both left and right channels)" name="" value="0x1"/>
        <value caption="Audio data is stereo" name="" value="0x0"/>
      </value-group>
      <value-group caption="Enable Audio CODEC Support bit" name="SPI1CON2__AUDEN">
        <value caption="Audio protocol enabled" name="" value="0x1"/>
        <value caption="Audio protocol disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Transmit Underrun bit" name="SPI1CON2__IGNTUR">
        <value caption="A TUR is not a critical error and zeros are transmitted until the SPIxTXB is not empty" name="" value="0x1"/>
        <value caption="A TUR is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Ignore Receive Overflow bit" name="SPI1CON2__IGNROV">
        <value caption="A ROV is not a critical error; during ROV data in the fifo is not overwritten by receive data" name="" value="0x1"/>
        <value caption="A ROV is a critical error which stop SPI operation" name="" value="0x0"/>
      </value-group>
