Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
        <register caption="SQI XIP Control Register 2" name="SQI1XCON2" offset="0x4" rw="RW" size="4">
          <bitfield mask="0x000000FF" name="MODECODE"/>
          <bitfield caption="Mode Byte Cycle Enable bits" mask="0x00000300" name="MODEBYTES" values="SQI1XCON2__MODEBYTES"/>
          <bitfield caption="Device Select bits" mask="0x00000C00" name="DEVSEL" values="SQI1XCON2__DEVSEL"/>
        </register>
        <register caption="SQI Configuration Register" name="SQI1CFG" offset="0x8" rw="RW" size="4">
          <bitfield caption="Mode Select bits" mask="0x00000007" name="MODE" values="SQI1CFG__MODE"/>
          <bitfield caption="Clock Phase Select bit" mask="0x00000008" name="CPHA" values="SQI1CFG__CPHA"/>
          <bitfield caption="Clock Polarity Select bit" mask="0x00000010" name="CPOL" values="SQI1CFG__CPOL"/>
          <bitfield caption="Data Format Select bit" mask="0x00000020" name="LSBF" values="SQI1CFG__LSBF"/>
          <bitfield mask="0x00000200" name="WP"/>
          <bitfield mask="0x00000400" name="HOLD"/>
          <bitfield caption="Burst Configuration bit" mask="0x00001000" name="BURSTEN" values="SQI1CFG__BURSTEN"/>
          <bitfield caption="Software Reset Select bit" mask="0x00010000" name="RESET" values="SQI1CFG__RESET"/>
          <bitfield caption="Transmit Buffer Reset bit" mask="0x00020000" name="TXBUFRST" values="SQI1CFG__TXBUFRST"/>
          <bitfield caption="Receive Buffer Reset bit" mask="0x00040000" name="RXBUFRST" values="SQI1CFG__RXBUFRST"/>
          <bitfield caption="Control Buffer Reset bit" mask="0x00080000" name="CONBUFRST" values="SQI1CFG__CONBUFRST"/>
          <bitfield caption="Data Output Enable bits" mask="0x00300000" name="DATAEN" values="SQI1CFG__DATAEN"/>
          <bitfield caption="SQI Enable bit" mask="0x00800000" name="SQIEN" values="SQI1CFG__SQIEN"/>
          <bitfield caption="Chip Select Output Enable bits" mask="0x03000000" name="CSEN" values="SQI1CFG__CSEN"/>
        </register>
        <register caption="SQI Control Register" name="SQI1CON" offset="0xc" rw="RW" size="4">
          <bitfield mask="0x0000FFFF" name="TXRXCOUNT"/>
          <bitfield mask="0x00030000" name="CMDINIT"/>
          <bitfield mask="0x000C0000" name="LANEMODE"/>
          <bitfield caption="SQI Device Select bits" mask="0x00300000" name="DEVSEL" values="SQI1CON__DEVSEL"/>
          <bitfield caption="Chip Select Assert bit" mask="0x00400000" name="DASSERT" values="SQI1CON__DASSERT"/>
          <bitfield caption="Double Data Rate Mode bit" mask="0x00800000" name="DDRMODE" values="SQI1CON__DDRMODE"/>
          <bitfield caption="Flash Status Check bit" mask="0x01000000" name="SCHECK" values="SQI1CON__SCHECK"/>
        </register>
        <register caption="SQI Clock Control Register" name="SQI1CLKCON" offset="0x10" rw="RW" size="4">
          <bitfield caption="Tsqi Clock Enable Select bit" mask="0x00000001" name="EN" values="SQI1CLKCON__EN"/>
          <bitfield caption="Tsqi Clock Stable Select bit" mask="0x00000002" name="STABLE" values="SQI1CLKCON__STABLE"/>
          <bitfield caption="SQI Clock Tsqi Frequency Select bits" mask="0x0007FF00" name="CLKDIV" values="SQI1CLKCON__CLKDIV"/>
        </register>
        <register caption="SQI Command Threshold Register" name="SQI1CMDTHR" offset="0x14" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="RXCMDTHR"/>
          <bitfield mask="0x00003F00" name="TXCMDTHR"/>
        </register>
        <register caption="SQI Interrupt Threshold Register" name="SQI1INTTHR" offset="0x18" rw="RW" size="4">
          <bitfield mask="0x0000003F" name="RXINTTHR"/>
          <bitfield mask="0x00003F00" name="TXINTTHR"/>
        </register>
        <register caption="SQI Interrupt Enable Register" name="SQI1INTEN" offset="0x1c" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Empty Interrupt Enable bit" mask="0x00000001" name="TXEMPTYIE" values="SQI1INTEN__TXEMPTYIE"/>
          <bitfield caption="Transmit Buffer Full Interrupt Enable bit" mask="0x00000002" name="TXFULLIE" values="SQI1INTEN__TXFULLIE"/>
          <bitfield caption="Transmit Buffer Threshold Interrupt Enable bit" mask="0x00000004" name="TXTHRIE" values="SQI1INTEN__TXTHRIE"/>
          <bitfield caption="Receive Buffer Empty Interrupt Enabled bit" mask="0x00000008" name="RXEMPTYIE" values="SQI1INTEN__RXEMPTYIE"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable bit" mask="0x00000010" name="RXFULLIE" values="SQI1INTEN__RXFULLIE"/>
          <bitfield caption="Receive Buffer Threshold Interrupt Enable bit" mask="0x00000020" name="RXTHRIE" values="SQI1INTEN__RXTHRIE"/>
          <bitfield caption="Control Buffer Full Interrupt Enable bit" mask="0x00000040" name="CONFULLIE" values="SQI1INTEN__CONFULLIE"/>
          <bitfield caption="Control Buffer Empty Interrupt Enabled bit" mask="0x00000080" name="CONEMPTYIE" values="SQI1INTEN__CONEMPTYIE"/>
          <bitfield caption="Control Buffer Threshold Interrupt Enable bit" mask="0x00000100" name="CONTHRIE" values="SQI1INTEN__CONTHRIE"/>
          <bitfield caption="DMA Buffer Descriptor Done Interrupt Enable bit" mask="0x00000200" name="BDDONEIE" values="SQI1INTEN__BDDONEIE"/>
          <bitfield caption="DMA Buffer Descriptor Packet Complete Interrupt Enable bit" mask="0x00000400" name="PKTCOMPIE" values="SQI1INTEN__PKTCOMPIE"/>
          <bitfield caption="DMA Bus Error Interrupt Enable bit" mask="0x00000800" name="DMAEIE" values="SQI1INTEN__DMAEIE"/>
        </register>
        <register caption="" name="SQI1INTSTAT" offset="0x20" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Empty Interrupt Status bit" mask="0x00000001" name="TXEMPTYIF" values="SQI1INTSTAT__TXEMPTYIF"/>
          <bitfield caption="Transmit Buffer Full Interrupt Status bit" mask="0x00000002" name="TXFULLIF" values="SQI1INTSTAT__TXFULLIF"/>
          <bitfield caption="Transmit Buffer Threshold Interrupt Status bit" mask="0x00000004" name="TXTHRIF" values="SQI1INTSTAT__TXTHRIF"/>
          <bitfield caption="Receive Buffer Empty Interrupt Status bit" mask="0x00000008" name="RXEMPTYIF" values="SQI1INTSTAT__RXEMPTYIF"/>
          <bitfield caption="Receive Buffer Full Interrupt Status bit" mask="0x00000010" name="RXFULLIF" values="SQI1INTSTAT__RXFULLIF"/>
          <bitfield caption="Receive Buffer Threshold Interrupt Status bit" mask="0x00000020" name="RXTHRIF" values="SQI1INTSTAT__RXTHRIF"/>
          <bitfield caption="Control Buffer Full Interrupt Status bit" mask="0x00000040" name="CONFULLIF" values="SQI1INTSTAT__CONFULLIF"/>
          <bitfield caption="Control Buffer Empty Interrupt Status bit" mask="0x00000080" name="CONEMPTYIF" values="SQI1INTSTAT__CONEMPTYIF"/>
          <bitfield caption="Control Buffer Threshold Interrupt Status bit" mask="0x00000100" name="CONTHRIF" values="SQI1INTSTAT__CONTHRIF"/>
          <bitfield caption="DMA Buffer Descriptor Done Interrupt Status bit" mask="0x00000200" name="BDDONEIF" values="SQI1INTSTAT__BDDONEIF"/>
          <bitfield caption="DMA Buffer Descriptor Processor Packet Complete Interrupt Status bit" mask="0x00000400" name="PKTCOMPIF" values="SQI1INTSTAT__PKTCOMPIF"/>
          <bitfield caption="DMA Bus Error Interrupt Flag bit" mask="0x00000800" name="DMAEIF" values="SQI1INTSTAT__DMAEIF"/>
        </register>
