Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Buffer Descriptor Poll Enable bit" name="SQI1BDCON__POLLEN">
        <value caption="BDP poll enabled" name="" value="0x0"/>
        <value caption="BDP poll is not enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Buffer Descriptor Processor Start bit" name="SQI1BDCON__START">
        <value caption="Start the buffer descriptor processor" name="" value="0x0"/>
        <value caption="Disable the buffer descriptor processor" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor Active Status bit" name="SQI1BDSTAT__DMAACTV">
        <value caption="Buffer Descriptor Processor is active" name="" value="0x0"/>
        <value caption="Buffer Descriptor Processor is idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor Start Status bit" name="SQI1BDSTAT__DMASTART">
        <value caption="DMA has started" name="" value="0x0"/>
        <value caption="DMA has not started" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Buffer Descriptor Processor State Status bits" name="SQI1BDSTAT__BDSTATE">
        <value caption="Reserved" name="" value="0x0"/>
        <value caption="Reserved" name="" value="0x0"/>
        <value caption="Reserved" name="" value="0x0"/>
        <value caption="Fetched buffer descriptor is disabled" name="" value="0x0"/>
        <value caption="Descriptor is done" name="" value="0x0"/>
        <value caption="Data phase" name="" value="0x0"/>
        <value caption="Buffer descriptor is loading" name="" value="0x0"/>
        <value caption="Descriptor fetch request is pending" name="" value="0x0"/>
        <value caption="Idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Empty Interrupt Signal Enable bit" name="SQI1INTSIGEN__TXEMPTYISE">
        <value caption="Interrupt is enabled" name="" value="0x1"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Full Interrupt Signal Enable bit" name="SQI1INTSIGEN__TXFULLISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Threshold Interrupt Signal Enable bit" name="SQI1INTSIGEN__TXTHRISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Empty Interrupt Signal Enable bit" name="SQI1INTSIGEN__RXEMPTYISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Full Interrupt Signal Enable bit" name="SQI1INTSIGEN__RXFULLISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Threshold Interrupt Signal Enable bit" name="SQI1INTSIGEN__RXTHRISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Control Buffer Full Interrupt Signal Enable bit" name="SQI1INTSIGEN__CONFULLISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Control Buffer Empty Interrupt Signal Enable bit" name="SQI1INTSIGEN__CONEMPTYISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Control Buffer Threshold Interrupt Signal Enable bit" name="SQI1INTSIGEN__CONTHRISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Buffer Descriptor Done Interrupt Signal Enable bit" name="SQI1INTSIGEN__BDDONEISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Buffer Descriptor Packet Complete Interrupt Signal Enable bit" name="SQI1INTSIGEN__PKTCOMPISE">
        <value caption="Interrupt is enabled" name="" value="0x0"/>
        <value caption="Interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="DMA Bus Error Interrupt Signal Enable bit" name="SQI1INTSIGEN__DMAEISE">
        <value caption="Interrupt signal is enabled" name="" value="0x0"/>
        <value caption="Interrupt signal is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Clock Output Delay bits" name="SQI1TAPCON__CLKOUTDLY">
        <value caption="16 taps added on clock output" name="" value="0xf"/>
        <value caption="15 taps added on clock output" name="" value="0xe"/>
        <value caption="2 taps added on clock output" name="" value="0x1"/>
        <value caption="1 tap added on clock output" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Data Output Delay bits" name="SQI1TAPCON__DATAOUTDLY">
        <value caption="16 taps added on clock output" name="" value="0x0"/>
        <value caption="15 taps added on clock output" name="" value="0x0"/>
        <value caption="2 taps added on clock output" name="" value="0x0"/>
        <value caption="1 tap added on clock output" name="" value="0x0"/>
      </value-group>
      <value-group caption="SQI Clock Input Delay bits" name="SQI1TAPCON__SDRCLKINDLY">
        <value caption="64 taps added on clock input" name="" value="0x0"/>
        <value caption="63 taps added on clock input" name="" value="0x0"/>
        <value caption="2 taps added on clock input" name="" value="0x0"/>
        <value caption="1 tap added on clock input" name="" value="0x0"/>
      </value-group>
      <value-group caption="Number of Status Bytes bits" name="SQI1MEMSTAT__STATBYTES">
        <value caption="Reserved" name="" value="0x0"/>
        <value caption="Status command/read is 2 bytes long" name="" value="0x0"/>
        <value caption="Status command/read is 1 byte long" name="" value="0x0"/>
        <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Status Command/Read Lane Mode bits" name="SQI1MEMSTAT__STATTYPE">
        <value caption="Reserved" name="" value="0x0"/>
        <value caption="Status command and read are executed in Quad Lane mode" name="" value="0x0"/>
        <value caption="Status command and read are executed in Dual Lane mode" name="" value="0x0"/>
        <value caption="Status command and read are executed in Single Lane mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Statis Bit Position in Flash bit" name="SQI1MEMSTAT__STATPOS">
        <value caption="BUSY bit position is bit 7 in status register" name="" value="0x0"/>
        <value caption="BUSY bit position is bit 0 in status register" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash Initialization 1 Command Type bits" name="SQI1XCON3__INIT1TYPE">
        <value caption="Reserved" name="" value="0x0"/>
        <value caption="INIT1 commands are sent in Quad Lane mode" name="" value="0x0"/>
        <value caption="INIT1 commands are sent in Dual Lane mode" name="" value="0x0"/>
        <value caption="INIT1 commadns are sent in Single Lane mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash Initialization 1 Command Count bits" name="SQI1XCON3__INIT1COUNT">
        <value caption="INIT1CMD3, INIT1CMD2, and INIT1CMD3 are sent." name="" value="0x0"/>
        <value caption="INIT1CMD1 and INIT1CMD2 are sent, but INIT1CMD3 is still pending." name="" value="0x0"/>
        <value caption="INIT1CMD1 is sent, but INIT1CMD2 and INIT1CMD3 are still pending." name="" value="0x0"/>
        <value caption="No commands are sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Flash Initialization 1 Command Status Check bit" name="SQI1XCON3__INIT1SCHECK">
        <value caption="Check the status after executing the INIT1 command" name="" value="0x0"/>
        <value caption="Do not check the status" name="" value="0x0"/>
      </value-group>
