Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Timer Clock Source Select bit" name="T3CON__TCS">
        <value caption="External clock from TxCK pin" name="" value="0x1"/>
        <value caption="Internal peripheral clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T3CON__T32">
        <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1"/>
        <value caption="Odd numbered and even numbered timers form separate 16-bit timers" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T3CON__TCKPS">
        <value caption="1:256 prescale value" name="" value="0x7"/>
        <value caption="1:64 prescale value" name="" value="0x6"/>
        <value caption="1:32 prescale value" name="" value="0x5"/>
        <value caption="1:16 prescale value" name="" value="0x4"/>
        <value caption="1:8 prescale value" name="" value="0x3"/>
        <value caption="1:4 prescale value" name="" value="0x2"/>
        <value caption="1:2 prescale value" name="" value="0x1"/>
        <value caption="1:1 prescale value" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T3CON__TGATE">
        <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1"/>
        <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T3CON__SIDL">
        <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
        <value caption="Continue operation even in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer On bit" name="T3CON__ON">
        <value caption="Module is enabled" name="" value="0x1"/>
        <value caption="Module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T4CON__TCS">
        <value caption="External clock from TxCK pin" name="" value="0x1"/>
        <value caption="Internal peripheral clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T4CON__T32">
        <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1"/>
        <value caption="Odd numbered and even numbered timers form separate 16-bit timers" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T4CON__TCKPS">
        <value caption="1:256 prescale value" name="" value="0x7"/>
        <value caption="1:64 prescale value" name="" value="0x6"/>
        <value caption="1:32 prescale value" name="" value="0x5"/>
        <value caption="1:16 prescale value" name="" value="0x4"/>
        <value caption="1:8 prescale value" name="" value="0x3"/>
        <value caption="1:4 prescale value" name="" value="0x2"/>
        <value caption="1:2 prescale value" name="" value="0x1"/>
        <value caption="1:1 prescale value" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T4CON__TGATE">
        <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1"/>
        <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T4CON__SIDL">
        <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
        <value caption="Continue operation even in Idle mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer On bit" name="T4CON__ON">
        <value caption="Module is enabled" name="" value="0x1"/>
        <value caption="Module is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Clock Source Select bit" name="T5CON__TCS">
        <value caption="External clock from TxCK pin" name="" value="0x1"/>
        <value caption="Internal peripheral clock" name="" value="0x0"/>
      </value-group>
      <value-group caption="32-Bit Timer Mode Select bit" name="T5CON__T32">
        <value caption="Odd numbered and even numbered timers form a 32-bit timer" name="" value="0x1"/>
        <value caption="Odd numbered and even numbered timers form separate 16-bit timers" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T5CON__TCKPS">
        <value caption="1:256 prescale value" name="" value="0x7"/>
        <value caption="1:64 prescale value" name="" value="0x6"/>
        <value caption="1:32 prescale value" name="" value="0x5"/>
        <value caption="1:16 prescale value" name="" value="0x4"/>
        <value caption="1:8 prescale value" name="" value="0x3"/>
        <value caption="1:4 prescale value" name="" value="0x2"/>
        <value caption="1:2 prescale value" name="" value="0x1"/>
        <value caption="1:1 prescale value" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T5CON__TGATE">
        <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is enabled" name="" value="0x1"/>
        <value caption="(When TCS is 1): This bit is ignored and is read as 0 / (When TCS=0): Gated time accumulation is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T5CON__SIDL">
        <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1"/>
        <value caption="Continue operation even in Idle mode" name="" value="0x0"/>
      </value-group>
