Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Address Character Detect bit (bit 8 of received data = 1)" name="U3STA__ADDEN">
        <value caption="Address Detect mode is enabled. If 9-bit mode is not selected, this control bit has no effect" name="" value="0x1"/>
        <value caption="Address Detect mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U3STA__URXISEL">
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full" name="" value="0x2"/>
        <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full" name="" value="0x1"/>
        <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Shift Register is Empty bit (read-only)" name="U3STA__TRMT">
        <value caption="Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)" name="" value="0x1"/>
        <value caption="Transmit shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit (read-only)" name="U3STA__UTXBF">
        <value caption="Transmit buffer is full" name="" value="0x1"/>
        <value caption="Transmit buffer is not full, at least one more character can be written" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Enable bit" name="U3STA__UTXEN">
        <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1"/>
        <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Break bit" name="U3STA__UTXBRK">
        <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits" name="" value="0x1"/>
        <value caption="Break transmission is disabled or completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receiver Enable bit" name="U3STA__URXEN">
        <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1"/>
        <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Polarity Inversion bit" name="U3STA__UTXINV">
        <value caption="(If IrDA mode is disabled) UxTX Idle state is 0 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 1" name="" value="0x1"/>
        <value caption="(If IrDA mode is disabled) UxTX Idle state is 1 / (If IrDA mode is enabled) IrDA encoded UxTX Idle state is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U3STA__UTXISEL">
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2"/>
        <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1"/>
        <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0"/>
      </value-group>
      <value-group caption="UARTx Address Match Mask bits" name="U3STA__MASK">
        <value caption="Corresponding ADDRx bits are used to detect the address match" name="" value="0x1fe"/>
        <value caption="Corresponding ADDRx bits are not used to detect the address match." name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Data Available bit (read-only)" name="U1STA__URXDA">
        <value caption="Receive buffer has data" name="" value="0x1"/>
        <value caption="Receive buffer is empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Overrun Error Status bit." name="U1STA__OERR">
        <value caption="Receive buffer has overflowed" name="" value="0x1"/>
        <value caption="Receive buffer has not overflowed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Framing Error Status bit (read-only)" name="U1STA__FERR">
        <value caption="Framing error has been detected for the current character" name="" value="0x1"/>
        <value caption="Framing error has not been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Parity Error Status bit (read-only)" name="U1STA__PERR">
        <value caption="Parity error has been detected for the current character" name="" value="0x1"/>
        <value caption="Parity error has not been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receiver Idle bit (read-only)" name="U1STA__RIDLE">
        <value caption="Receiver is Idle" name="" value="0x1"/>
        <value caption="Data is being received" name="" value="0x0"/>
      </value-group>
      <value-group caption="Address Character Detect bit (bit 8 of received data = 1)" name="U1STA__ADDEN">
        <value caption="Address Detect mode is enabled. If 9-bit mode is not selected, this control bit has no effect" name="" value="0x1"/>
        <value caption="Address Detect mode is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U1STA__URXISEL">
        <value caption="Reserved" name="" value="0x3"/>
        <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full" name="" value="0x2"/>
        <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full" name="" value="0x1"/>
        <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Shift Register is Empty bit (read-only)" name="U1STA__TRMT">
        <value caption="Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)" name="" value="0x1"/>
        <value caption="Transmit shift register is not empty" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit (read-only)" name="U1STA__UTXBF">
        <value caption="Transmit buffer is full" name="" value="0x1"/>
        <value caption="Transmit buffer is not full, at least one more character can be written" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Enable bit" name="U1STA__UTXEN">
        <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1"/>
        <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Break bit" name="U1STA__UTXBRK">
        <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits" name="" value="0x1"/>
        <value caption="Break transmission is disabled or completed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receiver Enable bit" name="U1STA__URXEN">
        <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1"/>
        <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module" name="" value="0x0"/>
      </value-group>
