Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="UARTx Address Match Mask bits" name="U2STA__MASK">
        <value caption="Corresponding ADDRx bits are used to detect the address match" name="" value="0x1fe"/>
        <value caption="Corresponding ADDRx bits are not used to detect the address match." name="" value="0x0"/>
      </value-group>
      <value-group caption="Baud Rate Generator" name="U3BRG__BRG">
        <value caption="Divisor value is 1" name="" value="0x1"/>
      </value-group>
      <value-group caption="Baud Rate Generator" name="U1BRG__BRG">
        <value caption="Divisor value is 1" name="" value="0x1"/>
      </value-group>
      <value-group caption="Baud Rate Generator" name="U2BRG__BRG">
        <value caption="Divisor value is 1" name="" value="0x1"/>
      </value-group>
    </module>
    <module caption="" id="02813" name="USB" version="3">
      <register-group name="USB">
        <register caption="USB OTG Interrupt Status Register (x = 1 and 2)" name="U1OTGIR" offset="0x40" rw="RW" size="4">
          <bitfield caption="A-Device" mask="0x00000001" name="VBUSVDIF" values="U1OTGIR__VBUSVDIF"/>
          <bitfield caption="B-Device" mask="0x00000004" name="SESENDIF" values="U1OTGIR__SESENDIF"/>
          <bitfield caption="Session Valid Change Indicator bit" mask="0x00000008" name="SESVDIF" values="U1OTGIR__SESVDIF"/>
          <bitfield caption="Bus Activity Indicator bit" mask="0x00000010" name="ACTVIF" values="U1OTGIR__ACTVIF"/>
          <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATEIF" values="U1OTGIR__LSTATEIF"/>
          <bitfield caption="1 Millisecond Timer bit" mask="0x00000040" name="T1MSECIF" values="U1OTGIR__T1MSECIF"/>
          <bitfield caption="ID State Change Indicator bit" mask="0x00000080" name="IDIF" values="U1OTGIR__IDIF"/>
        </register>
        <register caption="USB OTG Interrupt Enable Register (x = 1 and 2)" name="U1OTGIE" offset="0x50" rw="RW" size="4">
          <bitfield caption="A- Vbus Valid Interrupt Enable bit" mask="0x00000001" name="VBUSVDIE" values="U1OTGIE__VBUSVDIE"/>
          <bitfield caption="B-Session End Interrupt Enable bit" mask="0x00000004" name="SESENDIE" values="U1OTGIE__SESENDIE"/>
          <bitfield caption="Session Valid Interrupt Enable bit" mask="0x00000008" name="SESVDIE" values="U1OTGIE__SESVDIE"/>
          <bitfield caption="Bus Activity Interrupt Enable bit" mask="0x00000010" name="ACTVIE" values="U1OTGIE__ACTVIE"/>
          <bitfield caption="Line State Interrupt Enable bit" mask="0x00000020" name="LSTATEIE" values="U1OTGIE__LSTATEIE"/>
          <bitfield caption="1 Millisecond Timer Interrupt Enable bit" mask="0x00000040" name="T1MSECIE" values="U1OTGIE__T1MSECIE"/>
          <bitfield caption="ID Interrupt Enable bit" mask="0x00000080" name="IDIE" values="U1OTGIE__IDIE"/>
        </register>
        <register caption="USB OTG Status Register (x = 1 and 2)" name="U1OTGSTAT" offset="0x60" rw="RW" size="4">
          <bitfield caption="A-Device Vbus Valid Indicator bit" mask="0x00000001" name="VBUSVD" values="U1OTGSTAT__VBUSVD"/>
          <bitfield caption="B-Device Session End Indicator bit" mask="0x00000004" name="SESEND" values="U1OTGSTAT__SESEND"/>
          <bitfield caption="Session Valid Indicator bit" mask="0x00000008" name="SESVD" values="U1OTGSTAT__SESVD"/>
          <bitfield caption="Line State Stable Indicator bit" mask="0x00000020" name="LSTATE" values="U1OTGSTAT__LSTATE"/>
          <bitfield caption="ID Pin State Indicator bit" mask="0x00000080" name="ID" values="U1OTGSTAT__ID"/>
        </register>
        <register caption="USB OTG Control Register (x = 1 and 2)" name="U1OTGCON" offset="0x70" rw="RW" size="4">
          <bitfield caption="Vbus Discharge Enable bit" mask="0x00000001" name="VBUSDIS" values="U1OTGCON__VBUSDIS"/>
          <bitfield caption="Vbus Charge Enable bit" mask="0x00000002" name="VBUSCHG" values="U1OTGCON__VBUSCHG"/>
          <bitfield caption="OTG Functionality Enable bit" mask="0x00000004" name="OTGEN" values="U1OTGCON__OTGEN"/>
          <bitfield caption="Vbus Power-on bit" mask="0x00000008" name="VBUSON" values="U1OTGCON__VBUSON"/>
          <bitfield caption="D- Pull-Down Enable bit" mask="0x00000010" name="DMPULDWN" values="U1OTGCON__DMPULDWN"/>
          <bitfield caption="D+ Pull-Down Enable bit" mask="0x00000020" name="DPPULDWN" values="U1OTGCON__DPPULDWN"/>
          <bitfield caption="D- Pull-Up Enable bit" mask="0x00000040" name="DMPULUP" values="U1OTGCON__DMPULUP"/>
          <bitfield caption="D+ Pull-Up Enable bit" mask="0x00000080" name="DPPULUP" values="U1OTGCON__DPPULUP"/>
        </register>
        <register caption="USB Power Control Register (x = 1 and 2)" name="U1PWRC" offset="0x80" rw="RW" size="4">
          <bitfield caption="USB Operation Enable bit" mask="0x00000001" name="USBPWR" values="U1PWRC__USBPWR"/>
          <bitfield caption="USB Suspend Mode bit" mask="0x00000002" name="USUSPEND" values="U1PWRC__USUSPEND"/>
          <bitfield caption="USB Module Busy bit" mask="0x00000008" name="USBBUSY" values="U1PWRC__USBBUSY"/>
          <bitfield caption="USB Sleep Entry Guard bit" mask="0x00000010" name="USLPGRD" values="U1PWRC__USLPGRD"/>
          <bitfield caption="USB Activity Pending bit" mask="0x00000080" name="UACTPND" values="U1PWRC__UACTPND"/>
        </register>
        <register caption="USB Interrupt Register (x = 1 and 2)" name="U1IR" offset="0x200" rw="RW" size="4">
          <bitfield caption="(Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode" mask="0x00000001" name="URSTIF_DETACHIF" values="U1IR__URSTIF_DETACHIF"/>
          <bitfield caption="USB Error Condition Interrupt bit" mask="0x00000002" name="UERRIF" values="U1IR__UERRIF"/>
          <bitfield caption="SOF Token Interrupt bit" mask="0x00000004" name="SOFIF" values="U1IR__SOFIF"/>
          <bitfield caption="Token Processing Complete Interrupt bit" mask="0x00000008" name="TRNIF" values="U1IR__TRNIF"/>
          <bitfield caption="Idle Detect Interrupt bit" mask="0x00000010" name="IDLEIF" values="U1IR__IDLEIF"/>
          <bitfield caption="Resume Interrupt bit" mask="0x00000020" name="RESUMEIF" values="U1IR__RESUMEIF"/>
          <bitfield caption="Peripheral Attach Interrupt bit" mask="0x00000040" name="ATTACHIF" values="U1IR__ATTACHIF"/>
          <bitfield caption="STALL Handshake Interrupt bit" mask="0x00000080" name="STALLIF" values="U1IR__STALLIF"/>
        </register>
