Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="Session Valid Interrupt Enable bit" name="U1OTGIE__SESVDIE">
        <value caption="Session valid interrupt is enabled" name="" value="0x1"/>
        <value caption="Session valid interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Bus Activity Interrupt Enable bit" name="U1OTGIE__ACTVIE">
        <value caption="ACTIVITY interrupt is enabled" name="" value="0x1"/>
        <value caption="ACTIVITY interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Line State Interrupt Enable bit" name="U1OTGIE__LSTATEIE">
        <value caption="Line state interrupt is enabled" name="" value="0x1"/>
        <value caption="Line state interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="1 Millisecond Timer Interrupt Enable bit" name="U1OTGIE__T1MSECIE">
        <value caption="1 millisecond timer interrupt is enabled" name="" value="0x1"/>
        <value caption="1 millisecond timer interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="ID Interrupt Enable bit" name="U1OTGIE__IDIE">
        <value caption="ID interrupt is enabled" name="" value="0x1"/>
        <value caption="ID interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="A-Device Vbus Valid Indicator bit" name="U1OTGSTAT__VBUSVD">
        <value caption="Vbus voltage is above Session Valid on the A device" name="" value="0x1"/>
        <value caption="Vbus voltage is below Session Valid on the A device" name="" value="0x0"/>
      </value-group>
      <value-group caption="B-Device Session End Indicator bit" name="U1OTGSTAT__SESEND">
        <value caption="Vbus voltage is below Session Valid on the B device" name="" value="0x1"/>
        <value caption="Vbus voltage is above Session Valid on the B device" name="" value="0x0"/>
      </value-group>
      <value-group caption="Session Valid Indicator bit" name="U1OTGSTAT__SESVD">
        <value caption="Vbus voltage is above Session Valid on the A or B device" name="" value="0x1"/>
        <value caption="Vbus voltage is below Session Valid on the A or B device" name="" value="0x0"/>
      </value-group>
      <value-group caption="Line State Stable Indicator bit" name="U1OTGSTAT__LSTATE">
        <value caption="USB line state (SE0 (UxCON) and JSTATE (UxCON&lt;7&gt;)) has been stable for the previous 1 ms" name="" value="0x1"/>
        <value caption="USB line state (SE0 and JSTATE) has not been stable for the previous 1 ms" name="" value="0x0"/>
      </value-group>
      <value-group caption="ID Pin State Indicator bit" name="U1OTGSTAT__ID">
        <value caption="No cable is attached or a Type-B cable has been plugged into the USB receptacle" name="" value="0x1"/>
        <value caption="A Type-A cable has been plugged into the USB receptacle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Discharge Enable bit" name="U1OTGCON__VBUSDIS">
        <value caption="Vbus line is discharged through a pull-down resistor" name="" value="0x1"/>
        <value caption="Vbus line is not discharged through a resistor" name="" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Charge Enable bit" name="U1OTGCON__VBUSCHG">
        <value caption="Vbus line is charged through a pull-up resistor" name="" value="0x1"/>
        <value caption="Vbus line is not charged through a resistor" name="" value="0x0"/>
      </value-group>
      <value-group caption="OTG Functionality Enable bit" name="U1OTGCON__OTGEN">
        <value caption="DPPULUP" name="" value="0x1"/>
        <value caption="DPPULUP" name="" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Power-on bit" name="U1OTGCON__VBUSON">
        <value caption="Vbus line is powered" name="" value="0x1"/>
        <value caption="Vbus line is not powered" name="" value="0x0"/>
      </value-group>
      <value-group caption="D- Pull-Down Enable bit" name="U1OTGCON__DMPULDWN">
        <value caption="D- data line pull-down resistor is enabled" name="" value="0x1"/>
        <value caption="D- data line pull-down resistor is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="D+ Pull-Down Enable bit" name="U1OTGCON__DPPULDWN">
        <value caption="D+ data line pull-down resistor is enabled" name="" value="0x1"/>
        <value caption="D+ data line pull-down resistor is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="D- Pull-Up Enable bit" name="U1OTGCON__DMPULUP">
        <value caption="D- data line pull-up resistor is enabled" name="" value="0x1"/>
        <value caption="D- data line pull-up resistor is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="D+ Pull-Up Enable bit" name="U1OTGCON__DPPULUP">
        <value caption="D+ data line pull-up resistor is enabled" name="" value="0x1"/>
        <value caption="D+ data line pull-up resistor is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Operation Enable bit" name="U1PWRC__USBPWR">
        <value caption="USB module is turned on" name="" value="0x1"/>
        <value caption="USB module is disabled (Outputs held inactive" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Suspend Mode bit" name="U1PWRC__USUSPEND">
        <value caption="USB module is placed in Suspend mode (The 48 MHz USB clock will be gated off. The transceiver is placed in a low-power state.)" name="" value="0x1"/>
        <value caption="USB module operates normally" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Module Busy bit" name="U1PWRC__USBBUSY">
        <value caption="USB module is active or disabled" name="" value="0x1"/>
        <value caption="USB module is not active and is ready to be enabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Sleep Entry Guard bit" name="U1PWRC__USLPGRD">
        <value caption="Sleep entry is blocked if USB bus activity is detected or if a notification is pending" name="" value="0x1"/>
        <value caption="USB module does not block Sleep entry" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Activity Pending bit" name="U1PWRC__UACTPND">
        <value caption="USB hardware has detected a change in link status; however" name="" value="0x1"/>
        <value caption="An interrupt is not pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="(Device mode) USB Reset Interrupt bit Device mode / (Host mode)USB Detach Interrupt bit Host mode" name="U1IR__URSTIF_DETACHIF">
        <value caption="(Device mode)Valid USB Reset has occurred / (Host mode)Peripheral detachment was detected by the USB module" name="" value="0x1"/>
        <value caption="(Device mode)o USB Reset has occurred / (Host mode)Peripheral detachment was not detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Error Condition Interrupt bit" name="U1IR__UERRIF">
        <value caption="Unmasked error condition has occurred" name="" value="0x1"/>
        <value caption="Unmasked error condition has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="SOF Token Interrupt bit" name="U1IR__SOFIF">
        <value caption="SOF token received by the peripheral or the SOF threshold reached by the host" name="" value="0x1"/>
        <value caption="SOF token was not received nor threshold reached" name="" value="0x0"/>
      </value-group>
