Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-W_DFP/1.3.177/atdf/PIC32MZ1025W104132.atdf
      <value-group caption="USB" name="U1CNFG1__UOEMON">
        <value caption="OE signal is active; it indicates intervals during which the D+/D- lines are driving" name="" value="0x1"/>
        <value caption="OE signal is inactive" name="" value="0x0"/>
      </value-group>
      <value-group caption="USB Eye-Pattern Test Enable bit" name="U1CNFG1__UTEYE">
        <value caption="Eye-Pattern Test is enabled" name="" value="0x1"/>
        <value caption="Eye-Pattern Test is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP0__EPHSHK">
        <value caption="Endpoint Handshake is enabled" name="" value="0x1"/>
        <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP0__EPSTALL">
        <value caption="Endpoint n was stalled" name="" value="0x1"/>
        <value caption="Endpoint n was not stalled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP0__EPTXEN">
        <value caption="Endpoint n transmit is enabled" name="" value="0x1"/>
        <value caption="Endpoint n transmit is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP0__EPRXEN">
        <value caption="Endpoint n receive is enabled" name="" value="0x1"/>
        <value caption="Endpoint n receive is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP0__EPCONDIS">
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1"/>
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0"/>
      </value-group>
      <value-group caption="Retry Disable bit" name="U1EP0__RETRYDIS">
        <value caption="Retry NAKed transactions is disabled" name="" value="0x1"/>
        <value caption="Retry NAKed transactions is enabled; retry done in hardware" name="" value="0x0"/>
      </value-group>
      <value-group caption="Low-Speed Direct Connection Enable bit" name="U1EP0__LSPD">
        <value caption="Direct connection to a low-speed device is enabled" name="" value="0x1"/>
        <value caption="Direct connection to a low-speed device is disabled; hub required with PRE_PID" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP1__EPHSHK">
        <value caption="Endpoint Handshake is enabled" name="" value="0x1"/>
        <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP1__EPSTALL">
        <value caption="Endpoint n was stalled" name="" value="0x1"/>
        <value caption="Endpoint n was not stalled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP1__EPTXEN">
        <value caption="Endpoint n transmit is enabled" name="" value="0x1"/>
        <value caption="Endpoint n transmit is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP1__EPRXEN">
        <value caption="Endpoint n receive is enabled" name="" value="0x1"/>
        <value caption="Endpoint n receive is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP1__EPCONDIS">
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1"/>
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP2__EPHSHK">
        <value caption="Endpoint Handshake is enabled" name="" value="0x1"/>
        <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP2__EPSTALL">
        <value caption="Endpoint n was stalled" name="" value="0x1"/>
        <value caption="Endpoint n was not stalled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP2__EPTXEN">
        <value caption="Endpoint n transmit is enabled" name="" value="0x1"/>
        <value caption="Endpoint n transmit is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP2__EPRXEN">
        <value caption="Endpoint n receive is enabled" name="" value="0x1"/>
        <value caption="Endpoint n receive is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP2__EPCONDIS">
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1"/>
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Handshake Enable bit" name="U1EP3__EPHSHK">
        <value caption="Endpoint Handshake is enabled" name="" value="0x1"/>
        <value caption="Endpoint Handshake is disabled (typically used for isochronous endpoints)" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Stall Status bit" name="U1EP3__EPSTALL">
        <value caption="Endpoint n was stalled" name="" value="0x1"/>
        <value caption="Endpoint n was not stalled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Transmit Enable bit" name="U1EP3__EPTXEN">
        <value caption="Endpoint n transmit is enabled" name="" value="0x1"/>
        <value caption="Endpoint n transmit is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Receive Enable bit" name="U1EP3__EPRXEN">
        <value caption="Endpoint n receive is enabled" name="" value="0x1"/>
        <value caption="Endpoint n receive is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Bidirectional Endpoint Control bit" name="U1EP3__EPCONDIS">
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Disable Endpoint n from Control transfers; only TX and RX transfers allowed / (else)bit is ignored" name="" value="0x1"/>
        <value caption="(If EPTXEN is 1 and EPRXEN is 1)Enable Endpoint n for Control (SETUP) transfers; TX and RX transfers also allowed / (else)bit is ignored" name="" value="0x0"/>
      </value-group>
